{
  "markdown": "KL +[603-2180 5023](tel:+60321805023)\n/[5025](tel:+60321805025)\n [ahibs@utm.my](mailto:ahibs@utm.my)\n\nDBA \n====\n\n#### Doctoral Business Administration\n\nDBA  is a professional research degree, designed with aims to advanced business knowledge and develop sound leadership skills. The programme is suitable for professionals with number of years of working experience who wished to progress in their career through a life-long learning education.\n\nI realise when I registered for Doctorate in Business Administration (DBA), it is crucial to be able to balance work and study. But the amount of knowledge and networking that I gained from the programme has helped me a lot in my career. \n\nTs. Haslinda Rasip\n\nChief Technology Officer, Dropee Malaysia\n\n\n\n#### Level - Postgraduate\n\nThe programme consists of two stages: the course stage and the research stage. \n\n\n\n#### Duration\n\nMinimum : 3 years\n\nMaximum : 8 years\n\n[Registration Information](https://business.utm.my/rk/)\n\ni\n\n#### Entry Requirement\n\n*   Master’s Degree with CGPA > 3.50 from UTM or other institutions approved by Senate OR\n*   Master’s Degree with CGPA >3.00 from UTM or other institutions plus a minimum of 5 years working experience\n*   An English Certificate of IELTS/ TOEFL iBT with a score of Band 6.0/60 and above for international students\n\nRelevant working experience is highly preferred\n\n\n\n#### Class Mode : Face to Face\n\nClasses will be held at Azman Hashim International Business School Kuala Lumpur Campus.\n\nThe Core Courses\n----------------\n\n### Marketing Innovation\n\n#### Code: PBSA 1313\n\n#### Pre-Requisite Course(s): None\n\nThis course aims at critical evaluation of the contemporary concepts and tools for effectively marketing an innovation, particularly relating to High Tech innovations. It integrates product innovations with business model innovations as well as new innovations in marketing approaches. To create a sustainable competitive advantage, an innovation would require a distinctive approach to planning and implementing marketing strategy based on their relevant marketing mix including price, delivery, product offering, and promotion.\n\n### Business Economics and Policy\n\n#### Code: PBSA 1513\n\n#### Pre-Requisite Course(s): None\n\nThe main objective of this course is to provide comprehensive coverage of business economics and policies within the micro-macroeconomics theories and application to business decision-making.\n\n### People Leadership\n\n#### Code: PBSA 1613\n\n#### Pre-Requisite Course(s): None\n\nThis course is designed to equip aspiring and progressive executives with the key leadership principles and competencies to achieve sustainable business growth while emphatizing their people’s needs. \n\n### Advanced Decision Science and Data Analytics\n\n#### Code: PBSA 2113\n\n#### Pre-Requisite Course(s): None\n\nThis course is designed to equip ambitious professionals with a STEM background with a distinct set of skills for data driven organization in a digitized and globalized economy. \n\n### Accounting and Finance for Decision Making\n\n#### Code: PBSA 1413 \n\n#### Pre-Requisite Course(s): None\n\nThis course focuses on contemporary issues in accounting and finance. Its main aim is to provide advanced knowledge and develop a framework of how these issues are relevant and affect business operations.\n\n### Advanced Business Research\n\n#### Code: PBSA 1763\n\n#### Pre-Requisite Course(s): None\n\nThe course will be delivered in a series of modules by introducing action research employing mixed-method design through quantitative and qualitative approaches within a pragmatic research philosophy.\n\n### Research Practice I\n\n#### Code: PBSA 1773\n\n#### Pre-Requisite Course(s): Advance Business Research\n\nThis course is the continuation of Advanced Business Research. Students are required to choose action research as the mode of the project, and use a suitable company to work on real-life problem.\n\n### Research Practice II\n\n#### Code: PBSA 2733\n\n#### Pre-Requisite Course(s): Research Practice I\n\nIn the Research Practice II, the students are expected to complete the Action Research Cycle – 1. For Action Research Cycle 1, the students need to submit the first five chapters and present their report. \n\n### Business Sustainability Project\n\n#### Code: PBSA 2743\n\n#### Pre-Requisite Course(s): Research Practice II\n\nThe students are expected to produce a project proposal report which includes both the Action Research Cycles. Students are expected to produce at least one publication in an international journal.\n\n### Industry Residential and Business Innovation\n\n#### Code: PBSA 1323\n\n#### Pre-Requisite Course(s): None\n\nThe course focuses on improving innovative capabilities and research skills in designing strategies for sustainability.This course requires students to be placed in the industry to design and develop an innovation-oriented intervention plan for the problematic situation of an organization.\n\n### Global Innovation and Entrepreneurship\n\n#### Code: PBSA 2343\n\n#### Pre-Requisite Course(s): None\n\nThe course provides an overview of entrepreneurship and innovation in the global context. It covers the wide-ranging challenges and opportunities in the global economy, and the prospects and risks of industry revolution 4.0 to global entrepreneurs.\n\n### Consultancy for Change and Accelerators\n\n#### Code: PBSA 1213\n\n#### Pre-Requisite Course(s): None\n\nThis course offers learners to harness all consultancy skills against a real-world backdrop that revolves around strengths, potentials, positive achievement of organizations and communities. Learners will be exposed to visuals, dialogues, tools, and respective models.\n\n### Advancement of Research and Development\n\n#### Code: PBSA 1753\n\n#### Pre-Requisite Course(s): None\n\nThis course focuses on managing R&D in a corporate environment from both strategic and tactical perspectives. Students will evaluate how technology is used as a powerful tool of competitive advantage and growth.\n\nThe Elective Course\n-------------------\n\nUniversity Electives (3 credits) . The students need to choose one course only or any other University Electives offered at UTM\n\n### Organization Behaviour and Development\n\n#### Code: UBSS 6013  \nPre-Requisite Course(s): None\n\nThis course helps students integrate behavioural science theories, tools, concepts, and techniques learned in the lab to an OB application in a “real” organization. Students are expected to conceptualize and apply Organization Behaviour three-level of analysis and synthesize it with the theory and practice of Planned Change for individuals, groups and organizations.\n\n### Business Ethics, Responsibility and Sustainability\n\n#### Code: UBSS 6023  \nPre-Requisite Course(s): None\n\nThe course objectives will be achieved through various teaching and learning methods such as action learning on the community project and a critical examination of case studies that involved ethical issues and dilemmas on complex and controversial business problems.\n\nThe Research\n------------\n\n### Thesis\n\n#### Code: PBSA 3010  \nPre-Requisite Course(s): Business Sustainability Project\n\nThis is a practical project which integrates comprehensive and advanced business knowledge using Action Research Methodology to solve current critical issues in business organization. The student must defend their dissertation by highlighting their contribution and impact on the industry. At the end of the course, student has to submit the dissertation.\n\nContact Us\n----------\n\n### For Admission Purpose\n\nEmail: [pgrad@utm.my](mailto:pgrad@utm.my)\n  \nTelephone: +6075537900  \nWebsite:  [http://admission.utm.my](http://admission.utm.my/)\n\n### For DBA programme\n\nName:  Head Of DBA Programme  \nEmail : [dba.ahibs@utm.my](mailto:dba.ahibs@utm.my)\n\n### For Course Registration\n\nName :  AHIBS KL Academic Office  \nEmail:  [academic.ahibs@utm.my](mailto:academic.ahibs@utm.my)\n  \nTelephone:  +603-2180 5023/5024/5025\n\nMore on AHIBS\n=============\n\n[View other postgraduate courses](https://business.utm.my/ahibs-postgraduate/)\n\nShare via:\n\n*   [Facebook](https://business.utm.my/dba#)\n    \n*   [Twitter](https://business.utm.my/dba#)\n    \n*   [LinkedIn](https://business.utm.my/dba#)\n    \n*   [More](https://business.utm.my/dba#)\n    \n\n \n\nShare via[](https://business.utm.my/dba#)\n\n[Facebook](https://business.utm.my/dba#)\n\n[X (Twitter)](https://business.utm.my/dba#)\n\n[LinkedIn](https://business.utm.my/dba#)\n\n[Mix](https://business.utm.my/dba#)\n\n[Email](https://business.utm.my/dba#)\n\n[Print](https://business.utm.my/dba#)\n\n[Copy Link](https://business.utm.my/dba#)\n\nPowered by [Social Snap](https://socialsnap.com/?utm_source=WordPress&utm_medium=link&utm_campaign=inthewild)\n\nCopy link[](https://business.utm.my/dba#)\n\n [CopyCopied](https://business.utm.my/dba#)\n\nPowered by [Social Snap](https://socialsnap.com/?utm_source=WordPress&utm_medium=link&utm_campaign=inthewild)"
}