{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/utm-town-planning-expert-environmentally-sustainable-cities-get-the-basics-right#)\n    \n*   [Instagram](https://builtsurvey.utm.my/utm-town-planning-expert-environmentally-sustainable-cities-get-the-basics-right#)\n    \n*   [RSS](https://builtsurvey.utm.my/utm-town-planning-expert-environmentally-sustainable-cities-get-the-basics-right#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/utm-town-planning-expert-environmentally-sustainable-cities-get-the-basics-right#)\n    \n*   [Instagram](https://builtsurvey.utm.my/utm-town-planning-expert-environmentally-sustainable-cities-get-the-basics-right#)\n    \n*   [RSS](https://builtsurvey.utm.my/utm-town-planning-expert-environmentally-sustainable-cities-get-the-basics-right#)\n    \n\nUTM Town Planning Expert: Environmentally Sustainable Cities? Get the Basics Right!\n===================================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Aug 1, 2018 | [News](https://builtsurvey.utm.my/category/news/)\n, [UTM News](https://builtsurvey.utm.my/category/utm-news/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2018/08/WhatsApp-Image-2018-07-29-at-11.35.00-AM-1080x675.jpeg)\n\n**Kuala Lumpur, 29 July** – UTM _Faculty of Built Environment and Surveying_ (_FBES_) Senior Lecturer, TPr. Chau Loon Wai, stressed to an audience of town planning professionals the importance of getting the basics right if we were to make real progress in building environmentally sustainable cities in Malaysia.  The well received point was made at the _PLANMalaysia Expert Talk 2018_, themed “Environmentally Sustainable Cities”, which was held on 27 July 2018 at Wisma Tun Sambanthan, Kuala Lumpur.\n\nTPr. Chau appeared as an invited speaker representing the academia alongside three other practising town planners in the expert talk, which was part of a series organised by _PLANMalaysia_ (previously known as the _Federal Town and Country Planning Department_, _JPBDSM_), the highest authority overseeing the town and country planning activities in Malaysia.\n\nThe expert talk was officiated by the _PLANMalaysia_ Director General, Y.Bhg. Dato’ TPr. Hjh. Rokibah Abdul Latif and attended by 188 town planners from the Federal and State level _PLANMalaysia_ offices, local authorities, private practices as well as the academia.\n\nIn his 30-minute sharing entitled “Environmentally Sustainable Cities? Getting there means getting the basics right!”, TPr. Chau got the audience to take a hard look at the actual current state of (un)sustainability of Malaysian cities despite countless well-intent efforts spanning at least two-and-half decades by town planners.  He then asserted that environmental sustainability is not only about having the right intention and proposing big concepts but it is importantly about getting back to the basics, of dealing with issues in real places involving real people.  He stressed the need to go beyond [“sustainababble”](https://link.springer.com/chapter/10.5822/978-1-61091-458-1_1)\n and begin implementing small, direct actions in places that would yield real positive impacts on people’s quality of life, for example of delivering urban environments that are friendly to children, the elderly, women and people with disability (PWD).\n\nThe talk was concluded with the highlighting of the importance of urban design in advancing environmental sustainability; of integrating planning and design across the national, state and local levels; as well as of involving in a deep way the people for and with whom we plan. As Co-Director of the _UTM-Low Carbon Asia Research Centre_ (_UTM-LCARC_) and Associate Research Fellow of the _Centre for Innovative Planning and Development_ (_CIPD_), Faculty of Built Environment and Surveying, TPr. Chau also took the opportunity to briefly share major accomplished and on-going research works of the centres and stated UTM’s commitment to continuously collaborating with _PLANMalaysia_ and the Malaysian planning profession towards contributing to better urban and regional planning. \n\n [](https://builtsurvey.utm.my/wp-content/uploads/2018/08/1.jpg)\n[![](https://builtsurvey.utm.my/wp-content/uploads/2018/08/1.jpg)](https://builtsurvey.utm.my/wp-content/uploads/2018/08/1.jpg)\n\nExpert Talk Moderator introduces TPr. Chau Loon Wai.\n\n [](https://builtsurvey.utm.my/wp-content/uploads/2018/08/WhatsApp-Image-2018-07-29-at-11.34.56-AM.jpeg)\n[![](<Base64-Image-Removed>)](https://builtsurvey.utm.my/wp-content/uploads/2018/08/WhatsApp-Image-2018-07-29-at-11.34.56-AM.jpeg)\n\nTPr. Chau: Environmentally Sustainable Cities? Getting there means getting the basics right!\n\n[![](<Base64-Image-Removed>)](https://builtsurvey.utm.my/wp-content/uploads/2018/08/2-1.jpg)\n\nOne for the record: Expert Talk speakers (TPr. Chau stands second from left) and moderator on stage with _PLANMalaysia_ Director General, YBhg Dato’ TPr. Hjh. Rokibah Abdul Latif (centre) and _PLANMalaysia_ Deputy Director General, YBhg Dato’ TPr. Hj.  Mohd Anuar Maidin (third from left)."
}