{
  "markdown": "Academic Office : +607-5333716 | Email : academic-fcee@utm.my | Administration Office : +607-5533499 [fcee@utm.my](mailto:fcee@utm.my)\n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n[![](https://fkt.utm.my/wp-content/uploads/2023/03/METR-724x1024.jpg \"METR\")](https://fkt.utm.my/wp-content/uploads/2023/03/METR-scaled.jpg)\n\n###### _Updated : 10 March 2023_\n\n**MASTER OF SCIENCE (M.Sc) IN POLYMER TECHNOLOGY**\n\nPolymer science and technology is a fast moving field that has had a major impact on the way we live. It allows us to develop ever more sophisticated materials to suit the needs of society and the planet. This programme is designed to give you a broad understanding of polymer science and technology with a focus on the underlying properties of polymers in relation to their utilisation in industrial applications. The programme covers the latest science and technology of plastics, rubbers and composites including aspects of nanotechnology and biomaterials. Core study areas include polymer synthesis, polymer processing, polymer additive, blend and rheology, polymer physics and properties, polymer characterization and a project dissertation. The optional study areas include surface and foam technology and rubber and latex technology. In order to meet the manpower and R&D demand of the industry, the Department of Bioprocess and Polymer Engineering, Universiti Teknologi Malaysia offers Master of Science in Polymer Technology (mixed mode).\n\n**Benefits:**\n\nTo produce graduates who are capable of conducting systematic research, conducting lifelong learning and contribute towards knowledge and wealth creation.\n\n*   [Programme Specifications](https://fkt.utm.my/msc-polymer-technology-2#)\n    \n*   [Programme Educational Objectives (PEO)](https://fkt.utm.my/msc-polymer-technology-2#)\n    \n*   [Programme Learning Outcomes (PLO)](https://fkt.utm.my/msc-polymer-technology-2#)\n    \n*   [Program Structure](https://fkt.utm.my/msc-polymer-technology-2#)\n    \n*   [General Entry Requirement](https://fkt.utm.my/msc-polymer-technology-2#)\n    \n*   [Entry requirement](https://fkt.utm.my/msc-polymer-technology-2#)\n    \n\nThe UTM Master of Science (Polymer technology) programme is offered on a full-time basis at the UTM main campus in Johor Bahru. The duration of study is one to four years. This programme is open for any graduates with a degree in science, technology and engineering. Graduates from other disciplines but with relevant experiences are also encouraged to apply.\n\n|     |     |\n| --- | --- |\n| PEO 1 | Mastery of knowledge and competency in advanced areas of Polymer Technology field. |\n| PEO 2 | Practice professionalism and high standards of ethical conducts within organization and society. |\n| PEO 3 | Responsive to changing situations by continuously acquiring new knowledge and skills. |\n\n|     |     |\n| --- | --- |\n| PLO 1 | Attain new frontiers of knowledge in the field of Polymer Technology. |\n| PLO 2 | Solve complex problems critically and integratively using systematic approaches. |\n| PLO 3 | Apply practical skills to solve problems in the field of Polymer Technology. |\n| PLO 4 | Demonstrate effective collaboration with stakeholders professionally. |\n| PLO 5 | Communicate effectively the knowledge, skills and ideas using appropriate methods to peers, experts and communities. |\n| PLO 6 | Use digital technologies and appropriate softwares competently to enhance study and practice. |\n| PLO 7 | Evaluate numerical and graphical data critically using quantitative or qualitative tools in solving problems. |\n| PLO 8 | Demonstrate leadership, autonomy and responsibility in managing resources. |\n| PLO 9 | Engage self-advancement through continuous learning or professional development. |\n| PLO 10 | Demonstrate entrepreneurial skills with relevant knowledge and expertise. |\n| PLO 11 | Demonstrate respectable ethical conducts and professionalism skills in an organization and society. |\n\n**Program structure: Intake Semester 1**\n\n![](https://fkt.utm.my/wp-content/uploads/2023/03/METR-Program-structure-Intake-Semester-1.jpg)\n\n**Program structure: Intake Semester 2**\n\n**![](https://fkt.utm.my/wp-content/uploads/2023/03/METR-Program-structure-Intake-Semester-2.jpg)**\n\n*   A Bachelor’s Degree with good honours from Universiti Teknologi Malaysia or any other institution of higher learning recognised by the Senate; or\n*   A qualification equivalent to a Bachelor’s Degree and experience in the relevant field recognised by the Senate.\n\n![](https://fkt.utm.my/wp-content/uploads/2023/03/METR-General-Entry-Requirement-1.jpg)\n\n![](https://fkt.utm.my/wp-content/uploads/2023/03/METR-General-Entry-Requirement-2.jpg)\n\n1.  Bachelor of Chemical Engineering with a minimum CGPA of 2.50 or equivalent, or\n2.  Bachelor of Science with a minimum CGPA of 2.50 or equivalent, or\n3.  Bachelor of Engineering with a minimum CGPA of 2.50 or equivalent, or\n4.  Bachelor of Technology with a minimum CGPA of 2.50 or equivalent, or\n5.  Other Bachelor’s Degree with at least CGPA 2.50 or equivalent and approved and recognized by the UTM Senate \n\n**English Requirement for International Students:**\n\n*   minimum English Test of English as a Foreign Language (TOEFL) score 550 or International English Language Test System (IELTS) band 6.0.\n*   Exceptions can be given to foreign candidates who are from a country whose native language is English or have a degree from that country.\n*   Candidates who do not have one of these qualifications are required to take the University English Test before registering for the program of study.\n*   If they fail, candidates are required to follow the Intensive English Program and pass before being allowed to continue their respective programs of study."
}