{
  "markdown": "SMART GRID: Architecture & Enabling Communications Technologies\n===============================================================\n\nby [commpic](https://fke.utm.my/author/commpic/ \"Posts by commpic\")\n | Dec 7, 2016 | [COMM](https://fke.utm.my/category/comm/)\n\n**Speakers:** Dr. Anthony Lo, Delf University of Technology (TU), The Netherlands\n\n**Date & Time:**14 January 2013; 9:00 am – 12:30 pm\n\n**Venue:** Demo Room 1 P16\n\n**Organizer:** [UTM MIMOS Center of Excellent](https://fke.utm.my/utmmimos/index.php)\n and Communication Engineering Department\n\n**Bibliography:** Dr. Anthony Lo has over ten years of experience in mobile and wireless communications. He is currenttly an Assistant Professor at Delft University of Technology in The Netherlands. He actively participates in EU research projects which focus on next-generation wireless networks and, recently on Machine-to-Machine communications and Smart Grid. Prior to joining Delft University of Technology, he worked at Ericsson Eurolab where he was actively involved in UMTS/HSDPA research and development. He received his combined BS/BE degree with first class Honours in Computer Science and Electronics Engineering in 1991 and his Ph.D degree in Protocol and Network Engineering in 1996, all from La Trobe University, Australia. He is a member of ACM, and senior member of IEEE.\n\n**Abstract:** Today’s electric power system is antiquated, inefficient, plagued by blackouts and unable to meet the ever-growing demand of tomorrow’s consumers. Thus, the electric power industry around the world is undergoing a major transformation. The entire supply chain of electricity – from generation, transmission, distribution to consumption – is being overhauled with the goal of creating a power grid that saves energy; improves efficiency, quality and reliability; and reduces costs. Such a newly transformed electric infrastructure is referred to as smart grid. Unlike the traditional power grid, smart grid incorporates distributed renewable energy resources (e.g., solar panels and wind turbines) and storage (e.g., fuel cells) and plays an active role in in-premises energy management by coordinating low priority in-premises devices so that power consumption at the consumer side is reduced during peak hours. The tutorial will start with an introduction to the basic building blocks of the electric power system. Then we study the high-level conceptual smart grid architecture that is envisioned by standardization bodies such as ETSI and NIST. We will examine the new features of smart grid, which include Advanced Metering Infrastructure (AMI), demand response, Wide-Area Monitoring System (WAMS), distributed energy resources and storage, electric transportation, and distribution grid management. Last but not least, we will outline the eminent communications technologies and protocols for realizing the smart grid features, namely ZigBee Smart Energy Profile Specification and 3GPP LTE-Advanced in the context of Machine-to-Machine (M2M) communications, IEC 61850, IEEE C37.118 and IETF 6LoWPAN.\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/smart-grid-architecture-enabling-communications-technologies#)"
}