{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/planning-students-waterfront#)\n    \n*   [Instagram](https://builtsurvey.utm.my/planning-students-waterfront#)\n    \n*   [RSS](https://builtsurvey.utm.my/planning-students-waterfront#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/planning-students-waterfront#)\n    \n*   [Instagram](https://builtsurvey.utm.my/planning-students-waterfront#)\n    \n*   [RSS](https://builtsurvey.utm.my/planning-students-waterfront#)\n    \n\nUTM Planning Student’s Waterfront Vision Won the Heart of International Judges\n==============================================================================\n\nby [webmaster FAB](https://builtsurvey.utm.my/author/norazreen/ \"Posts by webmaster FAB\")\n | Apr 4, 2013 | [Featured Slider](https://builtsurvey.utm.my/category/featured-slider/)\n, [News](https://builtsurvey.utm.my/category/news/)\n, [Uncategorized](https://builtsurvey.utm.my/category/uncategorized/)\n\nTwo teams of 8 students from Universiti Teknologi Malaysia’s Bachelor of Urban and Regional Planning Program won the heart of an eminent panel of international judges with their innovative and visionary ideas for a sustainable waterfront in Iskandar Malaysia.  The UTM teams, which hailed from the Department of Urban and Regional Planning, Faculty of Built Environment, bagged the 1st and 2nd Runners Up in Category C of the ‘Planning a Clean & Green Waterfront: Youth Leaders for a Sustainable Future Competition 2013’, which pitched them against top Singaporean tertiary institutions.\n\n The prestigious competition, which commenced on 02 February 2013 and concluded in the Final Prototype Building and Prize Award Ceremony on 17 March 2013, was organised by Activistar Private Limited, Singapore.\n\n The competition featured prominent international partners/sponsors such as the Iskandar Regional Development Authority (IRDA); the Urban Land Institute (ULI); International Society of City and Regional Planners (ISOCARP); Future Cities Laboratory (FCL) by ETH Zurich and Singapore’s National Research Foundation (NRF); and Centre for Liveable Cities Singapore.  The competition was supported by the Swiss Embassy; Embassy of Vietnam; the Belgium Embassy; the National Institute of Education (NIE) Singapore; Asia Europe Foundation; Holcim; Procter & Gamble; Pacific Radiance; Mulpha Holdings; and Keppel Land International, among others.\n\n The panel of judges comprised ambassadors, professors, CEOs and senior officials from the above partners/sponsors.\n\n Five UTM teams comprising 20 Year-3 Bachelor of Urban and Regional Planning students, guided by five young academic staff, submitted five proposals to the competition and all five teams were admitted to the final after strict screenings of proposals, pitching them against five other finalists from Singaporean tertiary institutions.  In the final rounds, finalists were required to orally present and defend their proposals before a select panel of judges (16 March) and construct a prototype model of their proposal in three hours (17 March), after which the final judgment was made.\n\n Chau Loon Wai (UTM Urban Planning Lecturer and Registered Town Planner) who led the UTM teams in the final rounds observed that the competition was stiff as each finalist team put forth and professionally defended their best innovative ideas.\n\n The two UTM teams’ advancement to the final and winning at the competition testify to the quality and effectiveness of research and teaching in the university, and the innovativeness and competency of UTM graduates, which are at least at par with prominent institutions in the region.\n\n The list of the UTM teams is as follows:\n\n**Team 1 – Tanjung Langsat Clean & Green Port City – 1st Runner Up**\n\nAnis Shazreen Azmi\n\nNorfadiera Ramli\n\nNur Shazwani Saari\n\nSaidah Sariff\n\n**Team 2 – Revisiting Puteri Garden – 2nd Runner Up**\n\nMohd Safuan Mohd Kamil\n\nMlysha Nurshyla Abd Rahim\n\nNuraisha Azmi\n\nNurul Fatin Mohd Jais\n\n**Team 3 – Equilibrium between Urban Scape and Nature (Finalist)**\n\nMohd Fadzil Abdullah\n\nMohd Shafiq Rasid\n\nNadhirah Nordin\n\nSiti Sarah Abdul Jabar\n\n**Team 4 – Laguna Waterfront Iskandar Malaysia (Finalist)**\n\nRohayu Abdullah\n\nNurul Farahen Ibrahim\n\nAdilah Jamaludin\n\nEfariza Abdul Hamit\n\n**Team 5 – The Re-development Plan of JB Waterfront (Finalist)**\n\nIskandar Mirza Abdul Aziz\n\nMohd Zaki Bahrudin\n\nMuhd Afize Adnan\n\nBadrul Amir Jusoh\n\n//"
}