{
  "markdown": "Institut Kemahiran MARA Visited UTM to Discuss Potential Optical Communication Training Programs\n================================================================================================\n\nby [commpic](https://fke.utm.my/author/commpic/ \"Posts by commpic\")\n | Apr 20, 2017 | [COMM](https://fke.utm.my/category/comm/)\n\n4th April 2017 – Members of Communication Engineering (COMM) Department who are the members of the Training Unit of the Lightwave Communication Research Group (LCRG) had a meeting with representatives from the Institut Kemahiran MARA (IKM), Johor Bahru. The meeting was held in conjunction with the visit from four IKM representatives to the Optical Communications Laboratory, which is under the tutelage of the COMM Department. LCRG Training Unit and the IKM representatives took the opportunity to discuss the implementation of collaborative training activities related to the field of optical communication that could fulfill the IKM student learning needs. The two-hours meeting that began around 10 am ended by agreement of both sides to engage in a series of training programs for the IKM students. The training series will be hosted by the LCRG Training Unit using existing facilities in Optical Communications Laboratory. The prearranged training programs are expected to benefit both parties.\n\n![](https://fke.utm.my/wp-content/uploads/sites/9/2017/04/art31-5.png)\n\n![](https://fke.utm.my/wp-content/uploads/sites/9/2017/04/art31-6.png)\n\n* * *\n\n**Dr. Asrul Izam Azmi accompanies the representatives from IKM during their visit to the Optical Communication Laboratory (Left). The representatives from IKM are having discussion with the members of LCRG Training Unit (Right).**\n\n* * *\n\n[HOME](https://fke.utm.my/comm/)\n\n* * *\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/institut-kemahiran-mara-looks-forward-to-the-optical-communication-training-programs-at-utm-johor-bahru#)"
}