{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/pelajar-utm-kongsi-ilmu-astronomi-bersama-masyarakat-secara-maya#)\n    \n*   [Instagram](https://builtsurvey.utm.my/pelajar-utm-kongsi-ilmu-astronomi-bersama-masyarakat-secara-maya#)\n    \n*   [RSS](https://builtsurvey.utm.my/pelajar-utm-kongsi-ilmu-astronomi-bersama-masyarakat-secara-maya#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/pelajar-utm-kongsi-ilmu-astronomi-bersama-masyarakat-secara-maya#)\n    \n*   [Instagram](https://builtsurvey.utm.my/pelajar-utm-kongsi-ilmu-astronomi-bersama-masyarakat-secara-maya#)\n    \n*   [RSS](https://builtsurvey.utm.my/pelajar-utm-kongsi-ilmu-astronomi-bersama-masyarakat-secara-maya#)\n    \n\nPelajar UTM Kongsi Ilmu Astronomi Bersama Masyarakat Secara Maya\n================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Feb 21, 2021 | [News](https://builtsurvey.utm.my/category/news/)\n, [photo](https://builtsurvey.utm.my/category/photo/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2021/02/unnamed1-1024x675.jpg)\n\nJOHOR BAHRU, 26 Jan. -– Para pelajar kursus Astronomi Lapangan dari Fakulti Alam Bina dan Ukur, Universiti Teknologi Malaysia (UTM) telah berjaya melaksanakan program bersama komuniti iaitu Field Astronomy Knowledge Transfer and Online Contest 2021dari 01 hingga 17 Januari 2021 yang lalu.\n\nProgram ini merupakan program Pembelajaran Servis yang telah dilaksanakan secara dalam talian.\n\nKursus Astronomi Lapangan telah diperkenalkan kepada para pelajar Tahun 3 Program Kejuruteraan Geomatik. Para pelajar telah mempelajari konsep asas astronomi dan aplikasinya dalam bidang Kejuruteraan Geomatik.\n\nKursus ini mendedahkan konsep alam semesta seperti galaksi dan sistem suria serta menekankan konsep sfera cakerawala, geometri, segitiga astronomi, dan persamaan asas segitiga sfera.\n\nPelajar dapat belajar jenis peralatan dan sistem koordinat, cerapan matahari dan bintang: azimuth, garis lintang, garis bujur stesen kawalan yang digunakan dalam budang ukur kadaster, geodesi, dan astronomi Islam. Kursus ini juga menerapkan elemen libatsama komuniti melalui kaedah pembelajaran servis.\n\nPelajar dikehendaki melaksanakan aktiviti seperti forum, webinar, klinik, seminar atau lain-lain berkaitan astronomi untuk berkongsi pengetahuan bersama komuniti. Oleh itu, pelajar boleh mempraktikkan pengetahuan astronomi dan kemahiran bermasyarakat serta menunjukkan kebolehan bekerja secara berkumpulan dan komunikasi dengan baik dalam melaksanakan sesuatu program.\n\nProgram Field Astronomy Knowledge Transfer and Online Contest 2021 ini telah dibahagikan kepada 4 sub-program utama iaitu Menelusuri Perjuangan Ahli Astronomi, Meneroka Sistem Suria, Living Among Giants dan Ilmu Falak dan Siapa Disebaliknya.\n\nKesemua program ini telah disasarkan kepada para pelajar sekolah rendah, sekolah menengah, Pra Universiti dan Institusi Pengajian Tinggi serta orang awam.\n\n![](https://ci3.googleusercontent.com/proxy/w5j0rVfUP-5ayi-01tTDKVQ_Q5q4cBOnKhhhsLuCC1Q7MTofHBoUpSvGtSMdSaReb5E517ptunq7wuvSXC7ZzTf4H8ZJWXAVsmQ=s0-d-e1-ft#https://news.utm.my/wp-content/uploads/2021/02/pic2.png)\n\n![](<Base64-Image-Removed>)\n\n![](<Base64-Image-Removed>)\n\nProgram ini diadakan dalam pelbagai aplikasi maya seperti Google Meet, Webex dan Facebook Live.\n\nSeramai 300 orang peserta dari pelbagai latar belakang pendidikan telah menyertai program ini.\n\nPenganjuran program ini telah diketuai oleh Gs Sr Dr. Othman bin Zainon iaitu pensyarah kursus Astronomi Lapangan. Program ini telah dibahagikan kepada beberapa aktiviti seperti perkongisan ilmu astronomi, sesi soal jawab, slot demostrasi dan latih amal bersama para peserta serta pertandingan seperti kuiz atas talian, fotografi astronomi dan mewarna bertemakan astronomi.\n\nPeserta juga diberi pendedahan secara hands-on bagi aktiviti buruj bintang menerusi aktiviti latih amal yang dibuat bersama para peserta.\n\n![](<Base64-Image-Removed>)\n\n![](<Base64-Image-Removed>)![](<Base64-Image-Removed>)\n\nMajlis Penutup bagi setiap program telah disempurnakan oleh Gs Sr Dr Othman Bin Zainon, Pensyarah Kokurikulum Astronomi Universiti Teknologi Malaysia.\n\nSecara keseluruhan, program ini telah mencapai objektifnya iaitu untuk berkongsi ilmu astronomi kepada masyarakat Malaysia. Pengajuran program ini dapat memberi impak yang tinggi kepada masyarakat di dalam meningkatkan pembelajaran STREAM di negara ini.\n\nUntuk maklumat lanjut sila hubungi:\n\nGs Sr Dr. Othman bin Zainon ([othmanz.kl@utm.my](mailto:othmanz.kl@utm.my)\n)  \nFakulti Alam Bina dan Ukur\n\nUniversiti Teknologi Malaysia"
}