{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/planting-tagging-and-monitoring-of-trees-as-a-way-to-mitigate-climate-change#)\n    \n*   [Instagram](https://builtsurvey.utm.my/planting-tagging-and-monitoring-of-trees-as-a-way-to-mitigate-climate-change#)\n    \n*   [RSS](https://builtsurvey.utm.my/planting-tagging-and-monitoring-of-trees-as-a-way-to-mitigate-climate-change#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/planting-tagging-and-monitoring-of-trees-as-a-way-to-mitigate-climate-change#)\n    \n*   [Instagram](https://builtsurvey.utm.my/planting-tagging-and-monitoring-of-trees-as-a-way-to-mitigate-climate-change#)\n    \n*   [RSS](https://builtsurvey.utm.my/planting-tagging-and-monitoring-of-trees-as-a-way-to-mitigate-climate-change#)\n    \n\nPlanting, Tagging and Monitoring of Trees as A Way to Mitigate Climate Change\n=============================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | May 30, 2019 | [CSR](https://builtsurvey.utm.my/category/csr/)\n, [News](https://builtsurvey.utm.my/category/news/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2019/05/1-2-581x640.png)\n\nUTM TropicalMap Research Group from the Faculty of Built Environment and Surveying led by Associate Prof. Dr. Kasturi Devi Kanniah has organized a tree planting event at SJKT Ladang Kulai Besar. A total of 65 neem (_Azadirachta Indicus_) tree seedlings were planted at the school ground. The tree seedlings were donated by “Green Earth Society (GES)”, a non-profit organization (NGO) that strives to ensure that the uniqueness, diversity and quality of the environment is maintained to secure the well-being, safety and comfort of the present and future generations. A total of 95 primary school and UTM students, teachers, parents and GES volunteers participated in the event. The first year UTM students of “Geography Studies” were also exposed to service learning which is one of the 21st century teaching and learning components that is incorporated in this programme.\n\nThe trees were tagged using a GeoTrees Mobile app (UTM.J.14.01/27.13/1 JLD94(20)) that was developed by a group of researchers from the TropicalMap Research Group. The GeoTrees apps is currently available on Android Play Store and can be used via QR codes to scan and store geodatabase. This app is used to record tree biophysical parameters such as tree height, diameter at breast height, tree canopy and their geographical locations (latitude and longitude) of any new and previously planted trees. Teachers and students of SJKT Ladang Kulai Besar were taught on how to conduct tree inventory using GeoTrees so that they can continuously monitor the trees’ growth and deliver data to the server. The server can be viewed by the public once geodata has been recorded in the GeoTrees apps. The server’s website can be viewed in real time where it shows the distribution of trees planted and detailed information of each tree.\n\nFour years ago, on 24th May 2015, UTM TropicalMap RG planted the same tree species at the school. The trees have grown and are believed to be functioning well which help to absorb carbon dioxide, provide oxygen and offer shade and habitat for birds. Data collected through GeoTrees mobile apps are used to calculate the trees’ ability to sequester and store carbon. Planting trees in urban forests and parks can help to mitigate climate change. These efforts can help to filter polluted air, impound storm water to reduce flash floods and other disasters, increase the cooling effect and mitigate urban heat island effects, reduce energy use and contribute to low carbon emissions in cities and increase property values."
}