{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/womens-role-in-development-of-sustainable-cities-highlighted-in-new-exhibit#)\n    \n*   [Instagram](https://builtsurvey.utm.my/womens-role-in-development-of-sustainable-cities-highlighted-in-new-exhibit#)\n    \n*   [RSS](https://builtsurvey.utm.my/womens-role-in-development-of-sustainable-cities-highlighted-in-new-exhibit#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/womens-role-in-development-of-sustainable-cities-highlighted-in-new-exhibit#)\n    \n*   [Instagram](https://builtsurvey.utm.my/womens-role-in-development-of-sustainable-cities-highlighted-in-new-exhibit#)\n    \n*   [RSS](https://builtsurvey.utm.my/womens-role-in-development-of-sustainable-cities-highlighted-in-new-exhibit#)\n    \n\nWomen's role in development of sustainable cities highlighted in new exhibit\n============================================================================\n\nby [webmaster FAB](https://builtsurvey.utm.my/author/norazreen/ \"Posts by webmaster FAB\")\n | Oct 11, 2016 | [In The Press](https://builtsurvey.utm.my/category/in-the-press/)\n, [News](https://builtsurvey.utm.my/category/news/)\n, [newspaper](https://builtsurvey.utm.my/category/newspaper/)\n\nKUALA LUMPUR: In this modern era, women across the globe have demonstrated beyond a doubt that they are capable of matching their male counterparts in almost every field, given the right exposure and opportunity.\n\nAt the “Female Faces & Malaysia Sustainable Cities” exhibition, taking place at the National Visual Arts Gallery (NVAG) here, around 20 Malaysian women are featured, from policy makers to social entrepreneurs, who play a key role in formulating and implementing policies for sustainable development in Malaysia.\n\nSome of the female faces include National Council of Women’s Organisations Malaysia president Professor Tan Sri Dr Sharifah Hapsah Syed Hasan Shahabudin, Students Volunteer Foundation founder and chairperson Datuk Zuraidah Atan, and former Bank Negara governor Tan Sri Zeti Akhtar Aziz.\n\nUniversiti Teknologi Malaysia (UTM)’s Institute Sultan Iskandar executive director Prof Dr Mohd Hamdan Ahmad said that in the process of studying sustainable cities development efforts, the programme captured the role of women as agents of change in Malaysia’s major cities, thus the exhibition intends to disseminate the message of the MSCP while honouring these Malaysian women.\n\nThe exhibition also includes a variety of physical, audio and immersive ‘artefact’ interviews and video documentaries on broad aspects of sustainability in Malaysian cities. It presents 75 works of field photography, 21 video interviews and 19 research documentaries as the findings of MSCP under one roof.\n\nSupported by the Higher Education Ministry, the exhibition is a joint collaboration between Universiti Teknologi Malaysia (UTM) and Massachusetts Institute of Technology (MIT), displaying the outcome of the UTM-MIT Malaysia Sustainable Cities Programme (MSCP).\n\nUTM vice-chancellor Prof Datuk Ir Dr Wahid Omar said the five-year programme addresses pressing sustainable issues faced with rapid development, with the aim of making Malaysia an example of sustainable development. “Sustainable development issues featured include climate change, conservation of ecosystems, housing, tourism, traffic and transportation, green building and preserving cultural assets. “They are observed in five major Malaysian cities, namely Johor Baru, Kuala Lumpur, George Town, Putrajaya and Kuching.”\n\nThe exhibition, which began on Oct 8, was officiated by the Education Ministry’s director of higher education (excellence planning division) Prof Dr Raha Abdul Rahim. The first facet of the exhibition, entitled “Female Faces in Sustainable Places” was held at the MIT’s Wolk Gallery, from April 30 to July 31, 2015. The current exhibition at NVAG is a reciprocal arrangement which expands upon the history of the collaboration programme and findings from international scholars.\n\nThe exhibit will continue until Nov 13 and is open to the public.\n\n![In this modern era, women across the globe have demonstrated beyond a doubt that they are capable of matching their male counterparts in almost every field, given the right exposure and opportunity. At the “Female Faces & Malaysia Sustainable Cities” exhibition, taking place at the National Visual Arts Gallery (NVAG) here, around 20 Malaysian women are featured, from policy makers to social entrepreneurs, who play a key role in formulating and implementing policies for sustainable development in Malaysia. (Pix by MOHD YUSNI ARIFFIN) – NST](http://assets.nst.com.my/images/articles/12asdfcsdfawefweghyu.transformed.jpg)\n\nIn this modern era, women across the globe have demonstrated beyond a doubt that they are capable of matching their male counterparts in almost every field, given the right exposure and opportunity. At the “Female Faces & Malaysia Sustainable Cities” exhibition, taking place at the National Visual Arts Gallery (NVAG) here, around 20 Malaysian women are featured, from policy makers to social entrepreneurs, who play a key role in formulating and implementing policies for sustainable development in Malaysia. (Pix by MOHD YUSNI ARIFFIN) – NST\n\nSource: [NST](http://www.nst.com.my/news/2016/10/179619/womens-role-development-sustainable-cities-highlighted-new-exhibit)\n (Tuesday, 11th October 2016)"
}