{
  "markdown": "KL +[603-2180 5023](tel:+60321805023)\n/[5025](tel:+60321805025)\n [ahibs@utm.my](mailto:ahibs@utm.my)\n\n![](https://business.utm.my/wp-content/uploads/2020/11/ResearchPage.png)\n\nResearch at AHIBS is multidisciplanry across different business fields. We have research projects that spread across different spectrum which include applied research, action research and case study writing. AHIBS research team has many collaborative projects with industry and government. Our researchers also conduct local and international research and consultancy projects in collaboration with government and leading multinational companies.\n\n**AHIBS Research Groups**\n=========================\n\nAHIBS Research Groups are dynamic and community-oriented, providing many opportunities for collaboration and innovation. Our academics conduct a world class research and are recognized in establishing partnership with industry and community. Learn more about the diverse research groups that committed in all areas in business and management, include: business strategy, innovation, economics, entrepreneurship, information systems, social value, marketing and service quality. \n\n[![](<Base64-Image-Removed>)](https://business.utm.my/research/ibsrg/)\n\n#### [IBSRG](https://business.utm.my/research/ibsrg/)\n\nInnovation and Business Strategy Research Group\n\n[![](<Base64-Image-Removed>)](https://business.utm.my/research/lsvrg-homepage)\n\n#### [LSV](https://business.utm.my/research/lsvrg-homepage)\n\nLearning and Social Value Research Group\n\n**AHIBS Action Research**\n=========================\n\nAt AHIBS, our students are exposed to Action Research approach for their final dissertation. It is a reflective process that allows for inquiry and discussion as components of the “research.” The action research project allows students to collaborate with industry to solve real world problems. Action research is a powerful tool for industry-academia collaboration.\n\nAs part of their action research journey, students have to undergo two important events in AHIBS:\n\n[![](<Base64-Image-Removed>)](https://business.utm.my/pitch-for-funding/)\n\n#### [PITCH FOR FUNDING](https://business.utm.my/pitch-for-funding/)\n\nThrough this program, the MBA students who enrolled in Business Research class (MBSA 1713) are invited to pitch their action research proposal. [Read More->](https://business.utm.my/pitch-for-funding/)\n\n[![](<Base64-Image-Removed>)](https://business.utm.my/aarc/)\n\n#### [AHIBS Action Research Challenge](https://business.utm.my/aarc/)\n\nThe programme aims in providing a platform for academics, MBA students and industry partners to share their experiences and research. [Read More->](https://business.utm.my/aarc/)\n\n### **AHIBS In-House Publication**\n\nThrough team-work between senior and junior faculties, from academic and industry backgrounds, AHIBS UTM passionately work to contribute in bridging knowledge gaps by developing its own journal – [International Journal of Innovation and Business Strategy (IJIBS)](http://business.utm.my/ijibs/)\n, performing discussion research group called AHIBS Oasis, and providing contextual-based training.\n\n##### **Current Issues in IJIBS**\n\n_Stakeholders’ Involvement as a Determinant of Students’ Academic…_  \nSulyman Kamaldeen Olohundare\n\n_Internal Quality Management Strategies of Universities in Kwara State,…_  \nAwodiji, Omotayo A., Ijaiya, Nike Y. S., Akinnubi, Olaolu P\n\n_Telecommute Acceptance and Work Performance: A Multiple Regression Analysis_  \nYap Zhan Zhang, Lim Qiao Yee, Mohd Khairudin Ruslan, Mohd Nizam Ibrahim, Joan Na Kelun, Yee Jia Jun\n\n_Gender Equality at the Workplace: Malaysia’s Stance and Prevailing…_  \nNoraliza Jalal, Reena Baskaran, Nirosha Tanga Rajoo, Sharmini Nair Prathaban, Prasath Ambalagan\n\n[Read More->](https://business.utm.my/ijibs/)\n\n![](<Base64-Image-Removed>)\n\nShare via:\n\n*   [Facebook](https://business.utm.my/research-2#)\n    \n*   [Twitter](https://business.utm.my/research-2#)\n    \n*   [LinkedIn](https://business.utm.my/research-2#)\n    \n*   [More](https://business.utm.my/research-2#)\n    \n\n \n\nShare via[](https://business.utm.my/research-2#)\n\n[Facebook](https://business.utm.my/research-2#)\n\n[X (Twitter)](https://business.utm.my/research-2#)\n\n[LinkedIn](https://business.utm.my/research-2#)\n\n[Mix](https://business.utm.my/research-2#)\n\n[Email](https://business.utm.my/research-2#)\n\n[Print](https://business.utm.my/research-2#)\n\n[Copy Link](https://business.utm.my/research-2#)\n\nPowered by [Social Snap](https://socialsnap.com/?utm_source=WordPress&utm_medium=link&utm_campaign=inthewild)\n\nCopy link[](https://business.utm.my/research-2#)\n\n [CopyCopied](https://business.utm.my/research-2#)\n\nPowered by [Social Snap](https://socialsnap.com/?utm_source=WordPress&utm_medium=link&utm_campaign=inthewild)"
}