{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/projek-utm-tiup-perubahan-komuniti-bandar-bukit-puchong#)\n    \n*   [Instagram](https://builtsurvey.utm.my/projek-utm-tiup-perubahan-komuniti-bandar-bukit-puchong#)\n    \n*   [RSS](https://builtsurvey.utm.my/projek-utm-tiup-perubahan-komuniti-bandar-bukit-puchong#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/projek-utm-tiup-perubahan-komuniti-bandar-bukit-puchong#)\n    \n*   [Instagram](https://builtsurvey.utm.my/projek-utm-tiup-perubahan-komuniti-bandar-bukit-puchong#)\n    \n*   [RSS](https://builtsurvey.utm.my/projek-utm-tiup-perubahan-komuniti-bandar-bukit-puchong#)\n    \n\nProjek UTM tiup perubahan komuniti Bandar Bukit Puchong\n=======================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Apr 1, 2019 | [CSR](https://builtsurvey.utm.my/category/csr/)\n, [News](https://builtsurvey.utm.my/category/news/)\n, [photo](https://builtsurvey.utm.my/category/photo/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2019/04/image.jpg)\n\nKerjasama antara pelajar Universiti Teknologi Malaysia (UTM) dengan penduduk dalam menjayakan 28 aktiviti Projek Rejuvenasi Pangsapuri 560 Bandar Bukit Puchong dekat sini hari ini menjadi platform meniup angin perubahan dalam komuniti setempat.\n\nKetua Projek, Prof. Madya Dr. Gurupiah Mursib berkata, Program Pemindahan Pengetahuan Teknologi dan Anak Angkat Pangsapuri 560 itu berjaya memindahkan ilmu-ilmu bermanfaat yang memberi impak kepada penduduk pangsapuri berkenaan.\n\n“Antara ilmu yang dikongsikan kepada komuniti di sini adalah bengkel penjagaan taman, asas hidroponik, projek pembaikan Laman Edible, bengkel asas perniagaan, pertukangan dan gunting rambut yang diperluas untuk menjana ekonomi penduduk.\n\n“Inisiatif ini berjaya membawa perubahan kepada komuniti pangsapuri khususnya melalui pembabitan golongan peringkat akar umbi yang sekali gus menjadi pencetus program rejuvenasi komuniti,” katanya.\n\nProgram di bawah kelolaan Pensyarah Fakulti Alam Bina dan Ukur UTM Skudai, Johor itu disertai seramai 60 pelajar fakulti yang turut dijadikan anak angkat penghuni pangsapuri selama empat hari program berlangsung sejak 28 Mac lalu.\n\nProgram tersebut mendapat kerjasama Majlis Perbandaran Subang Jaya (MPSJ) dan Institut Sultan Iskandar (ISI) UTM selaku perunding Projek Rintis Ruang Kejiranan: Projek Rejuvenasi Pangsapuri 560 Bandar Bukit Puchong."
}