{
  "markdown": "**Frequently Asked Questions**\n==============================\n\n### for Postgraduate Students\n\n### **HAL-HAL AKADEMIK / ACADEMIC MATTERS**\n\n##### Soalan 1 / Question 1\n\n**Q: Saya merupakan seorang calon pelajar UTM dan berminat untuk mendaftar bagi program Pascasiswazah di UTM. Bagaimanakah saya ingin mendapat maklumat mengenai penawaran program dan memohon untuk program UTM?**\n\nA : Bagi mendapat maklumat lanjut mengenai program Pascasiswazah UTM, maklumat berkaitan yuran dan syarat kemasukan, calon boleh melayari laman sesawang Bahagian Kemasukan dan Rekrutmen UTM https://admission.utm.my/\n\n_**Q: I am a prospective student of UTM and interested in registering for a Postgraduate program at UTM. How do I get information on program offerings and apply for the UTM program?**_\n\nA: For more information on the UTM Postgraduate program, information on fees and admission requirements, candidates can visit the UTM Admission and Recruitment Division website https://admission.utm.my/\n\n##### Soalan 2 / Question2\n\n**Q: Saya telah memohon dan mendapat surat tawaran bagi program Pascasiswazah UTM. Bagaimanakan saya boleh membuat pendaftaran secara atas talian?**\n\nA: Bagi proses pendaftaran, pelajar boleh merujuk di laman sesawang https://admission.utm.my/registrationkit/ bagi mengetahui proses pendaftaran program.\n\n**_Q: I have applied and received an offer letter for the UTM Postgraduate program. How can I register online?_**\n\n_A: For the registration process, students can refer to the website https://admission.utm.my/registrationkit/ to find out the registration process_\n\n##### Soalan 3 / Question 3\n\n**Q: Saya telah berjaya mendaftar pogram, apakah proses selanjutnya yang perlu saya lakukan?**\n\nA: Setelah pelajar telah mendaftar program, pelajar adalah dikehendaki untuk mendaftar kursus. Antara perkara yang perlu di semak sebelum pelajar mendaftar kursus adalah:-  \ni) Menyemak Study Plan Program yang diikuti  \nii) Menyemak Jadual Kuliah  \niii) Membuat pendaftaran kursus  \nNota: Pelajar perlu membuat pendaftaran kursus secara atas talian di Portal UTM my.utm.my dalam tempoh yang ditetapkan. Pelajar boleh merujuk jadual kerja yang boleh diakses di laman sesawang Bahagian Pengurusan Akademik. [https://amd.utm.my/work-schedule-pg/](https://amd.utm.my/work-schedule-pg/)\n\nBagi Item (i) dan (ii) maklumat boleh diperolehi di laman sesawang FSSH [https://humanities.utm.my/student/new-student-info/](https://humanities.utm.my/student/new-student-info/)\n\n_**Q: I have successfully registered for the program, what is the next process that I need to do?**_\n\n_A:  Once a student has registered for the program, the student is required to register for the course. Among the things that need to be checked before students register for the course are:-_  \n_i) Review the Study Plan of the Program_  \n_ii) Check the Lecture Schedule_  \n_iii) Complete the course registration_\n\n_Note: Students need to register for the course online via UTM Portal my.utm.my within the stipulated period. Students can refer to the work schedule which can be accessed on the Academic Management Division website. [https://amd.utm.my/work-schedule-pg/](https://amd.utm.my/work-schedule-pg/)\n_\n\n_For Items (i) and (ii) information can be obtained via the FSSH website [https://humanities.utm.my/student/new-student-info/](https://humanities.utm.my/student/new-student-info/)\n_\n\n##### Soalan 4 / Question 4\n\n**Q:  Saya seorang pelajar Phd, kursus apakah yang wajib saya ambil untuk menyempurnakan pengajian saya dan bila masa yang sesuai untuk saya selesaikan kursus tersebut?**\n\nA:  Secara dasarnya, ada dua kursus yang diwajibkan sebagai syarat penganugerahan iaitu Kursus Kaedah Penyelidikan dan Kursus Umum Universiti. Pelajar perlu menyelesaikan kedua-dua kursus tersebut sebelum Penilaian peringkat pertama iaitu sebelum semester dua (2) bagi pelajar Sarjana Falsafah dan sebelum semester tiga  \n(3) bagi pelajar Doktor Falsafah.\n\nBagi pelajar antarabangsa dikehendaki mengambil Kursus Kaedah Penyelidikan dan Kursus Umum Universiti (kursus Bahasa Melayu atau Kursus Kebudayaan Malaysia).\n\nBagi pelajar tempatan dikehendaki mengambil Kursus Kaedah Penyelidikan dan salah satu Kursus Umum Universiti selain Kursus Kebudayaan Malaysia yang ditawarkan oleh mana-mana fakulti atau bahagian akademik Universiti.\n\n_**Q:  I am a Phd student, what course do I have to take to complete my studies and when is the suitable time for me to complete the course?**_\n\n_A:  Basically, there are two courses that are part of the graduation requirements, namely the Research Methodology Course and the University General Course. Students need to complete both courses before the first stage of Assessment which is before semester two (2) for Master of Philosophy students and before semester three (3) for Doctor of Philosophy students._\n\n_International students are required to take a Research Methodology course and University General Course (Malay Language or Malaysian Culture course)._\n\n_For local students are required to take Research Methodology course and one of the University General Course other than Malaysian Culture offered by any faculty or academic division of the University._\n\n##### Soalan 5 / Question 5\n\n**Q: Saya merupakan pelajar Phd dan dahulu merupakan pelajar Sarjana di UTM. Adakah saya perlu mengambil semula Kursus Kaedah Penyelidikan dan Kursus Umum Universiti?**\n\nA: Pemindahan kredit untuk Kursus Kaedah penyelidikan dan Kursus Umum Universiti bagi program pasca siswazah boleh dilaksanakan secara pindah kredit daripada program Sarjana Penyelidikan UTM sahaja yang mempunyai hasil pembelajaran kursus yang sama bagi tujuan bergraduat. Perpindahan kredit kursus hanya dibenarkan bagi kursus yang diambil dalam tempoh 3 tahun dari tarikh bergraduat.\n\n_**Q: I am a Ph.D. student and previously was a Master’s student at UTM. Do I need to retake Research Methodology Course and University General Course?**_\n\n_A:  The credit transfer for the Research Methodology Course and University General Course for postgraduate programs can be implemented by transferring credits from Master of UTM’s research program only, which has the same learning outcomes for graduation purposes. Course for credit transfers are only allowed for the courses taken within the previous 3 years from graduation._\n\n##### Soalan 6 / Question 6\n\n**Q:  Dimanakah saya boleh mendapatkan informasi mengenai jadual pendaftaran kursus untuk setiap semester?**\n\nA:  Pelajar boleh merujuk jadual pendaftaran kursus semester yang terkini di laman web AMD [https://amd.utm.my/work-schedule/](https://amd.utm.my/work-schedule/)\n.\n\n**_Q:  Where can I get information on the course registration schedule for each semester?_**\n\n_A:  Students can refer to the latest semester course registration schedule on the AMD website [https://amd.utm.my/work-schedule/](https://amd.utm.my/work-schedule/)\n._\n\n##### Soalan 7 / Question 7\n\n**Q:  Bagaimanakah pendaftaran kursus dilakukan?**\n\nA:  Pendaftaran kursus dilakukan secara atas talian. Sila layari [http://my.utm.my](http://my.utm.my/)\n untuk melakukan pendaftaran kursus.\n\n_**Q:  How do I register for my course?**_\n\n_A:_  Course registration is done online. Please visit [http://my.utm.my](http://my.utm.my/)\n to register for the course.\n\n##### Soalan 8 / Question 8\n\n**Q:  Saya telah melayari portal my.utm.my, walau bagaimanapun saya tidak berjaya membuat pendaftaran kursus.**\n\nA:  Untuk membolehkan pelajar membuat pendaftaran kursus, yuran hendaklah dibayar penuh terlebih dahulu dan pelajar tidak mempunyai hutang yang tertunggak. Mohon rujuk FAQ Seksyen Kewangan Pelajar, Jabatan Bendahari untuk keterangan lanjut.\n\n_**Q:  I have browsed my.utm.my portal, however I could not register for the course.**_\n\n_A:  To enable students to do the course registration, fees must be fully paid and students do not have outstanding debts. Please refer to Students Financial Section, Office of the Bursar’s FAQ for further details._\n\n##### Soalan 9 / Question 9\n\n**Q:  Saya baru sahaja mendaftar sebagai pelajar Phd, dan ingin melantik Penyelia Bersama. Bagaimanakah saya boleh melakukannya?**\n\nA:  Pelajar boleh memohon pelantikan atau pertukaran Penyelia/Penyelia Bersama kepada Sekolah Pengajian Siswazah (SPS) menggunakan Borang Permohonan/Pertukaran Penyelia Utama/Bersama UTM.SPS.B(BPKA)/13/2018 – PIND 1/2020 yang boleh diperolehi daripada laman web SPS (https://sps.utm.my/academic-related-resources/).\n\n_**Q:  I have just registered as a PhD student, and would like to appoint Co-Supervisor. How can I do that?**_\n\n_A:  Students can apply for appointment or change of supervisor to School of Graduate Studies (SPS) by using the Application Form / Change of Principal Supervisor / Joint UTM.SPS.B (BPKA) / 13/2018 – PIND 1/2020 which can be obtained from the SPS website (https://sps.utm.my/academic-related-resources/)._\n\n##### Soalan 10 / Question 10\n\n**Q:**  Bilakah tarikh akhir menghantar tesis bagi pelajar Doktor Falsafah dan Sarjana Falsafah yang berada pada semester maksimum pengajian (semester 16/16 bagi pengajian Doktor Falsafah dan 8/8 bagi Sarjana Falsafah) dan berstatus ‘Peperiksaan – V’ pada semester 2 20192020? Adakah saya perlu mendaftar kursus penyelidikan dan membayar yuran bagi semester 1 20202021?\n\nA:  Pelajar Doktor Falsafah dan Sarjana Falsafah yang berada pada semester maksimum dan pelajar yang berstatus ‘Peperiksaan-V’ pada Semester 2, Sesi 2019/2020 akan diberikan penangguhan secara automatik berikutan pandemik COVID-19. Dengan penambahan satu (1) semester khas ini, pelajar perlu menghantar tesis dan pembetulan tesis pada tarikh akhir menghantar tesis yang ditetapkan pada kalender akademik Semester I, Sesi 2020/2021 (https://amd.utm.my/files/2020/09/web-FINAL-WORK-SCHEDULE-SEM-I-2020- 2021-FOR-RESEARCH-Rujukan-Pelajar.pdf). Anda perlu mendaftar kursus penyelidikan tetapi tiada yuran pengajian akan dikenakan bagi semester 1, sesi 2020/2021.\n\n**_Q:  When is the last date of thesis submission for Doctor of Philosophy and Master of Philosophy who are in the maximum semester and students with ‘Examination- V’ status in semester 2 20192020? Do I have to register for my research course and will there be a fees imposed to me for semester 1 20202021?_**\n\n_A:  Doctor of Philosophy and Master of Philosophy students who are in the maximum semester and students with ‘Examination -V’ status in Semester II, Session 2019/2020 were given automatic deferment due to the COVID-19 pandemic. With this additional one (1) semester, students will need to submit their thesis on the last date of thesis submission as stated in the Semester I, Session 2020/2021 academic calendar (https://amd.utm.my/files/2020/09/web-FINAL-WORK-SCHEDULE-SEM-I- 2020-2021-FOR-RESEARCH-Rujukan-Pelajar.pdf). Students need to register for the research course, but no tuition fee will be charged for the additional semester._\n\n##### Soalan 11 / Question 11\n\n**Q: Adakah saya dibenarkan untuk menangguh pengajian disebabkan kesulitan dihadapi akibat pandemik COVID19? Adakah penangguhan ini dikira?**\n\nA:  Ya, anda dibenarkan untuk menangguh pengajian sekiranya mengalami kesulitan disebabkan pandemik COVID19. Sila lengkapkan borang penangguhan pengajian (https://amd.utm.my/pg-forms/) dan kemukakan bukti yang lengkap kepada pihak fakulti untuk kelulusan. Penangguhan disebabkan bencana alam tidak dikira dalam tempoh pengajian.\n\n_**Q:  Am I allowed to defer my study because of difficulties due to COVID19 pandemic? Is this deferment counted in my study period?**_\n\n_A:  Yes, you may defer your study if you faced difficulties due to COVID19 pandemic. Please complete the deferment form (https://amd.utm.my/pg-forms/) and present required evidence to your faculty for approval. Deferment because of natural disaster is not counted in the study period._\n\n##### Soalan 12 / Question 12\n\n**Q:  Di manakah saya boleh mendapatkan maklumat tentang segala peraturan, prosedur dan syarat pengijazahan yang boleh dirujuk sepanjang pengajian saya?**\n\nA:  Sila layari laman web SPS di (https://sps.utm.my/policy-guidelines-v2/) untuk maklumat berkenaan Peraturan Akademik Pasca siswazah dan Kod Amalan Pascasiswazah- 10 sebagai rujukan sepanjang tempoh pengajian.\n\n_**Q:  Where can I get the information on rules, procedures and graduation related to my studies?**_\n\n _A:  Please visit the SPS website at ([https://sps.utm.my/policy-guidelines-v2/](https://sps.utm.my/policy-guidelines-v2/)\n) for information on Postgraduate Academic Rules and Postgraduate Code of Practice-10 for reference throughout the study period._\n\n### **PENAJAAN / SPONSORSHIP**\n\n##### Soalan 13 / Question 13\n\n**Q:  Adakah biasiswa UTM Zamalah/UTM National Postgraduate Fund (NPF)/International Doctoral Fellowship (IDF) masih ditawarkan pada semester 1 20202021?**\n\nA:  Ya, biasiswa UTM Zamalah/UTM National Postgraduate Fund (NPF)/International Doctoral Fellowship (IDF) masih ditawarkan pada semester 1 20202021.\n\n_**Q:  Will the UTM Zamalah/UTM National Postgraduate Fund (NPF)/International Doctoral Fellowship (IDF) scholarships be offered in semester 1 20202021?**_\n\n _A:  Yes, the UTM Zamalah/UTM National Postgraduate Fund (NPF)/International Doctoral Fellowship (IDF) scholarships will be offered in semester 1 20202021._\n\n##### Soalan 14 / Question 14\n\n**Q:  Bolehkan saya memohon biasiswa ini walaupun tidak berada di kampus disebabkan sekatan/kesuran pergerakan disebabkan pandemic Covid19 ini?**\n\nA:  Ya, anda masih boleh memohon biasiswa ini walaupun tidak berada di kampus.\n\n_**Q:  Can I still apply for the scholarships if I am not on campus due to a movement control order due to Covid19?**_\n\n_A:  Yes, you can still apply for the scholarship even if you are not on campus._\n\n##### Soalan 15 / Question 15\n\n**Q:  Bilakah saya boleh memohon UTM Zamalah/UTM National Postgraduate Fund (NPF)/International Doctoral Fellowship (IDF) pada semester 2020/2021-1?**\n\nA:  Penawaran permohonan UTM Zamalah/NPF/IDF pada semester 2020/2021-1 akan dimaklumkan di dalam laman web dan media sosial SPS. Sila layari Facebook ([https://www.facebook.com/utmsps](https://www.facebook.com/utmsps \"https://www.facebook.com/utmsps\")\n[)](http://www.facebook.com/utmsps))\n dan Instagram SPS (@utmsps) untuk mendapatkan maklumat yang terkini.\n\nPermohonan boleh dilakukan di portal MyUTM (https://my.utm.my/) dengan menggunakan ID dan kata laluan yang diberikan semasa pendaftaran.\n\n**_Q:  When can I apply for UTM Zamalah/UTM National Postgraduate Fund (NPF)/International Doctoral Fellowship (IDF) for this semester 2020/2021-1?_**\n\nA:  The application for UTM Zamalah/NPF/IDF for semester 2020/2021-1 will be informed on the SPS website and social media. Please visit SPS Facebook ([https://www.facebook.com/utmsps](https://www.facebook.com/utmsps \"https://www.facebook.com/utmsps\")\n[)](http://www.facebook.com/utmsps))\n and Instagram (@utmsps) to get the latest information.\n\nApplication can be done via MyUTM portal (https://my.utm.my/) using the ID and password given during the registration.\n\n##### Soalan 16 / Question 16\n\n**Q:**  **Bilakah keputusan UTM Zamalah / NPF / IDF semester 2020/2021-1 akan diumumkan?**\n\nA: Permohonan yang diterima akan diproses oleh pihak SPS dan akan dibawa ke Mesyuarat Jawatankuasa Biasiswazah yang akan ditetapkan. Keputusan akan dimaklumkan dalam tempoh dua (2) bulan dari tarikh tutup permohonan ke email rasmi UTM pelajar, MyUTM dan laman web/media sosial SPS.\n\n_**Q: When will the results of UTM Zamalah/NPF/IDF for semester 2020/2021-1 will be announced?**_\n\n_A: Applications received will be processed by the SPS and will be taken to the next Scholarship Committee Meeting. The results will be announced within two (2) months from the closing date of the application to students’ official UTM address, MyUTM and SPS website/social media._\n\n##### Soalan 17 / Question 17\n\n**Q:  Sekiranya saya bekerja sambil belajar, adakah saya layak memohon UTM Zamalah/NPF/IDF?**\n\nA:  Tidak. UTM Zamalah/NPF/IDF hanya ditawarkan kepada pelajar yang tidak bekerja dan tidak menerima apa-apa penajaan lain.\n\n_**Q:  If I am working while studying, am I eligible to apply for UTM Zamalah/NPF/IDF?**_\n\n_A:  No. UTM Zamalah/NPF/IDF is only offered to students who are not currently working and receiving any other type of sponsorship._\n\n##### Soalan 18 / Question 18\n\n**Q:  Apakah syarat-syarat yang diperlukan untuk memohon UTM Zamalah/NPF/IDF?**\n\nA:  Pelajar boleh merujuk syarat-syarat permohonan UTM Zamalah/NPF/IDF di bahagian Penajaan pada laman web SPS (https://sps.utm.my/scholarship/). \n\n_**Q:  What are the requirements needed to apply for UTM Zamalah/NPF/IDF?**_ \n\n_A:  Students may refer to the requirements of UTM Zamalah/NPF/IDF recipients as stated in the Scholarship section on the SPS website (https://sps.utm.my/scholarship/)._\n\n##### Soalan 19 / Question 19\n\n**Q: Berapakah jumlah penajaan yang ditawarkan?**\n\nA:  Jumlah biasiswa yang ditawarkan adalah seperti berikut: \n\n1.  UTM Zamalah  \n    Yuran pengajian selama enam (6) semester;  \n    Elaun bulanan RM1,500.00 selama 36 bulan\n2.  NPF  \n    Pengecualian yuran pengajian sebanyak RM1,000.00\n3.  IDF  \n    Pengecualian yuran pengajian sebanyak RM2,000.00\n\n_**Q:**  **How much is the total amount of sponsorship that will be offered?**_\n\n_The amount of sponsorship offered is as follows:_\n\n1.  _UTM Zamalah_  \n    _Tuition fees for six (6) semesters;_  \n    _Monthly allowance of RM1,500.00 for 36 months_\n2.  _NPF_  \n    _Tuition fee exemption of RM1,000.00_\n3.  _IDF_  \n    _Tuition fee exemption of RM2,000.00_\n\n##### Soalan 20 / Question 20\n\n**Q:  Adakah jumlah penajaan ini termasuk dengan bayaran yuran peperiksaan lisan?**\n\nA:  Tidak. Yuran peperiksaan lisan perlu diselesaikan oleh pelajar sendiri.\n\n_**Q:  Does the sponsorship covers the oral examination fee?**_\n\n_A:  No. The oral examination fee needs to be paid by the students._\n\n##### Soalan 21 / Question 21\n\n**Q:  Saya telah ditawarkan NPF/IDF pada semester ini. Saya berhasrat untuk membuat penangguhan pengajian bagi semester ini. Bagaimana dengan penawaran NPF/IDF yang telah diterima?**\n\nA:  Setiap penawaran NPF/IDF hanya akan diberikan kepada pelajar yang berstatus ‘Aktif’ pada semester semasa (2020/2021-1). Sekiranya pelajar memohon penangguhan pada semester semasa (dan telah diluluskan), secara automatik tawaran tersebut akan terbatal.\n\n_**Q:  I have been offered to receive NPF/IDF for this semester. However, I intend to defer my studies this semester. What about the offer that has been accepted?**_\n\n _A:  NPF/IDF offer will only be given to students with ‘Active’ status in the current semester (2020/2021-1). If the student applies for deferment in this semester (and has been approved), automatically the offer will become void/canceled._\n\n##### Soalan 22 / Question 22\n\n**Q:  Bolehkah saya memohon pelanjutan penajaan UTM Zamalah sekiranya saya masih belum menamatkan pengajian apabila tempoh penajaan saya telah tamat?**\n\nA:  Tidak. Penajaan UTM Zamalah hanya akan ditawarkan sepanjang pelajar berada di dalam tempoh semester lazim sahaja.\n\n_**Q:  Can I apply for the extension of UTM Zamalah sponsorship if I have not yet graduated when my sponsorship period ended?**_\n\n_A:  No. UTM Zamalah will only be offered to students during the normal semester duration._\n\n##### Soalan 23 / Question 23\n\n**Q:  Apakah yang akan berlaku sekiranya saya menarik diri/menangguh pengajian ketika menerima penajaan UTM Zamalah?**\n\nA:  Sekiranya pelajar menarik diri/menangguh pengajian dalam tempoh penajaan, pihak SPS akan menamatkan serta merta penajaan Zamalah. Pelajar perlu membayar semula mengikut jumlah tajaan yang telah diterima.\n\n_**Q:  What will happen if I withdraw/postpone my studies while receiving UTM Zamalah?**_\n\n _A:  If a student withdraws/postpones the study during the sponsorship period, SPS will immediately terminate the UTM Zamalah sponsorship. The student needs to repay according to the amount of sponsorship that has been received._\n\n### **AKTIVITI PELAJAR / _STUDENT ACTIVITIES_**\n\n##### Soalan 24 / Question 24\n\n**Q: Saya telah menyertai aktiviti-aktiviti di peringkat UTM, di manakah saya boleh merujuk senarai aktiviti yang telah saya hadiri?** \n\nA: Pelajar boleh merujuk senarai aktiviti yang telah disertai dari laman portal pelajar di my.utm.my\n\n**_Q: I have participated in activities at the UTM level, where can I refer to the list of activities I have attended?_**\n\n _A: Students can refer the list of participated activities from student’s portal at my.utm.my_\n\n##### Soalan 25 / Question 25\n\n**Q:  Bagaimana pula jika saya telah menyertai aktiviti yang dijalankan di luar UTM, adakah saya akan mendapat merit dari portal my.utm.my?**\n\n A:  Ya, program anjuran luar UTM boleh didaftarkan di my.utm.my. Caranya adalah dengan log masuk ke my.utm.my. Pergi ke _my profile_, tambah aktiviti dan muatnaik dokumen sokongan yang diperlukan. Permohonan tersebut akan diproses oleh HEP dan ianya akan terpapar dalam senarai program yang telah disertai selepas diluluskan.\n\n_**Q:  What if I participate in activities outside UTM, will I get a merit from my.utm.my portal?**_\n\n_A:  Yes, programs organized outside UTM can be registered at my.utm.my. Just log in to my.utm.my. Go to ‘my profile’, ‘add activities’ and upload the required supporting documents. The application will be processed by HEP and it will be displayed in the list of programs that have been participated after approval._\n\n##### Soalan 26 / Question 26\n\n**Q:  Bagaimana saya boleh mendapat informasi berkenaan program-program   sokongan pelajar pascasiswazah?**\n\nA:  Saudara boleh layari laman web: https://sps.utm.my/pgss/pg-structured-course/ dan ‘Like’ Facebook [https:/www.facebook.com/PGSSUTM/](https://www.facebook.com/PGSSUTM/)\n. Semua penganjuran aktiviti sokongan pelajar pascasiswazah akan dikemaskini dan dimuatnaik ke laman tersebut.\n\n_**Q:  How can I get information on postgraduate student support programs?**_\n\n _A:  You can visit website: https://sps.utm.my/pgss/pg-structured-course/ and ‘Like’ the Facebook of PGSSUTM at [https://www.facebook.com/PGSSUTM/](https://www.facebook.com/PGSSUTM/)\n. All postgraduate student support activities will be updated and uploaded on the site._\n\n##### Soalan 27 / Question 27\n\n**Q:  Bagaimana saya boleh mendapatkan bahan berkaitan program sokongan pelajar seperti video dan lain-lain?**\n\nA:  Video berkaitan program sokongan pelajar di bawah penganjuran PGSS dan SPS boleh didapati daripada saluran Youtube UTM Postgraduate Support Program [_https://www.youtube.com/c/UTMPostgraduateSupportProgram_](https://www.youtube.com/c/UTMPostgraduateSupportProgram)\n\n_**Q:  How can I get materials related to student support programs such as videos and others?**_\n\n_A:  Videos related to student support programs organized by PGSS and SPS are available at the UTM Postgraduate Support Program Youtube Channel [https://www.youtube.com/c/UTMPostgraduateSupportProgram](https://www.youtube.com/c/UTMPostgraduateSupportProgram)\n_\n\n##### Soalan 28 / Question 28\n\n**_Q:_  Adakah pelajar pascasiswazah UTM terlibat dengan sebarang persatuan?**\n\nA:  Ya, terdapat beberapa persatuan yang boleh disertai oleh pelajar pascasiswazah antaranya _Post Graduate Student Society_ (PGSS). Sebagai seorang pelajar pascasiswazah, anda secara automatik merupakan ahli persatuan PGSS. Maklumat lanjut berkaitan PGSS boleh didapati di https://sps.utm.my/pgss/\n\n_**Q:  Are UTM postgraduate students involved with any societies?**_\n\n _A:  Yes, there are several societies that can be joined by postgraduate students including Post Graduate Student Society (PGSS). As a postgraduate student, you are automatically a member of the PGSS. Further details can be found at https://sps.utm.my/pgss/_\n\n### **PROGRAM PESISIR / _OFFSHORE PROGRAM_**\n\n##### Soalan 29 / Question 29\n\n**Q:  Bagaimanakah pelaksanaan kelas untuk semester 1 20202021?**\n\nA:  Semua proses pembelajaran dan pengajaran bagi program Pesisir untuk semester 1 20202021 akan dijalankan secara dalam talian. Pelajar tidak perlu hadir ke kampus/pusat pembelajaran kerana kelas akan dijalankan secara dalam talian sepenuhnya untuk semester I Sesi 2020/2021.\n\n_**Q:  How will my class be conducted in semester 1 20202021?**_\n\n_A:  All teaching and learning will be conducted online for offshore program. Students do not have to attend campus because learning and teaching will be done entirely online for Semester I 2020/2021 session._\n\n##### Soalan 30 / Question 30\n\n**Q:  Bagaimana sekiranya saya tiada kemudahan internet di kediaman saya atau capaian yang tidak sesuai untuk melaksanakan pembelajaran dan pengajaran atas talian?**\n\nA:  Anda dinasihatkan untuk merujuk penyelaras dan pensyarah yang terlibat untuk membantu dengan kaedah pengajaran yang bersesuaian dengan keperluan anda.\n\n_**Q:  What if I do not have internet access at home, or inaccessible to online learning and teaching?**_\n\n_A:_  _You are advised to consult your program coordinator and the respective lecturers to assist you with the suitable teaching method that suits your needs._\n\n##### Soalan 31 / Question 31\n\n**Q:  Bagaimana pula dengan kaedah pelaksanaan bagi peperiksaan akhir?**\n\nA:  Setiap kursus mempunyai kaedah penilaian atau peperiksaan akhir yang berbeza- beza. Anda akan dimaklumkan oleh pensyarah-pensyarah yang berkaitan dengan kursus tersebut.\n\n_**Q:  How will the final exam be conducted?**_\n\n _A:  Each course may adopt different assessment methods or final exams. You will be informed by the respective course lecturers._\n\n##### Soalan 32 / Question 32\n\n**Q:  Bolehkan saya menangguh pengajian saya?**\n\nA:  Berdasarkan Peraturan Akademik Pasca Siswazah UTM, Perkara 21, seseorang pelajar dibenarkan untuk menangguh pengajian samada atas sebab peribadi atau bencana alam. Pelajar dibenarkan menangguhkan pengajian semester I Sesi 2020/2021 ini tanpa dikira semester tersebut atas isu pendamik Covid-19. Saudara perlu mengemukakan permohonan rasmi kepada fakulti dengan mengisi Borang Penangguhan Pengajian: UTM/AMD/01 Edisi 2 yang boleh dimuat turun di _https://amd.utm.my/pg-forms/_\n\n_**Q:  May I defer my studies?**_\n\n_A:  Based on the UTM Postgraduate Academic Rules, Article 21, a student is allowed to defer his studies either for personal reasons or natural disasters. Students are allowed to defer studies in semester I of this Session 2020/2021 and not counted due to the Pandemic Covid-19 issue. Student’s need to submit an official application to the faculty by filling in the Deferment of Study Form: UTM / AMD / 01 Edition 2 which can be downloaded at https://amd.utm.my/pg-forms/_\n\n##### Soalan 33 / Question 33\n\n**Q:  Saya perlu menggunakan lab/studio untuk projek bagi kursus tertentu. Bolehkan saya hadir ke kampus dan bagaimanakah kaedahnya?**\n\nA:  Boleh. Anda boleh hadir ke kampus untuk menggunakan lab/studio bagi tujuan menjalankan projek kursus anda. Anda dinasihatkan untuk berhubung dengan penyelaras program anda dan laman web UTM _(_[_https://www.utm.my/category/covid-19/_](https://www.utm.my/category/covid-19/)\n_)_ untuk mendapatkan makluman semasa.\n\n_**Q:  Am I allowed to use laboratory/studio facilities for my project? How do I apply to use this facility?**_\n\n_**A:**  Yes. You are allowed to use the laboratory/studio facilities for your project. You are advised to consult your program coordinator and read the information related to return to campus procedure available on the UTM’s Covid19 site ([https://www.utm.my/category/covid-19/](https://www.utm.my/category/covid-19/)\n) to get current update._\n\n### **PROGRAM TERBUKA DAN JARAK JAUH / _OPEN AND DISTANCE LEARNING (ODL) PROGRAM_**\n\n##### Soalan 34 / Question 34\n\n**Q:  Adakah FSSH menawarkan program secara terbuka dan jarak jauh (ODL) untuk pasca siswazah?**\n\nA:  Ya, FSSH ada menawarkan program secara terbuka dan jarak jauh (ODL) untuk Ijazah Sarjana secara Kerja Kursus. Sila layari laman sesawang [https://odl.utm.my/](https://odl.utm.my/)\n for further info.\n\n_**Q:  Does FSSH offer open and long distance (ODL) programs for postgraduates?**_\n\n_A:  Yes, FSSH offers Open and Distance (ODL) Programs for a Master’s Degree by Coursework. Please visit the website [https://odl.utm.my/](https://odl.utm.my/)\n info._\n\n##### Soalan 35 / Question 35\n\n**Q:  Adakah FSSH membenarkan permohonan kemasukan melalui APEL**\n\nA:  Permohonan kemasukan melalui APEL perlu mengikut keperluan yang dinyatakan dalam laman sesawang [https://apel.utm.my/kemasukan-master/.](https://apel.utm.my/kemasukan-master/)\n\n_Q:  **Does FSSH allow admission applications via APEL**_\n\n_A:  Application for admission through APEL must follow the requirements stated in the website [https://apel.utm.my/kemasukan-master.](https://apel.utm.my/kemasukan-master)\n_"
}