{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/utm-researchers-win-multiple-awards-in-korea#)\n    \n*   [Instagram](https://builtsurvey.utm.my/utm-researchers-win-multiple-awards-in-korea#)\n    \n*   [RSS](https://builtsurvey.utm.my/utm-researchers-win-multiple-awards-in-korea#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/utm-researchers-win-multiple-awards-in-korea#)\n    \n*   [Instagram](https://builtsurvey.utm.my/utm-researchers-win-multiple-awards-in-korea#)\n    \n*   [RSS](https://builtsurvey.utm.my/utm-researchers-win-multiple-awards-in-korea#)\n    \n\nUTM researchers win multiple awards in Korea\n============================================\n\nby [webmaster FAB](https://builtsurvey.utm.my/author/norazreen/ \"Posts by webmaster FAB\")\n | Dec 26, 2016 | [Award](https://builtsurvey.utm.my/category/award/)\n, [In The Press](https://builtsurvey.utm.my/category/in-the-press/)\n, [News](https://builtsurvey.utm.my/category/news/)\n\n[![](https://builtsurvey.utm.my/wp-content/uploads/2017/05/zaimi-551x311.jpg)](http://news.utm.my/2016/12/utm-researchers-won-multiple-awards-in-korea/)\n\nProf Dr Muhd Zaimi (left) won gold medal, Prof Dr Mahmood Md. Tahir silver, and Dr. Mohammadamin Azimi gold\n\nJOHOR BAHRU, 19 December 2016 – Universiti Teknologi Malaysia (UTM) researchers have won multiple awards in three invention festivals in Seoul, Korea, early this month.\n\nSIIF2016 (Seoul International Invention Fair 2016) is an International level competition which in year 2016, 639 inventions from 31 countries were participated. UTM researchers manage to win 3 medals (Prof Dr Muhd Zaimi (FKA) won gold medal, Prof Dr Mahmood Md. Tahir (FKA) silver, and Dr. Mohammadamin Azimi (FAB) gold) in this competition.\n\nSIIF, KIAF, WIAF and WSA serve as the best platform for rewarding inventors, researchers, scientists, doctors, technical authors, teachers, professors and all other professionals in diverse occupations from around the world who deal and work with invention, innovation, creativity and new technology.\n\nThe winner with most awards was the Dean of School of Post Graduate Studies (SPS) Prof. Dr. Zaidatun Tasir, who won four awards: the Korean Inventor Award in Education Top Merit & Innovative Inventor Grand Award and Korean Inventor Award in Invention Academic Top Merit & \n\nGold Peacock Grand Award at KIAF 2016, and World Inventor Award in Education Development Top Merit & Alfred Nobel Grand Award at WIAF 2016. Following her footsteps were Research Officer Rozita Abdul Jalil and Senior Lecturer from Faculty of Civil Engineering Dr Ali Keyvanfar which received two awards respectively.\n\nRozita received the Korean Inventor Award in Education Top Merit & Innovative Inventor Grand Award at KIAF 2016 and World Inventor Award in Education Development Top Merit & Alfred Nobel Grand Award at WIAF 2016, meanwhile Dr Ali Keyvanfar received the World Inventor Award in Environmental Design Top Merit & Innovative Inventor Grand Award at WIAF 2016 and World Material Science Award & Visiting Professor appointment to Korea Invention Academy KIA WSA 2016.\n\nOther UTM recipients were the Dean of the Institute for Smart Infrastructure and Innovative construction (ISIIC) Prof. Dr. Muhd. Zaimi Abd. Majid, who was awarded the World Inventor Award in Construction Top Merit & Gold Peacock Grand Award and Senior Lecturer from the Faculty of Civil Engineering Arezou Shafgaht, who received the World Inventor Award in Environmental Design Top Merit & Innovative Inventor Grand Award at WIAF 2016.\n\nProf. Dr. Mohd Warid Hussin from the Faculty of Civil Engineering and Assoc. Prof. Dr. Hasanuddin Lamit of the Faculty of Built Environment received the World Scientist Award & Visiting Professor appointment to Korea Invention Academy KIA at SWA 2016.\n\nFour members of Institute for Smart Infrastructure and Innovative Construction (ISIIC) of Universiti Teknologi Malaysia (UTM) were well awarded at the World Scientist Award (WSA) 2016 which held at Seoul, South Korea.\n\nProf. Dr. Muhd Warid Hussin, Assoc. Prof. Dr. Hasanuddin Lamit, Dr. Ali Kayvanfar and Dr. Arezou Shafaghat are members of ISIIC.\n\nDr Abdul Halim Abdullah and Dr Mahani Mokhtar, Senior Lecturers of Faculty of Education received the Korean Inventor Award in Education Top Merit & Gold Peacock Grand Award at KIAF 2016.\n\nThe event organised by Korea Invention News (KINEWS) and Korea Invention Academy (KIA) sets its goal towards discovering those who deserve to be recognized for their excellent career with successful highlights, achievements, contributions made in their region and global society.\n\nWIAF is recognized by several organisations including the International Federation of Inventors Associations (IFIA), Asia Invention Association (AIA) and International Intellectual Property Network Forum (IIPNF).\n\nThe award recognizes outstanding performance and achievement by classified researchers who have passion in creating novel inventions and innovations based on top order of merit in division categories which contribute to the global community.\n\nMore than 50 researchers and scientists from different countries worldwide attending this award included Malaysian researchers representing among others, Universiti Sains Malaysia (USM), Universiti Putra Malaysia (UPM) and Universiti Malaysia Terengganu (UMT).\n\nSource: _[UTM researchers win multiple awards in Korea](http://news.utm.my/2016/12/utm-researchers-won-multiple-awards-in-korea/)\n_"
}