{
  "markdown": "![](https://brand.utm.my/wp-content/uploads/sites/21/2017/01/Logo-I-Am-UTM.jpg)\n\n##### The Concept\n\nThe I AM UTM brand is one meant to awaken the sense of ultimate pride in our Alma Mater, Universiti Teknologi Malaysia. It focuses on the definition of a university as being not just brick and stone, but the very people in it. The brand does not just focus on the researchers/lecturers, but will also include postgraduate, undergraduate students, and staff. This way, everyone in UTM is invited to feel they have an equal stake in the university, and belong to it. People outside UTM will be able to relate to the people in UTM, where young potential students can see UTM students of similar age being showcased, and mature students, and potential staff/researchers see where they could be, and who they could be if they become part of UTM.\n\nThe brand logo  \n[![](https://brand.utm.my/wp-content/uploads/sites/21/2017/01/Logo-I-Am-UTM.jpg)](https://chancellery.utm.my/wp-content/uploads/sites/21/2017/01/Logo-I-Am-UTM.jpg)\n  \nThe brand utilises the I AM UTM logo (see below) to brand any activities, achievements, or people, who bring pride to the university. It can be applied to any appropriate media – digital, print, and clothing.  \nThe logo utilises two typefaces, the first being a font traditionally used for logos, especially in schools with a strong sports tradition. The latter half utilises the Baskerville font used in the UTM logo to retain the association to the UTM brand. The colours that are utilised in the logo are the UTM colours of Maroon and sand.\n\n##### General Guidelines\n\nAny materials that use the I AM UTM logo must follow the guidelines below:\n\n– Vetted for proper language and appropriacy  \n– High quality image  \n– Must answer the questions “Does he/she look proud of his/her contribution to UTM” and “Does this make me proud?”\n\n##### UTM War-Cry\n\nThe phrase I AM UTM has also been chosen to be the war-cry or rallying cry for all team building and competitive events. This is to be implemented at all levels, from student to staff.\n\nCampaign tagline\n----------------\n\n**UTM is not just brick and stone.**  \n**UTM is you.**\n\n**UTM is me.**\n\n**I AM UTM**"
}