{
  "markdown": "First Year Electrical Engineering Students Visit V. S. Electronics Sdn. Bhd.\n============================================================================\n\nby [website](https://fke.utm.my/author/website/ \"Posts by website\")\n | Nov 25, 2019 | [POWER](https://fke.utm.my/category/power/)\n\n![](https://fke.utm.my/wp-content/uploads/2020/02/power5-scaled-1-980x588.jpg)\n\nOn 21 November 2019, the School of Electrical Engineering (SKE), Faculty of Engineering, Universiti Teknologi Malaysia (UTM), organised an industrial visit for students undertaking the course “Introduction to Electrical Engineering”. The visit was conducted at V. S. Electronics Sdn. Bhd., Senai, Johor. The main objectives of the visit were to allow the students to gain exposure on electrical/electronic industries and be aware of the responsibilities of electrical/electronic engineers. The visit was necessary for the students to fulfill part of the requirements for completing the course “Introduction to Electrical Engineering”, where at the end of the course, the students were expected to be able to analyse the responsibilities of engineers to the society, explain the importance of sustainable solutions, be accountable on assigned tasks in an ethical manner, and manage a project. The visit to V. S. Electronics was fruitful for the students where the students had the chance to tour around the factory to understand various electrical/electronic assembly processes involving surface-mount technology. UTM SKE wishes to thank V. S. Electronics, especially Mr. Michael Loke, for his relentless effort in arranging the visit. UTM SKE also wishes to thank the factory’s staff for their warm welcome during the visit.\n\n<img class=”alignnone wp-image-11394″ src=”http://ee.utm.my/wp-content/uploads/2019/11/VSE-Visit-1-1024×614.jpg” alt=”” width=”526″ height=”315″ />\n\nRepresentative from V. S. Electronics receiving a token of appreciation.\n\n<img class=”alignnone wp-image-11395″ src=”http://ee.utm.my/wp-content/uploads/2019/11/VSE-Visit-2-1024×614.jpg” alt=”” width=”527″ height=”316″ />\n\nGroup photo.\n\n<img class=”alignnone wp-image-11396″ src=”http://ee.utm.my/wp-content/uploads/2019/11/VSE-Visit-3.jpg” alt=”” width=”528″ height=”317″ />\n\nGroup photo.\n\n&nbsp;\n\nBy Ir. Dr. Lau Kwan Yiew, Universiti Teknologi Malaysia\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/first-year-electrical-engineering-students-visit-v-s-electronics-sdn-bhd#)"
}