{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/majlis-perasmian-kumpulan-penyelidikan-rg-baharu-yang-dikenali-sebagai-urban-design-and-environmental-ude#)\n    \n*   [Instagram](https://builtsurvey.utm.my/majlis-perasmian-kumpulan-penyelidikan-rg-baharu-yang-dikenali-sebagai-urban-design-and-environmental-ude#)\n    \n*   [RSS](https://builtsurvey.utm.my/majlis-perasmian-kumpulan-penyelidikan-rg-baharu-yang-dikenali-sebagai-urban-design-and-environmental-ude#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/majlis-perasmian-kumpulan-penyelidikan-rg-baharu-yang-dikenali-sebagai-urban-design-and-environmental-ude#)\n    \n*   [Instagram](https://builtsurvey.utm.my/majlis-perasmian-kumpulan-penyelidikan-rg-baharu-yang-dikenali-sebagai-urban-design-and-environmental-ude#)\n    \n*   [RSS](https://builtsurvey.utm.my/majlis-perasmian-kumpulan-penyelidikan-rg-baharu-yang-dikenali-sebagai-urban-design-and-environmental-ude#)\n    \n\nMajlis Perasmian Kumpulan Penyelidikan (RG) baharu yang dikenali sebagai Urban Design and Environmental (UDE)\n=============================================================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Sep 21, 2020 | [event](https://builtsurvey.utm.my/category/event/)\n, [News](https://builtsurvey.utm.my/category/news/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2020/09/119676231_3639184419460271_3467979543080910567_o-1080x675.jpg)\n\n21 September 2020 – Satu majlis perasmian ringkas kumpulan penyelidikan (RG) baharu Fakulti Alam Bina dan Ukur (FABU) yang dikenali sebagai Research Group of Urban Design and Environmental (UDE) telah diadakan di Pejabat Dekan FABU. Majlis tersebut disempurnakan oleh Y.Brs. Prof. Sr. Dr. Hishamuddin Bin Mohd. Ali, Dekan FABU. Dikesempatan tersebut, Y.Brs. Dekan turut meluangkan masa mendengar taklimat hala tuju RG UDE yang akan memenuhi salah satu bidang tumpuan (niche area) ahli akademik dan penyelidik di FABU iaitu kajian berasaskan Sains Petempatan Manusia (Ekistics).\n\nY.Brs. Dekan turut berkongsi hasrat fakulti serta universiti berkaitan potensi sumbangan RG UDE yang akan diterokai. Pelbagai bentuk aktiviti, program dan kerjasama berkaitan penyelidikan dan perundingan dengan rakan strategik lain termasuk agensi kerajaan, industri, NGO dan Pihak Berkuasa Tempatan dijangka akan mula dilaksanakan selepas penganjuran bengkel strategi di Bandaraya Melaka pada 24 hingga 26 September 2020 akan datang. Bengkel Strategi Research Group of Urban Design and Environmental (UDE) 2020-2025 tersebut akan merangka pelaksanaan perancangan RG untuk tempoh 5 tahun akan datang.\n\nRG UDE yang telah diluluskan penubuhannya secara rasmi oleh Pejabat Timbalan Naib Canselor (Penyelidikan dan Inovasi) UTM pada 8 Julai 2020 melalui Mesyuarat Jawatankuasa Tetap Senat (Penyelidikan dan Inovasi) UTM ini akan menawarkan kepakaran penyelidikan, perundingan dan pernerbitan berkaitan reka bentuk bandar (urban design), warisan bandar (urban heritage), landskap perbandaran (urban landskap) dan sains alam sekitar (environmental science) sebagai sebahagian usaha mewujudkan petempatan dan habitat manusia yang lebih mampan, berkualiti serta berdaya huni.\n\nPenerokaan bidang tersebut merupakan sebahagian komitmen FABU untuk membantu merealisasikan hasrat negara dalam melaksanakan Matlamat Pembangunan Mampan (SDGs) dan Agenda Perbandaran Baharu (New Urban Agenda). Dalam SDG ke-11, Malaysia komited untuk menjadikan bandar dan petempatan dalam negara menjadi lebih inklusif, selamat, berdaya tahan dan mampan. Selain itu, RG ini turut komited untuk menyumbang kepakaran bagi memenuhi komponen SDG ke-6, 14 dan 15 khususnya berkaitan kualiti alam sekitar.\n\nKeahlian tetap RG UDE terdiri daripada para pensyarah kanan FABU iatu, Dr. Noor Aimran Bin Samsudin (Perancangan Bandar dan Wilayah) selaku Ketua RG, Dr. Lee Yoke Lai, LAr. Dr. Siti Rahmah Binti Omar, Dr. Muhamad Solehin Fitry Rosley (Senibina Landskap) dan Dr. Mohamad Fadhli Rashid (Perancangan Bandar dan Wilayah). Ia turut dianggotai oleh beberapa ahli bersekutu yang terdiri daripada pakar pelbagai bidang merangkumi senibina, pengurusan hartanah, kejuruteraan awam dan pengurusan bencana dari UTM."
}