{
  "markdown": "Bachelor of Civil Engineering With Honours\n------------------------------------------\n\n**Programme Specifications**\n============================\n\n#### The Bachelor of Civil Engineering With Honours program is awarded by Universiti Teknologi Malaysia. Instruction is conducted in both Bahasa Melayu and English through conventional teaching methods. The program operates independently by the university and is full-time, with a duration ranging from a minimum of 4 years to a maximum of 6 years. It is accredited by the Board of Engineers Malaysia.\n\n**Entry Requirements**\n======================\n\n#### Minimum entry requirements to be considered for a course at the Faculty of Civil Engineering, Universiti Teknologi Malaysia (UTM), you must fulfil the minimum entry requirements.\n\n### [1\\. Malaysia student](https://admission.utm.my/entry-requirements-ug-malaysian/)\n\n### [2\\. International student](https://admission.utm.my/entry-requirements-ug-international/)\n  \n\n**Career Prospect**\n===================\n\n#### Civil engineering has solid career prospects because it’s essential for designing, building, and maintaining infrastructure like roads, bridges, buildings, and water systems. As populations grow and cities expand, the need for skilled civil engineers increases. The field offers various specializations, such as structural, transportation, and environmental engineering, allowing for diverse career paths. Additionally, with the global push for sustainable development, civil engineers are also in demand for projects that focus on renewable energy, eco-friendly buildings, and climate resilience. Overall, it’s a stable and rewarding field with good job security and growth potential.\n\n**Further Information**\n-----------------------\n\n##### For further information regarding this matter, please feel free to contact :\n\n![](https://civil.utm.my/wp-content/uploads/2024/10/Dr.Radzuan-2.png \"Dr.Radzuan 2\")\n\n**Sr. Ts. Dr. Radzuan bin Sa’ari**  \n_Academic Manager(Undergraduate)_  \nEmail : radzuans@utm.my  \nContact No. : 07-5531744\n\n![](<Base64-Image-Removed>)\n\n**Assoc. Prof. Ir. Ts. Dr.**  \n**Mohamad Hidayat bin Jamal**  \n_Deputy Dean (Academic & Students Affair)_  \nEmail: mhidayat@utm.my  \nContact No. : 07-5532536\n\n*   [Programme Specification](https://civil.utm.my/programme-3#)\n    \n*   [Programme Educational Objective](https://civil.utm.my/programme-3#)\n    \n*   [Programme Learning Objective](https://civil.utm.my/programme-3#)\n    \n*   [Classification of Courses](https://civil.utm.my/programme-3#)\n    \n*   [Entry Requirement](https://civil.utm.my/programme-3#)\n    \n*   [Career Opportunities](https://civil.utm.my/programme-3#)\n    \n\n|     |     |     |\n| --- | --- | --- |\n| 1\\. Programme Name | Bachelor of Civil Engineering With Honours |     |\n| 2.Final Award | Bachelor of Civil Engineering With Honours |     |\n| 3.Awarding Institution | Universiti Teknologi Malaysia |     |\n| 4.Teaching Institution | Universiti Teknologi Malaysia |     |\n| 5.Professional or Statutory Body of Accreditation | Board of Engineers Malaysia |     |\n| 6.Language(s) of Instruction | Bahasa Melayu and English |     |\n| 7.Mode of Study (Conventional,distance Learning,etc) | Conventional |     |\n| 8.Mode of Operation (Franchise,self-govern,etc) | Self-govern |     |\n| 9\\. Study Scheme | Full Time |     |\n| 10.Study Duration | Minimum   :  4 years<br><br>Maximum  :  6 years |     |\n| Type of  Semester<br><br>Normal<br><br>Short | No of Semesters<br><br>8<br><br>1 | No of Weeks/Semester<br><br>14<br><br>8 |\n\n|     |     |\n| --- | --- |\n| **PEO** | **PROGRAMME EDUCATIONAL OBJECTIVES DESCRIPTION** |\n| **PEO 1** | Competent, innovative and entrepreneurial in acquiring and applying knowledge towards solving Civil Engineering problems. |\n| **PEO 2** | Process leadership qualities, able to work, manage in diverse team and serve the society in multi-disciplinary environment. |\n| **PEO 3** | Demonstrate professionalism and uphold ethical values with emphasis on sustainable environment. |\n| **PEO 4** | Communicate effectively, possess strong self-confidence and recognize the need for life- long learning. |\n\n|     |     |\n| --- | --- |\n| **PLO** | **Intended Educational Objectives** |\n| **PLO 1** | Apply knowledge or mathematics, natural science, engineering fundamental and an engineering specialization as specified in WK1 to WK4 respectively to the solution of complex engineering problems. |\n| **PLO 2** | Identify, formulate, conduct research literature and analyze complex engineering problems reaching substantiated conclusion using first principles of mathematics, natural sciences and engineering sciences (WK1 to WK4). |\n| **PLO 3** | Design solutions for complex engineering problems and design systems, components or processes that meet specified need with appropriate consideration for public health and safety, cultural, societal and environmental considerations (WK5) |\n| **PLO 4** | Conduct investigation of complex engineering problems using research – based knowledge (WK8) and research methods including design of experiments, analysis and interpretation of data and synthesis of information to provide valid conclusions. |\n| **PLO 5** | Create, select and apply appropriate techniques, resources and modern engineering and IT tools, including prediction and modelling to complex engineering problems with an understanding of the limitations (WK6). |\n| **PLO 6** | Apply reasoning informed by contextual knowledge to assess societal, health, safety, legal and cultural issues, and the consequent responsibilities relevant to professional engineering  practice and solutions to complex engineering problems (WK7). |\n| **PLO 7** | Understand and evaluate the sustainability and impact of professional engineering work in the solutions of complex engineering problems in societal and environmental context (WK7). |\n| **PLO 8** | Apply ethical principles and commit to professional ethics and responsibilities and norms of engineering practice (WK7). |\n| **PLO 9** | Function effectively as an individual, as and member of leader in diverse teams and in multi – disciplinary setting. |\n| **PLO 10** | Communicate effectively on complex engineering activities with the engineering community and with society at large, such as being able to comprehend and write effective reports and design documentation , make effective presentations, and give and receive clear instructions. |\n| **PLO 11** | Demonstrate knowledge and understanding of engineering management principles and economic decision making and apply these to one’s own work, as a member and leader in team, to manage project in multidisciplinary environments. |\n| **PLO 12** | Recognize the need, and have the preparation and ability to engage independent and life – long learning in broadest context of technological change. |\n\n4\n\n|     |     |     |     |\n| --- | --- | --- | --- |\n| **NO.** | **CLASSIFICATION** | **CREDIT HOURS** | **PERCENTAGE** |\n| **i.** | **University Courses**<br><br>a.  General<br><br>b.  Service (Mathematic)<br><br>c.  Language<br><br>d. Entrepreneurship<br><br>e.  Co-Curriculum<br><br>f.    Open Elective | 6<br><br>15<br><br>6<br><br>2<br><br>2<br><br>3 | 26.2% |\n| **ii.** | **Faculty/Programme Core** | 92  | 67.2% |\n| **iii.** | **Programme** **Electives** | 9   | 6.6% |\n|     | **Total** | **135** | **100%** |\n| **For engineering programmes please complete the following classification.**<br><br>**(Others please refer to the Statutory Body guidelines)** |     |     |     |\n| **A** | **Engineering Courses**<br><br>(a)  Lecture/Project/Laboratory<br><br>(b) Workshop/Field/Design Studio<br><br>(c)  Industrial Training<br><br>(d) Final Year Project | 85<br><br>5<br><br>5<br><br>6 | 73.7% |\n| **Total Credit Hours for Part A** |     | **101** |     |\n| **B** | **Related Courses**<br><br>(a)  Applied Science/Mathematic/Computer<br><br>(b) Management/Law/Humanities/Ethics/Economy<br><br>(c)  Language<br><br>(d) Co-Curriculum<br><br>(e)  Open Elective | 15<br><br>8<br><br>6<br><br>2<br><br>3 | 26.3% |\n| **Total Credit Hours for Part B** |     | **34** |\n| **Total Credit Hours for Part A and B** |     | **135** | **100%** |\n| **Total Credit Hours to Graduate** |     | **135 credit hours** |     |\n\nMinimum entry requirements to be considered for a course at the Faculty of Civil Engineering, Universiti Teknologi Malaysia (UTM), you must fulfil the minimum entry requirements.\n\n1.  Malaysia student ([https://admission.utm.my/entry-requirements-ug-malaysian/](https://admission.utm.my/entry-requirements-ug-malaysian/)\n    )\n2.  International student ([https://admission.utm.my/entry-requirements-ug-international/](https://admission.utm.my/entry-requirements-ug-international/)\n    )\n\nCareer as a civil engineer spans across a multitude of disciplines compared to other engineering fields. The services and expertise of a civil engineer are required when constructing amenities for the well-being of mankind as well as the preservation and rehabilitation of the environment. Amongst the major duties of a civil engineer include studying, planning, analysing, designing, constructing and maintaining infrastructure systems and buildings. Infrastructure systems can be defined to include roads and highways, airports, ports, bridges, traffic management, water supply, water treatment and sewerage, water resources management such as irrigation, drainage and the construction of dams. Meanwhile, building constructions encompass housing projects, skyscrapers and mega-buildings, off-shore structures and other systems utilised by mankind. Civil engineers are needed in virtually all public sectors that are involved with construction projects and maintenance of the aforementioned systems. As for the private sector, career opportunities for a civil engineer are aplenty. Civil engineering and project management firms, architects and contractors are among the many examples where the services of civil engineers are needed.\n\nMany civil engineering graduates from UTM manage to secure positions in their final semester of studies. The record shows that, 90% of UTM’s civil engineering graduates are offered jobs within six months after the completion of their studies while the rest, within a year.\n\nIn the future, a civil engineer would have a bright prospect in tandem with the nation’s rapid development. In 2007, the construction industry provided more than 800,000 job opportunities in civil engineering. In order to achieve the nation’s aspirations in becoming a developed country, more civil engineers are needed to spearhead the nation’s construction industry.\n\n##### Programme Information\n\n[Course Menu](https://civil.utm.my/v2/undergraduate/wp-content/uploads/sites/19/2024/02/Course-Menu.pdf)\n  \n[Course Synopsis](https://civil.utm.my/v2/undergraduate/wp-content/uploads/sites/19/2024/02/Course-Synopsis_Core-Elective-PRISM-1.pdf)\n  \n[Graduation Checklist](https://civil.utm.my/v2/undergraduate/wp-content/uploads/sites/19/2024/02/Graduation-Checklist.pdf)\n\n##### Award Requirement\n\nTo graduate, students must:\n\n*   Attain a total of not less than 135 credit hours with a minimum CGPA of 2.00.\n*   Has passed all specified courses.\n*   Has applied for graduation and has been approved by the University.\n*   Has completed all five (5) Professional Skills Certification (PSC) courses in UTM.\n*   Other conditions as specified.\n\n##### Tuition Fees\n\n• [For Malaysian Students](https://admission.utm.my/programme-fees-ug-malaysian/?_gl=1*18uejyb*_ga*MzAwNjcwOTIwLjE2ODcxMzMyMzM.*_ga_N3HJW8G3P7*MTcyMTExMTU4Mi42LjAuMTcyMTExMTU4Ny41NS4wLjA.)\n  \n• [For International Students](https://admission.utm.my/programme-fees-ug-international/?_gl=1*1iu7ujd*_ga*MzAwNjcwOTIwLjE2ODcxMzMyMzM.*_ga_N3HJW8G3P7*MTcyMTExMTU4Mi42LjAuMTcyMTExMTU4Ny41NS4wLjA.)"
}