{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/webinar-on-culture-society-identity-between-sasi-creative-school-of-architecture-india-utm-architecture-program-universitas-tanjungpura-indonesia#)\n    \n*   [Instagram](https://builtsurvey.utm.my/webinar-on-culture-society-identity-between-sasi-creative-school-of-architecture-india-utm-architecture-program-universitas-tanjungpura-indonesia#)\n    \n*   [RSS](https://builtsurvey.utm.my/webinar-on-culture-society-identity-between-sasi-creative-school-of-architecture-india-utm-architecture-program-universitas-tanjungpura-indonesia#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/webinar-on-culture-society-identity-between-sasi-creative-school-of-architecture-india-utm-architecture-program-universitas-tanjungpura-indonesia#)\n    \n*   [Instagram](https://builtsurvey.utm.my/webinar-on-culture-society-identity-between-sasi-creative-school-of-architecture-india-utm-architecture-program-universitas-tanjungpura-indonesia#)\n    \n*   [RSS](https://builtsurvey.utm.my/webinar-on-culture-society-identity-between-sasi-creative-school-of-architecture-india-utm-architecture-program-universitas-tanjungpura-indonesia#)\n    \n\nWebinar on Culture, Society & Identity between SASI Creative School of Architecture, India, UTM Architecture Program, Universitas TanjungPura, Indonesia\n========================================================================================================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Nov 29, 2021 | [Conference & Seminar](https://builtsurvey.utm.my/category/conference-seminar/)\n, [News](https://builtsurvey.utm.my/category/news/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2021/11/unnamed.png)\n\n**By AP Dr Alice Sabrina Ismail (Director Architecture Program)**\n\nThe Architecture Program, Faculty of Built Environment and Surveying (FABU), Universiti Teknologi Malaysia (UTM), conducted an International Webinar on Culture, Society and Identity between Universitas Tanjung Pura, Kalimantan Barat, Indonesia, SASI Creative School of Architecture, Coimbatore, India and the UTM Architecture Program on the 15th of November 2021 using the online platform. This event was attended by 246 participants from 3 countries and five architecture schools from Indonesia, India and Malaysia, and was moderated by Dr Iziq Eafifi Ismail from UTM.  Three speakers presented a wide range of topics under the indicated theme, discussing the built environment’s future in each country and lessons learnt from past culture to be adopted in the contemporary context.  The first speaker, Assistant Professor Nivedhita, K.R from SASI Creative School of Architecture, India, provides an insight into the traditional cultural expression in Tamil Naidu’s context and its adaptation in modern buildings. Associate Professor Dr Alice Sabrina Ismail from UTM deliberate on the influence of political authority in determining the formation of national identity in the Malaysian context, whilst Assistant Professor Affrilyno ST, Msc highlighted the design approaches of public urban space in West Kalimantan, Indonesia, for collaborative development. In paralel with the UTM Online Global Classroom program, this international webinar provides an intellectual discourse and conversation to understand the built environment from diverse cultures better. This will help support the sustained improvement of online course design and facilitation while benefitting students and their learning. Understanding how culture manifests itself from a different built environment can indirectly help shape a positive educational experience for students and academicians. This event that lasted for four hours also allowed the UTM architecture program to reach out to a more extensive network of students and academicians from India and Indonesia Architecture school instead of being restricted by geographical boundaries within Malaysia. The UTM Architecture program hoped that broader discourse on the built environment considers areas such as an [interdisciplinary](https://en.wikipedia.org/wiki/Interdisciplinary)\n field that addresses the design, construction, and management can be conducted in the future for the benefit of all involved institutions."
}