{
  "markdown": "SWTS Pte. Ltd. Singapore is Hiring\n==================================\n\nby [powerpic](https://fke.utm.my/author/powerpic/ \"Posts by powerpic\")\n | Mar 9, 2023 | [Anouncement](https://fke.utm.my/category/anouncement/)\n, [Faculty](https://fke.utm.my/category/faculty/)\n, [POWER](https://fke.utm.my/category/power/)\n, [Uncategorized](https://fke.utm.my/category/uncategorized/)\n\n![](https://fke.utm.my/wp-content/uploads/2023/03/SWTS1-1010x675.jpg)\n\n**SWTS Pte. Ltd. Singapore is Hiring**\n\n**Position:**  \nField Service Engineer  \nEngineering Services and Solutions Division\n\n**Job Description:**  \nAs a Field Service Engineer, you will be responsible for installation, commissioning, maintenance, troubleshooting and servicing of power system equipment such as HT/LT switchboards, protection relays, and power transformers. He/She may also be required to attend the work related to AC/DC drives, UPS, battery chargers, and other ad-hoc duties when assigned.\n\n**Main Responsibilities:**  \n• Participate on-site service job as part of the service team or independently, working at local or remote locations.  \n• Produce field service report and test reports for customers after completion of the job.  \n• Maintenance and housekeeping work on test equipment when assigned.  \n• Be punctual to attend site work.  \n• Complete the assigned job scope on time where necessary.\n\n**Requirement:**  \n• Degree or a Diploma in Electrical or Electronic Engineering/ relevant Engineering discipline, or with years of relevant working experience.  \n• Effective communication skills.  \n• Able to attend oversea work when required.  \n• Able to work well both as part of a team and on your own.  \n• Eagerness to learn and work with a positive attitude.  \n• Ability to carry out hands-on work and documentation in a timely manner.  \n• Possessing a Class 3 Manual Singapore driving license will be an advantage.\n\n**Benefits:**  \n• Working hours: Monday – Friday, 8:15am – 5:30pm  \n• Location: Jurong,  \n• Monthly salary & Compensation for Overtime, Allowances (Handphone, oversea etc.) + AWS +Variable Bonus (Subject to company’s performance)  \n• Medical and Group hospitalization and Surgical Insurance  \n• Pick-up transport at designated location  \n• Opportunities for training and development\n\nInterested candidates are invited to send in their detailed resume to soyeong.yap@swts.com. You can visit SWTS’s website at http://www.swts.com. Only shortlisted candidates will be notified.\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/swts-pte-ltd-singapore-is-hiring#)"
}