{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/program-anak-angkat-isi-fabu-utm-berjaya-mencetus-komuniti-berdaya#)\n    \n*   [Instagram](https://builtsurvey.utm.my/program-anak-angkat-isi-fabu-utm-berjaya-mencetus-komuniti-berdaya#)\n    \n*   [RSS](https://builtsurvey.utm.my/program-anak-angkat-isi-fabu-utm-berjaya-mencetus-komuniti-berdaya#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/program-anak-angkat-isi-fabu-utm-berjaya-mencetus-komuniti-berdaya#)\n    \n*   [Instagram](https://builtsurvey.utm.my/program-anak-angkat-isi-fabu-utm-berjaya-mencetus-komuniti-berdaya#)\n    \n*   [RSS](https://builtsurvey.utm.my/program-anak-angkat-isi-fabu-utm-berjaya-mencetus-komuniti-berdaya#)\n    \n\nProgram Anak Angkat Isi & FABU UTM Berjaya Mencetus Komuniti Berdaya\n====================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Apr 2, 2019 | [CSR](https://builtsurvey.utm.my/category/csr/)\n, [News](https://builtsurvey.utm.my/category/news/)\n, [photo](https://builtsurvey.utm.my/category/photo/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2019/04/1-1080x675.jpg)\n\nProgram Pemindahan Teknologi, Pengetahuan dan Anak Angkat Pangsapuri 560 Bandar Bukit Puchong 2019 usaha bersama Institut Sultan Iskandar (ISI), Fakulti Alam Bina dan Ukur (FABU), serta Pusat Kursus Umum dan KoKurikulum (CCSL), yang berlangsung 28 hingga 31 Mac 2019 telah berjaya menjadi pencetus komuniti berdaya; sekali gus membantu pencapaian matlamat Program Rejuvenasi Pangsapuri Bukit Puchong wawasan dari Universiti Teknologi Malaysia (UTM) dan Majlis Perbandaran Subang Jaya (MPSJ).\n\nKemeriahan program pada kali ini yang berlangsung sempena cuti sekolah selama 4 hari 3 malam bermula Khamis lalu membuktikan bahawa pihak komuniti ini amat mengalu-alukan kehadiran 60 orang mahasiswa UTM sebagai anak angkat kepada 21 keluarga. Program Anak Angkat yang sokong oleh Pusat Khidmat DUN Seri Serdang ini berjaya memanafaatkan 560 isi rumah dari aktiviti khidmat komuniti yang merupakan sebahagian daripada usaha transformasi masyarakat berpendapatan rendah di sana.\n\nProf. Madya Dr. Gurupiah Mursib, Ketua Projek Rejuvenasi Pangsapuri 560 Bandar Bukit Puchong dari Institut Sultan Iskandar Kuala Lumpur yang ditemui semasa Majlis Penutup dan Penyampaian Hadiah berkata, Program Anak Angkat yang kedua diadakan ini, terbukti sebagai satu kaedah yang sangat berkesan untuk memperkasa segenap lapisan komuniti menerusi pelbagai pengisian yang dipindahkan oleh pelajar-pelajar UTM sendiri. Kini komuniti Bukit Puchong dapat memanfaatkan segala ilmu pengetahuan dan kemahiran yang telah dikongsikan. Beliau berharap agar komuniti Bukit Puchong ini terus bersatu padu dan berdaya maju dalam memastikan kejayaan dan kelangsungan program ini demi membina kejiranan yang lebih baik.\n\nSebanyak 28 aktiviti dan 11 bengkel dijalankan selama 4 hari berkenaan melibatkan setiap tujuh blok kejiranan. Kesemua aktiviti dan bengkel tersebut dikawal selia oleh Ts. Dr. Syamsul Hendra Mahmud, selaku Pensyarah FABU dan Penyelia Kursus bagi pelajar UTM yang terlibat. Beliau berkata, faedah program ini adalah bersifat dua hala, yang mana bukan sahaja penduduk setempat memperoleh ilmu pengetahuan, malahan para pelajar dapat meningkatkan kemahiran generik mereka selain mendapat peluang untuk melibatkan diri secara aktif sebagai ahli jawatankuasa program. Persediaan program ini memakan masa hampir dua bulan bagi memastikan aktiviti-aktiviti yang dirancangkan adalah meliputi 8 teras utama seperti dinyatakan di dalam Dasar Komuniti Negara 2019 yang dilancarkan oleh Y.Bhg. Tun Dr. Mahathir Mohamad, Perdana Menteri Malaysia pada 17 Februari lalu. Teras utama yang dimaksudkan ialah infrastruktur dan penyelenggaraan; kebersihan, alam sekitar dan kesihatan; keselamatan; pendidikan dan kemahiran; keprihatinan terhadap kanak-kanak, warga emas, Orang Kurang Upaya (OKU), wanita, ibu tunggal dan daif; keusahawanan dan perniagaan sosial; perkhidmatan sosial; serta sukan dan rekreasi.\n\nProgram Rejuvenasi Pangsapuri 560 Bandar Bukit Puchong mendapat pengiktirafan tarafan impak lima bintang oleh Pusat Jaringan Komuniti dan Industri (CCIN) UTM; serta menjadi rujukan pembangunan perumahan kos rendah lain di MPSJ; juga rujukan kepada Program Bangsa Johor Bahagia di bawah naungan DYMM Raja Zarith Sofiah, Permaisuri Johor.\n\n**[more photos (click here)](https://builtsurvey.utm.my/photos/2019/04/program-anak-angkat-isi-fabu-utm-berjaya-mencetus-komuniti-berdaya/)\n  \n**"
}