{
  "markdown": "ATT Research Group and FAVOURIOT Established Collaboration in IoT Researches\n============================================================================\n\nby [commpic](https://fke.utm.my/author/commpic/ \"Posts by commpic\")\n | May 18, 2017 | [COMM](https://fke.utm.my/category/comm/)\n\n11th May 2017 – Advanced Telecommunication Technology (ATT) research group has yet achieved another milestone in its pursuit of excellence in Internet of Things (IoT) technology with the collaboration between the group and FAVORIOT as its industrial partner. FAVOURIOT is the latest IoT startup in Malaysia with extensive experience in ICT and IoT that is well positioned to become a world’s leading IOT company. The attractive technology developed and offered by this company has garnered interest from ATT group to choose FAVORIOT as its IoT platform. To date, ATT has identified three projects that will be using FAVORIOT as its middleware platform. The first project is led by Assoc. Prof. Dr. Sharifah Hafizah Syed Ariffin from ATT, entitled _Water Quality Monitoring System Using Wireless Sensor Network Wifi Based for Aquaculture Farming_. The research focuses on developing a monitoring system in aquaculture environment that collects the data and transmits them wirelessly to a remote server via data packet. The IoT platform provided by FAVORIOT will be used to support the integration of data from the sensors into the internet. Consequently, continuous improvement can be made to the system to further expand the application.\n\n![](https://fke.utm.my/wp-content/uploads/sites/9/2017/05/art35-1.jpg)\n\n* * *\n\n**The prototype of Water Quality Monitoring System.**\n\n* * *\n\nAnother smart partnership between FAVORIOT and ATT is championed by Dr. Kamaludin Mohamad Yusof, that aims to solve one of the most problematic issues in cities which is illegal parking. The project is called _Smart Parking with Automated Double Park Detection System_ (ParkKing) with the objective to solve the problem of double parking and helps the driver to locate the nearest available empty parking lot nearby. A smartphone application will be developed to locate the nearest empty parking lot, while magnetic and ultrasonic sensors as well as gateway transceivers will be used to detect a presence of a car either it is in the parking lot or double-parked car. Upon detecting a double-parked car, the ParkKing system will send the data to the FAVORIOT platform and notifies the authority to tow the vehicle away. The integration of the proposed system with the existing smart traffic light system and intelligent parking system is envisioned to bring us a smart management transport system for a smart city.\n\n![](https://fke.utm.my/wp-content/uploads/sites/9/2017/05/art35-2.jpg)\n\n* * *\n\n**Smart Parking with Automated Double Park Detection System (ParkKing).**\n\n* * *\n\nDr Rozeha A. Rashid, together with Dr. Mohd Adib Sarijari lead a team of researchers from ATT to realize the Smart Grid vision through a project called _Home Energy Management System_ (HEMS). Although the initial prototype has been developed on a different server, the team has decided to migrate to a more powerful IoT platform from FAVORIOT. In the proposed system, there are three categories of energy billing for the user to choose according to their affordability. Three modes for HEMS are developed corresponding to the billing’s categories, for example Category A is for monthly billing limit of RM40, Category B is for monthly billing limit of RM70 and Category C is open for customized setting. Every category will have a different way of controlling the appliances to achieve the target power consumption within the set limit of monthly billing. The proposed monitoring and control software solution have been successfully integrated with the test-bed to facilitate demand response by OFF/ON peak hour, home automation and three customized settings for energy billing. It is estimated that the system can promote 10% saving on utility bills and 25% energy saving. In general, the developed FA-HEMS is a likely solution for a greener and sustainable technology which in the long run will benefit the nation and future generation.\n\n![](https://fke.utm.my/wp-content/uploads/sites/9/2017/05/art35-3.jpg)\n\n* * *\n\n**Home Energy Management System (HEMS).**\n\n* * *\n\n[HOME](https://fke.utm.my/comm/)\n\n* * *\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/att-research-group-and-favouriot-established-collaboration-in-iot-researches#)"
}