{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/program-sustainable-environmental-assembly-sutera#)\n    \n*   [Instagram](https://builtsurvey.utm.my/program-sustainable-environmental-assembly-sutera#)\n    \n*   [RSS](https://builtsurvey.utm.my/program-sustainable-environmental-assembly-sutera#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/program-sustainable-environmental-assembly-sutera#)\n    \n*   [Instagram](https://builtsurvey.utm.my/program-sustainable-environmental-assembly-sutera#)\n    \n*   [RSS](https://builtsurvey.utm.my/program-sustainable-environmental-assembly-sutera#)\n    \n\nSociety of Landscape Architecture Organised Sustainable Environmental Assembly (SUTERA) 2020\n============================================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Jan 16, 2020 | [Conference & Seminar](https://builtsurvey.utm.my/category/conference-seminar/)\n, [event](https://builtsurvey.utm.my/category/event/)\n, [News](https://builtsurvey.utm.my/category/news/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2020/01/82024274_2981049241940462_2199334490357104640_o-1080x675.jpg)\n\nThe Sustainable Environmental Assembly (SUTERA) 2020 was successfully organised by the Society of Landscape Architecture (EARTH) from 13th to 15th January 2020. Coordinated by Dr. Norliza Mohd Isa, this program provided an intellectual seminar and activities dedicated to the staff of Pejabat Harta Bina (PHB) UTM, Kuala Lumpur. With the theme of Landscape, Sustainability, and Work Culture Impact, SUTERA 2020 was designed in line with the policy to ensure Universiti Teknologi Malaysia (UTM) acts as a sustainable campus.\n\nThe objectives was to provide exposure and encourage the staff to gain extra input regarding the implementation of campus sustainable activities, to realise UTM’s desire to become a model of a sustainable society according to own ability, and to develop a work culture that is integrated, creative and innovative in achieving outstanding performance in the environmental management, especially in the UTM campus.\n\nBy choosing Classic as the theme, it represents the preservation of high values by past generations to be maintained by the future generations. This concept also refers to the relationship between Art and Science; and human and nature. Therefore, it will provide a starting point for sustainable and quality environmental development.\n\nThere are various activities throughout the program such as a seminar on ‘Campus Sustainability’ presented by Adjunct. Prof. LAr. Zainul Hakim bin Mohd Zain that explained about the early history of UTM construction. Also, a seminar on ‘From Waste to Energy’ presented by LAr. Gs. Dr. Abdul Rahim bin Abdul Hamid explained the residual waste which could be used as a landscape asset from the view of a foreign country like Singapore. Besides that, LAr. Mohd Za’i bin Kandar discussed the professional work culture in the ‘Professional Ethic’ seminar slot.\n\nOn the second day, participants had the opportunity to participate in the Ecological Walk slot, in which they were given a briefing on the UTM environment by Prof. LAr. Dr. Ismail bin Said and LAr. Dr. Hamidah bt. Ahmad. In this slot, participants learned about the process of preparing _Madu Kelulut_ by Kolej Tun Hussein Onn (KTHO). While on the last day, participants joined a sharing session by Assoc. Prof. LAr. Dr. Sapura bt. Mohamad on the topic of Trees: The Living Machine and also from Mr. Mohd. Faizal bin Abd Latib on the topic of Campus Safety and Security.\n\nIn conclusion, the organisation of the SUTERA 2020 program gave benefits to everyone, not only the participants, staff of the PHB UTM KL in general and all persons involved including those who provided inputs throughout the program. The focus of this seminar was an additional effort to foster teamwork spirit through the sustainable development-based activities in line with the university’s commitment to support the Sustainable Development Goals (SDG). Hopefully, the knowledge gained from this program could be applied in their daily lives as well as in the working environment, in line with the UTM desire in making UTM campus a sustainable campus.\n\n![](https://news.utm.my/wp-content/uploads/2020/01/4.png)\n\n**Seminar 1: ‘Campus Sustainability’ by Adjunct Prof. LAr. Zainul Hakim bin Mohd Zain**\n\n![](<Base64-Image-Removed>)\n\n**Seminar 2: ‘Professional Ethic’ by LAr. Mohd. Za’I bin Kandar**\n\n![](<Base64-Image-Removed>)\n\n**Seminar 3: ‘From Waste to Energy’ by LAr. Gs. Dr. Abdul Rahim bin Abdul Hamid**\n\n![](<Base64-Image-Removed>)\n\n**Seminar 4: ‘Ecological Walk’ by Prof. LAr. Dr. Ismail Said**\n\n![](<Base64-Image-Removed>)\n\n**Seminar 4: ‘Ecological Walk’ by LAr. Dr. Hamidah binti Ahmad**\n\n![](<Base64-Image-Removed>)\n\n**Seminar 5: ‘Trees: The Living Machine’ by Assoc. Prof. LAr. Dr. Sapura bt Mohamad**\n\n![](<Base64-Image-Removed>)\n\n**Seminar 6: ‘Campus Safety and Security’ by En. Mohd Faizal bin Abd Latib**\n\n![](<Base64-Image-Removed>)\n\n**Fun Game: Guess Who? Game**\n\n![](<Base64-Image-Removed>)\n\n**Fun Game: Giant Drawing**\n\n![](<Base64-Image-Removed>)\n\n**Fun Game: Balancing the Ball**\n\n![](<Base64-Image-Removed>)\n\n**Fun Game: Balancing the Ball**\n\n[**more photos click here..**](https://www.facebook.com/pg/built.surveyUTM/photos/?tab=album&album_id=2981045855274134&__xts__%5B0%5D=68.ARA6_U9bwpzWDD3NUZVnwrFdVdApE1kheHl1ncX4Z_LoFdiVRnJJNI7KT1x5nKdHG78HrdeR2WMcmXUwKO1sPrmWcQ9sfpve_keul0QoR_zphX0O0iuLNBBkARGk_OQ91oK5AR8a6fw3rNIuQLjDMXPqNLeVJHStwEmEnJ3OFsiHEJUwD_4k8oQZL4k36BVzYVsSFQmSw04fikq5XxYq3lj_6wyZL-f0Mfb7j6JL94AVAERNfbEXMdmn2w3BA0xh9z2LJ7xJMRJdqvMfEjejHPdQdFqvm0rDpvix1SE95CxzMmigyY2UX9zcxgAxc78uYDxCrB_E3zzm13PZKxyaNciT0xmWUDVLp6uEG4rxDchOTT-9gQbGY8E5S7OyIcufJflO8B69VR52dvEykvF7jeYVSUJ-t8euiDvlg2fRqnA0nWdW8ID5KjE_RxSItE1wiJV9MqrLA6fZ5bmS3NP4&__tn__=-UC-R)"
}