{
  "markdown": "Academic Office : +607-5333716 | Email : academic-fcee@utm.my | Administration Office : +607-5533499 [fcee@utm.my](mailto:fcee@utm.my)\n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n**MASTER OF ENGINEERING IN CHEMICAL**  \n \n\n**Benefits:**  \nThis program provides opportunity for candidates to enhance their technical knowledge in advanced chemical engineering fields. This programme is suitable for any bachelor graduate from science, technology, engineering courses and from other discipline with relevant experiences.\n\n*   [Programme Specifications](https://fkt.utm.my/m-eng-chemical-2#)\n    \n*   [Programme Educational Objectives (PEO)](https://fkt.utm.my/m-eng-chemical-2#)\n    \n*   [Programme Learning Outcomes (PLO)](https://fkt.utm.my/m-eng-chemical-2#)\n    \n*   [Program Structure](https://fkt.utm.my/m-eng-chemical-2#)\n    \n*   [Career opportunities](https://fkt.utm.my/m-eng-chemical-2#)\n    \n*   [Entry requirement](https://fkt.utm.my/m-eng-chemical-2#)\n    \n\nThe Master of Engineering (Chemical) is offered on a full-time basis at UTM Main Campus in Johor Bahru. The duration of study is one and a half (1.5) years to a maximum of four (4) years. This program is open for any bachelor graduate from science, technology and engineering courses. Graduates from other discipline but with relevant experiences are also encouraged to apply. Depending on the candidate’s background, pre-requisite courses may be imposed to assist the candidate to comprehend more in-depth advanced courses offered.\n\nThe programme is offered on full-time basis and is based on a 2-Semester per academic session. Generally, students are expected to undertake courses equivalent to between three (3) to fifteen (15) credit hours per semester.  Assessment is based on courseworks, final examinations and dissertation project given throughout the semester.\n\n**PEO1** – Graduate become the expertise in chemical industry decipline and contribute to national development.\n\n**PEO2** – Graduate become creative, innovative and adaptable senior engineer in their organization and society.\n\n**PEO3** – Graduate contribute toward the environmental well-being and sustainable development.)\n\n**PEO4** – Graduate able to conduct research to add value to existing products.\n\nPLO1  Ability to master the knowledge in chemical engineering discipline.\n\nPLO2  Ability to apply research skills in chemical engineering discipline.\n\nPLO3  Ability to analyze problems in chemical engineering field using scientific and critical thinking approaches.\n\nPLO4  Ability to conduct professional ethics in research with minimal supervision and adhere to legal, ethical and professional code of practice.\n\nPLO5  Ability to demonstrate effective communication skills in both written and oral form to report the scientific and technical facts.\n\nPLO6  Ability to acquire knowledge and engage in lifelong learning in chemical engineering field.\n\nPLO8  Ability to work effectively in team with team members and stakeholders.\n\n|     |     |\n| --- | --- |\n| **Mainstream (special programme)** | **Offshore** |\n| 6 max semesters \\| 3 min semesters | 8 max semesters \\| 4 min semesters |\n|     |     |\n| **LIST OF COURSES \\| sem 1** | **LIST OF COURSES \\| sem 1** |\n| Core : Advanced Thermodynamic | Core: Advanced Transport Phenomena |\n| Core: Advanced Transport Phenomena | Core: Numerical Computation in Chemical Engineering |\n| Core: Numerical Computation in Chemical Engineering |     |\n| Core: Advanced Chemical Reaction Engineering |     |\n| **LIST OF COURSES \\| sem 2** | **LIST OF COURSES \\| sem 2** |\n| Elective: Safety and Health in Process Industries\\* | Elective: Safety and Health in Process Industries\\* |\n| General course: Research Methodology | General course: Pengurusan Projek IT\\*\\* |\n| General course: Pengurusan Projek IT\\*\\* |     |\n|     |     |\n| **LIST OF COURSES \\| sem 3** | **LIST OF COURSES \\| sem 3** |\n| Dissertation | Core : Advanced Thermodynamic |\n|     | Core: Advanced Chemical Reaction Engineering |\n|     | **LIST OF COURSES \\| sem 4** |\n|     | General course: Research Methodology |\n| \\* select from list of elective subjects |     |\n| \\*\\* select from list of university general courses | **LIST OF COURSES \\| sem 5** |\n|     | Dissertation |\n\n*   Chemical industry\n*   Institution of higher education\n*   Promotion\n\n*   Candidate must hold a Bachelor Degree in Chemical Engineering with Cumulative Point Average (CPA) of at least 2.75/4.0 or equivalent from Universiti Teknologi Malaysia or any other Institutions of Higher Learning recognized by the Senate. In the case where CPA between 2.74 and 2.50, it is subject to rigorous internal assessment. While for CPA between 2.49 and 2.0, 5 years working experience in the related field is required.\n*   Candidate with other Bachelor of Engineering or Science Degree from Institutions of Higher Learning recognized by the Senate with CPA of 2.75/4.0 may also apply but must pass all courses as listed below:  \n    – Mass balance  \n    – Chemical Reactions Engineering  \n    – Chemical Engineering Thermodynamics  \n    – Numerical Methods  \n    – Transport Processes and Unit Operations\n\nAll prerequisite courses must be registered as HW\\*\n\n\\*HW is a registration status of a course which is stipulated by the faculty and is subjected to normal assessment.\n\n**For further enquiries please contact:**\n\n![](https://fkt.utm.my/wp-content/uploads/2019/04/Dr.-Nor-Alafiza-binti-Yunus.jpg)**Dr. Nor Alafiza Yunus**  \n**Programme Coordinator**  \nOffice: +607-55335486  \nEmail: alafiza@utm.my"
}