{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/program-rejuvinasi-usahasama-isi-utm-dan-mpsj-berjaya-memberdayakan-komuniti-bukit-puchong#)\n    \n*   [Instagram](https://builtsurvey.utm.my/program-rejuvinasi-usahasama-isi-utm-dan-mpsj-berjaya-memberdayakan-komuniti-bukit-puchong#)\n    \n*   [RSS](https://builtsurvey.utm.my/program-rejuvinasi-usahasama-isi-utm-dan-mpsj-berjaya-memberdayakan-komuniti-bukit-puchong#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/program-rejuvinasi-usahasama-isi-utm-dan-mpsj-berjaya-memberdayakan-komuniti-bukit-puchong#)\n    \n*   [Instagram](https://builtsurvey.utm.my/program-rejuvinasi-usahasama-isi-utm-dan-mpsj-berjaya-memberdayakan-komuniti-bukit-puchong#)\n    \n*   [RSS](https://builtsurvey.utm.my/program-rejuvinasi-usahasama-isi-utm-dan-mpsj-berjaya-memberdayakan-komuniti-bukit-puchong#)\n    \n\nPROGRAM REJUVINASI USAHASAMA ISI UTM DAN MPSJ BERJAYA MEMBERDAYAKAN KOMUNITI BUKIT PUCHONG\n==========================================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Feb 18, 2019 | [CSR](https://builtsurvey.utm.my/category/csr/)\n, [event](https://builtsurvey.utm.my/category/event/)\n, [Featured Slider](https://builtsurvey.utm.my/category/featured-slider/)\n, [News](https://builtsurvey.utm.my/category/news/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2019/03/1-1080x675.jpg)\n\n**KSU KPKT Dato’ Sri Haji Mohammad Mentek menyerahkan Sijil Penghargaan kepada YDP MPSJ TPr Noraini Roslan**\n\n**KENYATAAN AKHBAR**\n\n**PUCHONG INDAH,** 17 Februari 2019 – Usaha sama Institut Sultan Iskandar (ISI), UTM dengan Majlis Perbandaran Subang Jaya (MPSJ) dalam Projek Rejuvinasi Pangsapuri Kos Rendah Bandar Bukit Puchong (PBBP) yang dilancarkan pada 30 Jun tahun lalu telah membuahkan hasil apabila Komuniti PBBP berjaya mempamerkan impak rejuvinasi yang di luar jangkaan. Program ini telah mendapat perhatian sebagai satu contoh model pemberdayaan komuniti perumahan kos rendah yang berjaya, demikian reaksi dari pengunjung pameran Rejuvinasi sempena Pelancaran Dasar Komuniti Negara 2019 yang telah disempurnakan oleh YAB Perdana Menteri Malaysia, Tun Dr Mahathir Mohamad di Taman Puchong Indah pada 17 Februari 2019 yang lalu. Antara dif-dif yang hadir dalam majlis tersebut adalah Menteri Kementerian Perumahan dan Kerajaan Tempatan, YB Zuraida Kamaruddin, dan Tun Dr Siti Hasmah Mohamad Ali.\n\nAntara yang dipamerkan adalah poster impak sebelum dan selepas rejuvinasi, produk perabut kayu palet, hasil kebun komuniti, serta komunitinya yang bersemangat tinggi. Dato’ Sri Haji Mohammad Mentek, Ketua Setiausaha Kementerian Perumahan dan Kerajaan Tempatan, diiringi peneraju utama projek rejuvinasi MPSJ, Yang Dipertua  TPr Noraini Roslan dalam kunjungan rasmi ke _booth_ pameran berpuas hati dengan prestasi rejuvinasi. YB KSU menyatakan rasa bangga beliau apabila melihat hasil rejuvinasi serta kreativiti perabut kayu palet yang telah dihasilkan oleh komuniti BP dan mengingatkan seluruh warga komuniti agar turut menggabungkan aspek kerohanian selain daripada aspek sosial dan fizikal yang diterapkan di  dalam aktiviti-aktiviti yang telah direncanakan. YDP Noraini menyatakan inilah satu aspek mampan Program Rejuvinasi yang kini diletakkan sebagai projek rujukan berimpak tinggi untuk diterapkan di perumahan lain oleh MPSJ. Sementara itu ADUN Sri Serdang, YB Dr Siti Mariah Mahmud yang turut membuat kunjungan khas menyatakan kesediaan untuk terus menyokong program ini dengan dana tambahan bagi program khidmat komuniti seterusnya. Beliau telah meletakkan kepercayaan dan harapan yang tinggi kepada seluruh warga pangsapuri  Bandar Bukit Puchong agar terus bersatu dan berdaya maju dalam memastikan kejayaan dan kelangsungan program ini. Pameran juga telah membuka mata kepada beberapa pihak berkuasa tempatan dan Jawatankuasa Penduduk Zon untuk melaksanakan projek sebegini di kawasan masing-masing.\n\n[![](https://builtsurvey.utm.my/wp-content/uploads/2019/03/2.jpg)](https://builtsurvey.utm.my/wp-content/uploads/2019/03/2.jpg)\n\n**Ketua Projek Prof Madya Dr Gurupiah Mursib dan Timbalan Pengerusi Jawatankuasa Penduduk BP Cik Siti Hajar memberi penerangan program Rejuvinasi kepada KSU KPKT Dato’ Sri Haji Mohammad Mentek**\n\n[![](<Base64-Image-Removed>)](https://builtsurvey.utm.my/wp-content/uploads/2019/03/3.jpg)\n\n**Kunjungan khas dari ADUN Sri Serdang, YB Dr Siti Mariah Mahmud**\n\nProf. Madya Dr. Gurupiah Mursib selaku Ketua Projek dari Institut Sultan Iskandar UTM menyatakan strategi projek rintis menaik taraf ruang bawah blok C, program ukhuwah dan gotong-royong, lawatan kajian kes, bengkel pertukangan, laman edibel dan lain-lain  telah berjaya meniupkan semangat perubahan kepada komuniti BP. Program Anak Angkat UTM, kendalian Dr Syamsul Hendra Mahmud dengan kerjasama pelajar program Sarjana Muda Ukur Bahan dan Sarjana Muda Sains (Pembinaan), Fakulti Alam Bina dan Ukur (FABU) UTM juga telah memberi impak besar kepada penyatuan di kalangan komuniti ini ke peringkat akar umbi. Program ini telah didaftarkan dalam tiga projek khidmat masyarakat Pusat Jaringan Komuniti Industri UTM dan satu darinya telah mendapat pengiktirafan taraf 5 bintang.\n\n**Sila hubungi**:  \nProf Madya Dr Gurupiah Mursib (0137520051)  \nKetua Program Rejuvinasi Pangsapuri 560 Bandar Bukit Puchong  \nInstitut Sultan Iskandar  \nBlok J1 UTMKL  \nJalan Sultan Yahya Petra  \n54100 Kuala Lumpur"
}