{
  "markdown": "Kenali Pusat Islam UTM\n======================\n\nPusat Islam Universiti Teknologi Malaysia merupakan sebuah pusat kecemerlangan yang bertanggungjawab meningkatkan kualiti modal insan serta berperanan membuat perancangan dan melaksanakan program dan aktiviti berkaitan keintelektualan Islam, kemasyarakatan dan kebajikan. Segala program yang dijalankan sepanjang masa adalah untuk memberikan manfaat kepada seluruh warga kampus dan masyarakat sekitar.\n\nLokasi Pusat Islam yang berada di tengah-tengah pusat pentadbiran UTM memberikan erti yang begitu mendalam kepada warga kampus termasuk pelajar dan staf. Kedudukan ini adalah amat bertepatan sekali dengan moto UTM ‘**Kerana Tuhan Untuk Manusia**’.\n\nVisi\n----\n\nMenjadi sebuah Pusat Islam dan Masjid Universiti yang unggul menerusi dakwah, pendidikan, dan kebajikan.\n\nMisi\n====\n\nMenjadi peneraju pembangunan insan dan pengurusan hal ehwal Islam secara profesional dengan memaksimumkan penggunaan teknologi untuk kemakmuran dan kesejahteraan sejagat.\n\nSejarah PIUTM\n=============\n\n*   [Sejarah Penubuhan](https://islamiccentre.utm.my/pengenalan#)\n    \n*   [Pentadbiran Masjid Sultan Ismail](https://islamiccentre.utm.my/pengenalan#)\n    \n*   [Penubuhan PIUTM](https://islamiccentre.utm.my/pengenalan#)\n    \n\nRancangan menubuhkan Pusat Perkhidmatan Kemasyarakatan ini adalah bermula dari satu perbincangan antara Naib Canselor dengan tenaga pengajar Jabatan Pendidikan Islam pada 27 Mei 1990. Dalam perbincangan ini Naib Canselor merasakan perlunya ditubuhkan satu pusat/organisasi yang dapat menyelaraskan segala kegiatan berkaitan dengan aktiviti-aktiviti kemasyarakatan yang berpusat di masjid. Setakat ini kegiatan tersebut hanya dikendalikan secara berasingan oleh jabatan, bahagian, fakulti di universiti. Penubuhan pusat ini diharapkan dapat mewujudkan suasana kemasyarakatan yang berteraskan Islam, memperbanyak dan menyelaraskan kegiatan aktiviti keislaman di segenap peringkat jabatan, fakulti dan bahagian-bahagian sama ada dalaman atau umum dan juga mewujudkan organisasi yang teratur dan memudahkan penyelenggaran serta menjadikannya lebih berkesan. Hasrat murni ini akhirnya berjaya menubuhkan Pusat Perkhidmatan Kemasyarakatan UTM yang ditempatkan di Masjid Sultan Ismail UTM. Pusat ini seterusnya dikenali sebagai Pusat Pengajian Islam dan Pembangunan Sosial (PPIPS) yang menguruskan hal ehwal akademik dan pembangunan sosial masyarakat serta pengurusan Masjid Sultan Ismail UTM. Berkuatkuasa pada 12 November 2001 pihak Universiti memutuskan bahawa pentadbiran Masjid Sultan Ismail UTM diasingkan daripada pentadbiran Pusat Pengajian Islam dan Pembangunan Sosial (PPIPS) (Kasiran, 2001).\n\nMasjid Sultan Ismail UTM diberikan tanggungjawab yang lebih luas di antaranya ialah sebagai pusat perkembangan Islam dengan melaksanakan aktiviti atau program keilmuan yang boleh menggerakkan pembangunan dan kemajuan ummah, menjadi pusat rujukan dengan memberi khidmat kepakaran dan khidmat nasihat yang berkaitan dengan Agama Islam, dan menjadi pemangkin kepada usaha-usaha perpaduan di kalangan umat Islam khususnya perpaduan di kalangan pelajar, staf dan juga masyarakat luar. Pengurusan Masjid Sultan Ismail dipindahkan di bawah pentadbiran Canselori yang kemudiannya dikenali sebagai Pejabat Naib Canselor. Kemudiannya Masjid Sultan Ismail UTM dinaiktaraf kepada Pusat Islam UTM pada 6 Julai 2009. Selaras dengan perubahan nama pengurusan ini, aktiviti-aktiviti berkaitan Masjid Sultan Ismail dan pembangunan syiar Islam di Universiti Teknologi Malaysia dikendalikan sepenuhnya oleh Pusat Islam. Pusat Islam UTM adalah institusi penting yang mempunyai fungsi yang sangat luas berperanan sebagai pusat kegiatan ibadat, pusat kegiatan dakwah dan ilmu, pusat pentadbiran, pusat kegiatan sosial dan juga berperanan membangunkan modal insan dan memacu ummah amnya serta staf dan mahasiswa UTM khususnya ke tahap kecemerlangan di dunia dan akhirat (Wan Mohd Zawawi, 2009).\n\nAdalah dimaklumkan bahawa pihak Universiti telah memutuskan supaya pentadbiran Masjid Sultan Ismail diasingkan daripada pengurusan Pusat Pengajian Islam dan Pembangunan Sosial (PPIPS) berkuatkuasa mulai 12 November 2001. Melalui pengasingan ini Masjid Sultan Ismail akan ditadbirkan di bawah tanggungjawab Canseleri dan akan diketuai seorang Pengarah.\n\n1.  Masjid Sultan Ismail telah diberi tanggungjawab yang lebih luas di antaranya seperti berikut:\n\n*   Sebagai Pusat Perkembangan Islam dengan melaksanakan aktiviti atau program keilmuaan yang boleh menggerakkan pembangunan dan kemajuan ummah.\n*   Menjadi pusat rujukan dengan memberi khidmat kepakaran dan khidmat nasihat yang berkaitan dengan agama Islam.\n*   Menjadi pemangkin kepada usaha-usaha perpaduan di kalangan umat Islam khususnya perpaduan di kalangan pelajar, staf dan juga masyarakat luar.\n\n2.  Dengan ini diharapkan semua pihak dapat mengimarahkan Masjid Sultan Ismail UTM sebagai pusat keilmuan berlandaskan Islam yang mampu meningkatkan daya intelektual dan kepimpinan ummah.\n3.  Sebagai makluman Pusat Pengajian Islam dan Pembangunan Sosial (PPIPS) akan terus diberi peranan seperti fakulti iaitu untuk melaksanakan aktiviti akademik termasuk perkara-perkara pengajaran dan pembelajaran, mengembangkan ilmu melalui penyelidikan, menerbitkan penerbitan-penerbitan ilmiah dan yang berkaitan.\n\nPekeliling Pentadbiran Bil. 41/2001 pada 8 November 2001\n\nAdalah dimaklumkan bahawa pihak Universiti telah bersetuju dengan Penubuhan Pusat Islam Universiti Teknologi Malaysia (PIUTM) bagi menggantikan pengurusan Masjid Sultan Ismail UTM. Selaras dengan perubahan nama pengurusan ini, aktiviti-aktiviti berkaitan Masjid Sultan Ismail dan pembangunan syiar Islam dikendalikan sepenuhnya oleh PIUTM yang diketuai oleh Pengarah.\n\nOleh itu, mulai tarikh Pekeliling Pentadbiran ini dikeluarkan, semua aktiviti dan fungsi berkaitan dilaksanakan sepenuhnya oleh PIUTM.\n\n Pekeliling Pentadbiran Bil. 35/2009 pada 6 Julai 2009\n\n© 2024 Pusat Islam Universiti Teknologi Malaysia. Hak cipta terpelihara."
}