{
  "markdown": "Industrial Talks Successfully Organised for Students of UTM School of Electrical Engineering\n============================================================================================\n\nby [website](https://fke.utm.my/author/website/ \"Posts by website\")\n | Oct 23, 2019 | [POWER](https://fke.utm.my/category/power/)\n\n![](https://fke.utm.my/wp-content/uploads/2020/02/power3-1080x675.jpg)\n\nOn 17 October 2019, the School of Electrical Engineering (SKE), Faculty of Engineering, Universiti Teknologi Malaysia (UTM), successfully organised industrial talks for its first year undergraduate students, as part of its initiatives to expose its students to attributes of electrical and electronic engineers from both academic and practical points of view. The invited speakers were Mr. Elanggoh Ramachandran, an Automation and Controls Manager from Alcon Johor Sdn. Bhd., and Ms. Shabnam Parween Binti Mohd Salim, an Experienced Technical Engineer from Plus Solar Systems Sdn. Bhd.\n\nDuring the talk, Mr. Elanggoh, who is also an alumni of UTM, shared his experience from the first day he became an engineer. He mainly worked in the field of control and automation engineering, applying his technical knowledge obtained from his first degree and new knowledge gained from time to time. He also emphasised on the importance for an engineer to speak out his views at work so that his role could be appreciated. Furthermore, he talked about the career progression in engineering from both technical and management points of view, and shared how he progressed from a very technical aspect of engineering to a key managerial position at Alcon Johor now. Lastly, he highlighted the importance of Industry 4.0 and how his current company is taking approprtiate actions to move towards Industry 4.0.\n\nMeanwhile, Ms. Shabnam shared her experience on the fundamentals of solar photovoltaic (PV) systems and related the fundamentals to her practical work experience. She discussed about opportunities and challenges in the solar PV industry and how an engineer could adapt to real life working environment. She also emphasised on the importance of project financing, project management and local authority management regarding solar PV regulations to ensure the sustainability of an engineering company in promoting solar PV as green technology to the community. Not forgotten, she also took the opportunity to motivate women to engage more actively in engineering activities and play a key role in the engineering community.\n\nBoth talks, which ran in parallel in Lecture Hall 4 and Lecture Hall 6 of SKE, ended with a question and answer session by the students. SKE UTM wishes to thank Mr. Elanggoh and Ms. Shabnam for their voluntary contribution to the industrial talks. Their experience shared will hopefully motivate UTM students to pursue their studies in line with industrial needs through the understanding of real life job requirements and responsibilities as electrical and electronic engineers.\n\n<img class=”alignnone wp-image-11343″ src=”http://ee.utm.my/wp-content/uploads/2019/10/Industrial-Talk-1a-1024×767.jpg” alt=”” width=”368″ height=”276″ />\n\nMr. Elanggoh delivering his speech\n\n<img class=”alignnone wp-image-11344″ src=”http://ee.utm.my/wp-content/uploads/2019/10/Industrial-Talk-1b-1024×767.jpg” alt=”” width=”366″ height=”274″ />\n\nThe audience\n\n<img class=”alignnone wp-image-11345″ src=”http://ee.utm.my/wp-content/uploads/2019/10/Industrial-Talk-1c.jpg” alt=”” width=”368″ height=”276″ />\n\nMr. Elanggoh (right) receiving a token of appreciation\n\n<img class=”alignnone wp-image-11346″ src=”http://ee.utm.my/wp-content/uploads/2019/10/Industrial-Talk-2a-1024×767.jpg” alt=”” width=”364″ height=”273″ />\n\nMs. Shabnam delivering her speech\n\n<img class=”alignnone wp-image-11347″ src=”http://ee.utm.my/wp-content/uploads/2019/10/Industrial-Talk-2b-1024×767.jpg” alt=”” width=”366″ height=”274″ />\n\nThe audience\n\n<img class=”alignnone wp-image-11348″ src=”http://ee.utm.my/wp-content/uploads/2019/10/Industrial-Talk-2c.jpg” alt=”” width=”360″ height=”270″ />\n\nMs. Shabnam (middle) receiving a token of appreciation\n\n&nbsp;\n\nBy Ir. Dr. Lau Kwan Yiew, Universiti Teknologi Malaysia\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/industrial-talks-successfully-organised-for-students-of-utm-school-of-electrical-engineering#)"
}