{
  "markdown": "Academic Office : +607-5333716 | Email : academic-fcee@utm.my | Administration Office : +607-5533499 [fcee@utm.my](mailto:fcee@utm.my)\n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n###### _Updated : 30 November 2022_\n\n**MASTER OF ENGINEERING IN ENVIRONMENTAL**\n\nThe program is a combination between coursework and a research dissertation project. The core study areas include environmental and sustainability, solid and hazardous waste management, and water pollution control. This field emphasizes the application of technologies for the enhancement of the environment for the good of humankind. The program is designed to develop intellectual, practical, and professional skills in critically acquiring, analyzing, interpreting, and understanding environmental engineering principles and issues. It also provides students with a strong background in the fundamentals of environmental engineering and environmental management and skills to develop solutions to environmental problems, typically involving a complex blend of technical, regulatory, social, and management challenges. The program is suitable for any bachelor’s graduate from science, technology, engineering courses, and other disciplines with relevant experiences. \n\n**Benefits:**  \nThe program provides you with an advanced understanding of environmental engineering, technical knowledge, and generic skills required to enable you to develop a successful career in the progressively globalized engineering marketplace.\n\n*   [Programme Specifications](https://fkt.utm.my/m-eng-environmental-2#)\n    \n*   [Programme Educational Objectives (PEO)](https://fkt.utm.my/m-eng-environmental-2#)\n    \n*   [Programme Learning Outcomes (PLO)](https://fkt.utm.my/m-eng-environmental-2#)\n    \n*   [Program Structure](https://fkt.utm.my/m-eng-environmental-2#)\n    \n*   [Career opportunities](https://fkt.utm.my/m-eng-environmental-2#)\n    \n*   [Entry requirement](https://fkt.utm.my/m-eng-environmental-2#)\n    \n\nThe Master of Environmental Engineering is offered full-time at UTM Main Campus in Johor Bahru. The study duration is one and a half (1.5) years to a maximum of four (4) years. This program is open to any bachelor’s graduate from science, technology and engineering courses. Graduates from other disciplines but with relevant experiences are also encouraged to apply. Depending on the candidate’s background, prerequisite courses may be imposed to assist the candidate in comprehending more in-depth advanced courses offered.\n\nThe program is offered full-time and is based on 2 Semesters per academic session. Generally, students are expected to undertake courses equivalent to between three (3) to fifteen (15) credit hours per semester. Assessment is based on coursework, final examinations, and dissertation projects throughout the semester.\n\n**PEO 1** – Graduates are able to acquire advanced knowledge on the principles of environmental engineering and can practice in accordance to the acceptable standards in environmental engineering and related fields.\n\n**PEO 2** – Graduates are able to work independently or in a group, able to search and manage knowledge and can readily adapt to changing situations.\n\n**PEO 3** – Graduates able to communicate effectively to different types of audiences and can demonstrate consistent professional ethics with high integrity in serving their organization and society.\n\n**PLO 1** : Graduates are able to integrate advanced scientific and technical knowledge of environmental engineering and related principles.\n\n**PLO 2** : Graduates are able to generate hypotheses, design and carry out studies and scientific research to solve and explain phenomena that occur through the application of appropriate instruments and techniques.\n\n**PLO 3** : Graduates are able to analyze and evaluate the problems in environmental engineering and is able to resolve them through critical problem-solving skill.\n\n**PLO 4** : Graduates are able to demonstrate high ethical standards in professional practice, including environmental and societal issues.\n\n**PLO 5** : Graduates are able to communicate effectively through written and oral modes.\n\n**PLO 6** : Graduates are able to perpetually seek advanced knowledge and technology of environmental engineering and related fields for life-long learning.\n\n|     |\n| --- |\n| **Mainstream** |\n| 8 max semesters \\| 3 min semesters |\n|     |\n| **LIST OF COURSES** <br><br>**Semester 1** |\n| University Elective Subject/ Sustainable Consumption & Production |\n| Research Methodology |\n| Environmental Management and Sustainability |\n| Water Pollution Control |\n| Solid and Hazardous Waste Management |\n|     |\n| **Semester  2 (Only choose 3 elective subjects from the list below )** |\n| Environmental Quality Analysis |\n| Water Quality Assessment and Management |\n| Physico-Chemical Treatment Processes |\n| Biological Treatment Processes |\n| Land Use & Environmental Planning |\n|     |\n| **Semester 3** |\n| Dissertation |\n\nGraduates of the program can work as process engineers, executive engineers, consultants, managers, and R&D officers in various public and private institutions/industries and as academicians at tertiary institutions.\n\n1) Candidate must hold a Bachelor’s Degree in any engineering, science or technology field with a Cumulative Grade Point Average (CGPA) of at least 3.0/4.0 or equivalent from Universiti Teknologi Malaysia or any other Institution of Higher Learning recognized by the Senate. If CGPA is less than 3.0, a minimum of 1 year of working experience in a related field is needed. For CGPA is less than 2.75, a minimum of 3 years of working experience in related fields is needed.\n\n2) Candidates not from Environmental background Degree from an Institution of Higher Learning recognized by the Senate with a CGPA of 3.0/4.0 with or without working experience must take a prerequisite course that the faculty will determine. The course must be registered as **HW\\***.\n\n_\\*HW is a registration status of a course that is stipulated by the Faculty and is subjected to normal assessment_\n\n**For further enquiries please contact:**\n\n![](https://fkt.utm.my/wp-content/uploads/2020/01/Dr-Nurul-Huda-Baharuddin.jpg) **Dr. Nurul Huda Binti Baharudin  \nProgramme Coordinator**  \nEmail: nurul.huda@utm.my"
}