{
  "markdown": "607-5537599/7595 ( Office ) [utmpesisir@utm.my](mailto:utmpesisir@utm.my)\n\n*   [Home](https://odl.utm.my/)\n    \n*   [About Us](https://odl.utm.my/about-us/)\n    \n*   [Programmes](https://odl.utm.my/program/)\n    \n*   [Learning Platform](https://odl.utm.my/learning-platform/)\n    \n*   [Learners Support](https://odl.utm.my/online-learning-support/)\n    \n*   [ODL Guideline](https://odl.utm.my/utm-odl-guideline/)\n    \n*   [FAQs](https://odl.utm.my/faqs/)\n    \n*   [News & Announcement](https://odl.utm.my/news-announcement/)\n    \n*   [Contact Us](https://odl.utm.my/contact-us/)\n    \n\n**UTM OPEN AND DISTANCE LEARNING GUIDELINE**\n============================================\n\n“Our program offers the flexibility of studying from anywhere and at any time over the Internet”\n\n**EDUCATION THAT TRANSFORMS**\n\nUTM is committed to provide the best academic, research and outreach programmes to enhance lives and prepare students to meet challenges and embrace opportunities\n\n![](http://odl.utm.my/wp-content/uploads/sites/190/2022/10/Picture2-2-300x300.png \"Picture2\")\n\n[STUDENT REGISTRATION PROCESS](https://odl.utm.my/utm-odl-guideline#ONLINE)\n\n[MyUTM PORTAL AND UTM SMART](https://odl.utm.my/utm-odl-guideline#UTM)\n\n[ACADEMIC RESOURCES](https://odl.utm.my/utm-odl-guideline#ACADEMIC)\n\n##### BECOMING AN OPEN AND DISTANCE LEARNING (ODL) STUDENT\n\n*   [Being an ODL Student](https://odl.utm.my/utm-odl-guideline#Being)\n    \n*   [Student Identity Verification](https://odl.utm.my/utm-odl-guideline#Student)\n    \n*   [Student Orientation](https://odl.utm.my/utm-odl-guideline#Orientation)\n    \n*   [Your Responsibility](https://odl.utm.my/utm-odl-guideline#responsibility)\n     \n\n[TIPS FOR BECOMING A SUCCESSFUL ODL LEARNER​](https://odl.utm.my/utm-odl-guideline#TIPS)\n\nHOW TO APPLY PHYSICAL MATRIC CARD ![](https://sps.utm.my/wp-content/uploads/2016/05/animated.gif) \n\n##### COURSES AND EXAMINATION\n\n*   [Course Registration and Withdrawal](https://odl.utm.my/utm-odl-guideline#Withdrawal)\n    \n*   [Course Information](https://odl.utm.my/utm-odl-guideline#Course)\n    \n*   [Class Attendance](https://odl.utm.my/utm-odl-guideline#Class)\n    \n*   [Monitoring of Course Participation](https://odl.utm.my/utm-odl-guideline#Monitoring)\n    \n*   [Change of Program of Study, Type of Registration & Mode of Study](https://odl.utm.my/utm-odl-guideline#Change)\n    \n*   [Project and Dissertation](https://odl.utm.my/utm-odl-guideline#Project)\n    \n*   [Examination and Proctors](https://odl.utm.my/utm-odl-guideline#Examination)\n    \n*   [The Appeal and Assessment Results](https://odl.utm.my/utm-odl-guideline#Appeal)\n    \n*   [Deferment, Suspension and Termination](https://odl.utm.my/utm-odl-guideline#Deferment)\n    \n\n[ACADEMIC DISHONESTY](https://odl.utm.my/utm-odl-guideline#DISHONESTY)\n\n##### GRADUATION\n\n*   [Degree Conferrals and Graduation](https://odl.utm.my/utm-odl-guideline#Degree)\n    \n*   [Ordering and Release of Transcripts](https://odl.utm.my/utm-odl-guideline#Ordering)\n    \n*   [Commencement Ceremony](https://odl.utm.my/utm-odl-guideline#Commencement)\n    \n\n**MyUTM PORTAL**\n\n**UTM SMART**\n\n![](https://odl.utm.my/wp-content/uploads/sites/190/2022/10/Picture5.png \"Picture5\")\n\n![](https://odl.utm.my/wp-content/uploads/sites/190/2022/10/Picture6-1.png \"Picture6\")\n\nOnce your student status has been activated by your faculty, your UTMID will be generated automatically.\n\nNotification through [utmid@utm.my](mailto:utmid@utm.my) will be sent to your registered email address (an email address that you have provided with your admission application) after registration.\n\nNew student can login to myUTM Portal using UTM ID via [http://my/utm.my.](http://my/utm.my)\n\n**UTM SMART**\n\n![](https://odl.utm.my/wp-content/uploads/sites/190/2022/10/Picture9-1.jpg \"Picture9\")\n\nUTM Smart is built as an initiative of digital campus lifestyle at UTM, to provide services which complement and facilitate the needs of students, staff and even visitors.\n\nOnce your student status has been activated by your faculty, your UTMID will be generated automatically.\n\nNotification through [utmid@utm.my](mailto:utmid@utm.my) will be sent to your registered email address (an email address that you have provided with your admission application) after registration.\n\nNew student can login to myUTM Portal using UTM ID via \\>**[http://my/utm.my.](http://my/utm.my)\n**\n\nUTM Smart is built as an initiative of digital campus lifestyle at UTM, to provide services which complement and facilitate the needs of students, staff and even visitors.\n\n**ACADEMIC RESOURCES**\n\nACADEMIC RULES & REGULATIONS\n\nACADEMIC CALENDER\n\n![](https://odl.utm.my/wp-content/uploads/sites/190/2022/10/WhatsApp-Image-2022-10-04-at-11.22.16-AM-1.jpeg \"WhatsApp Image 2022-10-04 at 11.22.16 AM\")\n\nDownload from SPS Website:  \n[https://sps.utm.my/policy-guidelines-v2/](https://sps.utm.my/policy-guidelines-v2/)\n\nACADEMIC CALENDER\n\n![](https://odl.utm.my/wp-content/uploads/sites/190/2024/09/ACADEMIC-CALENDAR-DEGREE-AND-POSTGRADUATE-2024_2025_Page_3-1.jpg \"ACADEMIC-CALENDAR-DEGREE-AND-POSTGRADUATE-2024_2025_Page_3\")\n\nDownload from SPS Website:  \n[https://sps.utm.my/policy-guidelines-v2/](https://sps.utm.my/policy-guidelines-v2/)\n\nDownload from AMD Website:  \n[https://amd.utm.my/academic-calendar/](https://amd.utm.my/academic-calendar/)\n\n**BECOMING AN OPEN AND DISTANCE LEARNING (ODL) STUDENT**\n\n[**Being an ODL Student**](https://odl.utm.my/Being)\n\nAll our courses are designed for self-paced learning with an opportunity to interact with the instructors through video conferences or chat. Each course includes a mixture of rich content, targeted learning strategies, dynamic screens, interactive tests, exercises with feedback, and illustrative case studies. The approach is meant to make complex topics accessible to novice learners while meeting the needs of experienced professionals wishing to update their skills. In addition to the course materials, you will find links to online resources, recommended readings, and self-study tutorials to get you started in applying what you have learned.\n\n**Student Identity Verification**\n\nUniversiti Teknologi Malaysia verifies the identity of a student who participates in Open Distance Learning through at least one of the following options:\n\n*   A secure login and passcode\n*   Proctored examination\n\nProctored examinations may be required for a summative assessment for certain courses. If required, a qualified proctor, approved by the instructor, must verify the identity of the student taking the exam. Online proctoring is also available as an alternative to verify student identity.\n\n![](https://odl.utm.my/wp-content/uploads/sites/190/2022/11/student.png \"student\")\n\n**Student Orientation**\n\nFirst-time distance learning students are required to complete the ‘_**ODL Student Orientation course**_’ before the start of classes.\n\nThe orientation will also show up in your class list under ‘My courses’ in the ODL learning management system. The online orientation helps to familiarize students with the Moodle environment and outlines key strategies for success as an online student.\n\n**Your responsibility**\n\nAs a UTM ODL student, you are required to comply with the rules and regulations. Students must register for the courses at the beginning of the semester, pay the tuition fees, and practice academic integrity during their studies.\n\nCompletion of the orientation course is compulsory. You can only access your courses in which you are registered once the ODL Student Orientation has been successfully completed in our Learning Management System\n\n**TIPS FOR BECOMING**\n\n![](https://odl.utm.my/wp-content/uploads/sites/190/2022/11/Tip-becoming-successful-ODL-learner.png \"Tip becoming successful ODL learner\")\n\n**COURSES AND EXAMINATION**\n\n**Course Registration and Withdrawal**\n\nStudents are required to register for their courses at the beginning of the semester. Failure to register for your course for a semester will lead to the termination of your study. A student must be registered in a minimum of one (1) course in the normal semester. Students can have a maximum of eighteen (18) credits in the normal semester and a maximum of ten (10) credits in the short semester.\n\nReinstatement no later than two (2) semesters after the termination, subject to the available remaining period of study. Otherwise, students must re-apply for admission. You should register on time to avoid late registration fees.\n\nAlways check your academic record. You may contact the Academic Management Division for corrections to the record. A student may insert and/or delete a course within the prescribed duration.\n\nStudents may withdraw (TD) from any course in which they are registered in the current semester within the prescribed duration, subject to the minimum credit requirement. A student who withdraws (TD) from all courses will be given a deferment of the study, subject to the deferment regulations\n\n**Course Information**\n\nThe course information is a document that explains the scope of your course. The course information lists assignments, due dates, assessment criteria, and course expectations. It also contains your instructor’s contact information and instructions for when and how best to reach them.\n\nOther information found in the course information includes school and instructor policies, grades, course materials, and other pertinent course information. It can be found in ODL System at the top of the Course Page of your course. You should print a copy and/or save a copy to your desktop for easy reference.\n\n**Class Attendance**\n\nStudents enrolling in an ODL program are not required to be physically present for their class. ODL students must achieve at least 20% involvement in a course by mid of semester. Student participation is calculated from student involvement in weekly assignments, training, and accessing self-directed learning materials provided by lecturers. Students who do not meet the specified percentage of participation may be withdrawn from a course. Please contact your instructor or the School of Graduate Studies should you have any problems related to completing your assignments.\n\n![](https://odl.utm.my/wp-content/uploads/sites/190/2022/11/student-2.png \"student 2\")\n\n**Monitoring of Course Participation**\n\nStudent participation will be monitored using activity completion and learning analytics in the ODL Learning Management System. Instructors will be able to identify students who have not accessed the course recently (in the past few days, weeks, or months) and students who have not completed their formative assessment. Students will receive messages to remind them to participate, with offers of assistance where needed. Overall records of the student’s participation can be found on the system dashboard.\n\n**Change of Program of Study, Type of Registration & Mode of Study**\n\nStudents may apply to change the type of study/mode of delivery of coursework with a mixed mode or full research or Open and Distance Learning (ODL) and vice versa. The change can be made before the final semester of study and the student is only permitted to make only one mode change throughout the course of study. You are required to consult your school/faculty before applying for change. Exchange more than once is only allowed for reasons that are accepted after the consent of the faculty.\n\n**Project and Dissertation**\n\nStudents who have completed all taught courses can progress to the master’s Projects. Dissertations/Projects are a very important and demanding part of your studies. It requires students to undertake a substantial self-directed piece of work under the direction of an expert academic supervisor, with whom they will engage for the duration. The Master’s dissertation/projects, run over two consecutive semesters, which include the proposal and final project.\n\n**Examination and Proctors**\n\nSome courses may require proctored exams. A proctored exam is overseen by an impartial individual, called a proctor, who supervises the student during the exam. The proctor ensures the security and integrity of the exam.\n\nThe proctoring process may be conducted via online proctoring or face-to-face proctoring. In a face-to-face proctoring situation, we will identify a physical location near the student’s residence, where the student will be asked to come and take the exam at the scheduled time, overseen by the identified proctor. Alternatively, instructors may also require students to use the online proctoring system.\n\nIf students are unhappy with the results, students can request feedback about their exam performance from the faculty. Exam feedback requests are only accepted within three weeks after marks are released (provisional or final).\n\n![](https://odl.utm.my/wp-content/uploads/sites/190/2022/11/student-3.png \"student 3\")\n\n**The Appeal and Assessment Results**\n\nA student can appeal for a review of any subject grade during the giving period and at the prescribed cost. The points/marks that are taken into consideration are those obtained after a review or re-check. Students must give the notice to appeal within fourteen (14) days of receiving the results from the Examination Board.\n\n**Deferment, Suspension and Termination**\n\nA student may apply for deferment of study due to health reasons by submitting a medical report certified by a Medical Officer recognized by the University. In such a case the deferment will not be considered for the duration of the study. A similar status of deferment may be granted to a student due to reasons of interest to the University or the Nation.\n\nDeferment of study due to reasons other than those stated above will be considered in the duration of the study. Deferment of more than two (2) consecutive semesters is not allowed. A student who fails to register after deferment of two (2) consecutive semesters may be terminated.\n\n**ACADEMIC DISHONESTY**\n\nStudents are expected to keep their UTMID username and password confidential, to submit only original work, and to adhere to the Universiti Teknologi Malaysia policy on academic dishonesty.\n\nHonesty and integrity are essential to the free exchange of ideas and knowledge at Universiti Teknologi Malaysia. Students share the responsibility to develop and maintain an atmosphere where new ideas can be discussed and presented while recognizing the original work of others. Graduates of Universiti Teknologi Malaysia will pursue professional careers in which people’s lives and the welfare of the environment are entrusted to them. Therefore, students must understand and honor the principles of honesty and integrity that they will carry into their future endeavors.\n\nIn the age of the internet, intellectual property may be freely exchanged; however, this is not the case. Individuals who labor over such creations – whether physical or digital – have the right to receive compensation and/or recognition for the use of their work under copyright law in the United States. Students are responsible for ensuring that the work they present as their own is truly their own. When the work of others is presented, it must be properly attributed and cited. This includes information that is in the public domain.\n\n**GRADUATION**\n\n**Degree Conferrals and Graduation**\n\nA student is to be awarded a degree after obtaining complete total credits for graduation as determined by the curriculum of the program with an academic standing of Good Pass (KB) and paying all fees.\n\n**Ordering and Release of Transcripts**\n\nUTM ODL graduates can apply for transcripts through the UTM online system. The graduate will be charged MYR 25.00 for each transcript. Applications can be submitted through [http://aimsweb.utm.my/UTMTrAS](http://aimsweb.utm.my/UTMTrAS)\n\n**Commencement Ceremony**\n\nStudents who meet the requirements for graduation will be awarded their degrees through the University Senate. The convocation ceremony will be held at UTM Johor Bahru, Malaysia. Attendance is optional, but distance learning students are welcome to visit the university, meet fellow graduates, and celebrate their success.\n\n![](https://odl.utm.my/wp-content/uploads/sites/190/2022/11/student-4.png \"student 4\")"
}