{
  "markdown": "Industrial Visit to Venture GES Manufacturing Services (M) Sdn. Bhd.\n====================================================================\n\nby [powerpic](https://fke.utm.my/author/powerpic/ \"Posts by powerpic\")\n | Nov 21, 2016 | [POWER](https://fke.utm.my/category/power/)\n\n![](https://fke.utm.my/wp-content/uploads/2016/12/VentureA-980x392.jpg)\n\nOn 17 November 2016, the Faculty of Electrical Engineering (FKE), Universiti Teknologi Malaysia (UTM), organised an industrial visit for students undertaking the subject “Introduction to Electrical Engineering”. The visit was conducted at Venture GES Manufacturing Services (M) Sdn. Bhd., Senai, Johor. The main objectives of the visit to Venture GES Manufacturing Services (M) Sdn. Bhd. were to allow the students to gain exposure on electrical/electronic industries and be aware of the responsibilities as electrical/electronic engineers. The visit was necessary for the students to fulfill part of the requirements for completing the subject “Introduction to Electrical Engineering”, where at the end of the 12-week course, the students were expected to be able to (i) analyse and describe the responsibilities of engineers to the society; (ii) explain the importance of sustainable solutions; (iii) be accountable on assigned tasks in an ethical manner; and (iv) manage a project. The visit to Venture GES Manufacturing Services (M) Sdn. Bhd. was fruitful for the students where the students had the chance to visit various electrical/electronic assembly processes. UTM FKE wishes to thank Venture GES Manufacturing Services (M) Sdn. Bhd., especially Mr. Winson Chan (General Manager), Mr. Andy Yeo (Head of Engineering) and their colleagues, for entertaining the visit.\n\n# Dr. Lau Kwan Yiew, Institute of High Voltage and High Current, Universiti Teknologi Malaysia.\n\n![venture-ges-1a](https://fke.utm.my/wp-content/uploads/2016/12/Venture-GES-1a.jpg)\n\n_Group photo of UTM FKE’s students with Mr. Yeo (first row, middle) at the main entrance of Venture GES Manufacturing Services (M) Sdn. Bhd._\n\n![venture-ges-2](https://fke.utm.my/wp-content/uploads/2016/12/Venture-GES-2-2048x1152.jpg)\n\n_UTM FKE’s students preparing to visit the manufacturing assembly plant of Venture GES Manufacturing Services (M) Sdn. Bhd., led by the staff (middle) of Venture GES Manufacturing Services (M) Sdn. Bhd._\n\nAbout Venture\n\nVenture was founded in 1984 as a global electronics services provider. It is a leading global provider of technology services, products and solutions with established capabilities spanning marketing research, design and development, product and process engineering, design for manufacturability, supply chain management, as well as product refurbishment and technical support across a range of high-mix, high-value and complex products. More details about Venture can be found [here](http://www.venture.com.sg/)\n.\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/industrial-visit-to-venture-ges-manufacturing-services-m-sdn-bhd#)"
}