{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/pensyarah-utm-terpilih-hadiri-majlis-ulang-tahun-aeon-group-ke-30-di-tokyo#)\n    \n*   [Instagram](https://builtsurvey.utm.my/pensyarah-utm-terpilih-hadiri-majlis-ulang-tahun-aeon-group-ke-30-di-tokyo#)\n    \n*   [RSS](https://builtsurvey.utm.my/pensyarah-utm-terpilih-hadiri-majlis-ulang-tahun-aeon-group-ke-30-di-tokyo#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/pensyarah-utm-terpilih-hadiri-majlis-ulang-tahun-aeon-group-ke-30-di-tokyo#)\n    \n*   [Instagram](https://builtsurvey.utm.my/pensyarah-utm-terpilih-hadiri-majlis-ulang-tahun-aeon-group-ke-30-di-tokyo#)\n    \n*   [RSS](https://builtsurvey.utm.my/pensyarah-utm-terpilih-hadiri-majlis-ulang-tahun-aeon-group-ke-30-di-tokyo#)\n    \n\nPensyarah UTM Terpilih Hadiri Majlis Ulang Tahun AEON Group Ke-30 di Tokyo\n==========================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Nov 25, 2019 | [Award](https://builtsurvey.utm.my/category/award/)\n, [Conference & Seminar](https://builtsurvey.utm.my/category/conference-seminar/)\n, [event](https://builtsurvey.utm.my/category/event/)\n, [News](https://builtsurvey.utm.my/category/news/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2019/11/74614877_2859227620789292_1715445955618144256_o-1080x640.jpg)\n\nDr Roshida Abdul Majid, pensyarah Senibina Fakulti Alam Bina dan Ukur (FABU), Universiti Teknologi Malaysia (UTM) telah terpilih untuk menghadiri majlis Ulang Tahun ke-30 syarikat global ternama AEON Group dan pelancaran Sustainable Development Goals 2050.\n\nAcara tersebut berlangsung selama empat hari dari 31 Oktober sehingga 3 November 2019 bertempat di Tokyo, Jepun.\n\nLebih membanggakan, beliau juga telah berjaya menempa nama di negara matahari terbit, Jepun apabila turut terpilih untuk memberi ucapan utama ‘Sustainable Development Goals’ dan hubungkait dengan profesion semasa beliau di FABU, UTM.\n\nHanya enam negara peserta terpilih iaitu dari Malaysia, Australia, Indonesia, Peru, Jepun dan Jerman. Pemilihan adalah berdasarkan tapisan yang menyeluruh dibuat terhadap 252 esei yang dihantar oleh peserta dari 17 buah negara dari seluruh dunia di mana esei ini juga merupakan syarat utama penyertaan untuk acara gilang gemilang ini.\n\nSelain itu semua peserta juga merupakan bekas Duta Remaja ke Jepun suatu ketika dahulu yang mana Dr Roshida sendiri ialah Duta Remaja Malaysia ke Jepun pada tahun 1990 pada ketika umur beliau 15 tahun.\n\nOleh itu majlis ini juga merupakan perjumpaan semula peserta Duta Remaja ke Jepun dari seluruh dunia seperti United Kingdom, Australia, Germany, Korea, Peru, Brazil, Bulgaria, Philipines, Malaysia, Thailand Indonesia, China, Italy, Myanmar, Kemboja dan Laos.\n\nLebih bermakna lagi perjumpaan ini turut melibatkan sesi perbincangan tentang 4 topik utama 17 Sustainable Development Goals yang disenaraikan oleh United Nation, iaitu _Quality Education, Climate Change, Life Below Water_ dan  _Health and Well Being_.\n\nAcara gilang gemilang ini diakhiri dengan penyampaian deklarasi untuk tindakan masa hadapan  yang disampaikan oleh ketua kumpulan 4 topik utama Sustainable Development Goals dengan disaksikan oleh Founder AEON Group, En Takuya Okada, Pengerusinya En Katsuya Okada, pegawai tertinggi syarikat serta semua ahli diplomat 17 buah negara yang terlibat di Jepun.\n\nProgram ini ditaja sepenuhnya oleh AEON 1 % Club dan Malaysia diwakili oleh 11 peserta yang berlatarbelakangkan profesion yang berbeza.\n\n![](https://news.utm.my/wp-content/uploads/2019/11/6-1320x990.jpg)\n\nWakil dari pelbagai negara bersama Founder AEON Group En Takuya Okada yang berumur 94 tahun (duduk)\n\n![](<Base64-Image-Removed>)\n\nSemua peserta dari 17 buah negara merakamkan gambar kenangan bersama\n\n![](<Base64-Image-Removed>)\n\n11 peserta dari Malaysia yang terdiri daripada pelbagai latar belakang.\n\n![](<Base64-Image-Removed>)"
}