{
  "markdown": "Academic Service Learning by SKEE 4653\n======================================\n\nby [website](https://fke.utm.my/author/website/ \"Posts by website\")\n | Nov 14, 2019 | [Faculty](https://fke.utm.my/category/faculty/)\n\n![](https://fke.utm.my/wp-content/uploads/2019/11/10.jpg)\n\nThe Academic Service Learning (ASL) program was first introduced as the new teaching and learning approach in SKEE 4653 (Photovoltaic and Wind Energy System) starting from 2017/2018 academic session. This year, it is the third time ASL is implemented, which was conducted by students who enrolled in SKEE 4653 course.\n\nThe ASL is one of the components of UTM’s New Academia Learning Innovation (NALI) initiative. The main objective of the ASL is to engage UTM’s students with the local community. This is also one way the School of Electrical Engineering can contribute to the local society. This engagement is hoped to enhance the students’ generic skills as well as to promote or to educate the knowledge of photovoltaic (solar energy) technology to secondary school students.\n\nIn this academic session (2019 2020-1), we have 63 students undertaking the SKEE 4653 course. In which, they were divided into four groups with 12 to 17 members in a team. In this ASL program, the students are required to approach the local secondary schools with permission to hold the event. Then, they have to plan for brief presentation on solar energy and related activities that can deliver the message of photovoltaic technology. Besides that, they also have to make sure that activities they plan are interesting in order to keep the school pupils’ attention.\n\nThis year the schools that they have successfully approached are:\n\n1.  Sekolah Menengah Kebangsaan Seri Pulai Perdana (on 20th October 2019)\n\n(Participated by form 3 students in the morning session)\n\n2.  Sekolah Menengah Kebangsaan Seri Pulai Perdana (on 20th October 2019)\n\n(Participated by form 3 students in the afternoon session)\n\n3.  Sekolah Menengah Kebangsaan Kulai Besar (on 21st October 2019)\n\n(Participated by form 3 students in the morning session)\n\n4.  Sekolah Menengah Kebangsaan Kangkar Pulai (on 10th November 2019)\n\n(Participated by form 4 students in the morning session)\n\nIn this ASL program, all related planning and execution of the activities were done by the students. Lecturer is there to guide and facilitate them only. Lecturer has to attend all the event the students organized to evaluate their performance.\n\nIn short, the ASL program this time was successfully carried out for all the schools. The participated schools were very happy to welcome us and have given us with positive feedbacks and supports to make this program a success.\n\nA great appreciation to all the SKEE 4653 students who made this event a success one!\n\nReported by,\n\nAssoc. Prof. Ir. Dr. Tan Chee Wei\n\n(Course Coordinator of SKEE 4653)\n\n             **![](https://fke.utm.my/wp-content/uploads/2019/11/12.jpg) ![](https://fke.utm.my/wp-content/uploads/2019/11/14.jpg) ![](https://fke.utm.my/wp-content/uploads/2019/11/13.jpg) ![](https://fke.utm.my/wp-content/uploads/2019/11/11.jpg) ![](https://fke.utm.my/wp-content/uploads/2019/11/7.jpg) ![](https://fke.utm.my/wp-content/uploads/2019/11/9.jpg) ![](https://fke.utm.my/wp-content/uploads/2019/11/8.jpg) ![](https://fke.utm.my/wp-content/uploads/2019/11/6.jpg) ![](https://fke.utm.my/wp-content/uploads/2019/11/2.jpg) ![](https://fke.utm.my/wp-content/uploads/2019/11/3.jpg) ![](https://fke.utm.my/wp-content/uploads/2019/11/5.jpg) ![](https://fke.utm.my/wp-content/uploads/2019/11/1.jpg) ![](https://fke.utm.my/wp-content/uploads/2019/11/4.jpg) ![](https://fke.utm.my/wp-content/uploads/2019/11/10.jpg)Academic Service Learning by SKEE 4653 (Photovoltaic and Wind Energy System) – 20192020-1**\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/academic-service-learning-by-skee-4653#)"
}