{
  "markdown": "Information Day of the Faculty of Electrical Engineering Successfully Held\n==========================================================================\n\nby [powerpic](https://fke.utm.my/author/powerpic/ \"Posts by powerpic\")\n | Sep 28, 2017 | [POWER](https://fke.utm.my/category/power/)\n\n![](https://fke.utm.my/wp-content/uploads/2017/09/Activities-1-1008x675.jpg)\n\nThe Information Day of the Faculty of Electrical Engineering (FKE), Universiti Teknologi Malaysia (UTM), was successfully held by the First Year Experience’s committee of FKE (in charge of the undergraduate student activities of the day) in collaboration with the JURUTEK FKE UTM team (in charge of the career fair of the day) on 26 September 2017. The event was specifically held for first year undergraduate students of FKE so that they would be aware of various student activities and societies at FKE, and had an early exposure to career opportunities as electrical and electronic engineers. During the event, the students had the chance to listen to industrial talks presented by representatives from Alcon Johor Sdn. Bhd. and Malaysia Marine and Heavy Engineering (MMHE) in addition to various talks delivered by the representatives of student societies at FKE. These included the JURUTEK FKE UTM team, the IEEE UTM Student Branch, the UTM Robocon team, the UTM EVolt team, and the UTM Al Jazari team. The students also had fun with various games and activities held by the student societies during the event. FKE, through the event, hopes that the students will get involved in student activities and inculcate good values through the activities, apart from achieving excellent grades in their academic studies. The Chair of the First Year Experience’s committee, Dr. Mohd Fairus Mohd Yusoff, and the Director of the event, Dr. Jasrul Jamani Jamian, wish to thank the industries and all the staff and students of FKE for their active participation during the event.\n\n![alcon-1](https://fke.utm.my/wp-content/uploads/2017/09/Alcon-1.jpeg)\n\nIndustrial talk by Alcon Johor Sdn. Bhd.\n\n![mmhe-1](https://fke.utm.my/wp-content/uploads/2017/09/MMHE-1.jpeg)\n\nIndustrial talk by Malaysia Marine and Heavy Engineering\n\n![activities-1](https://fke.utm.my/wp-content/uploads/2017/09/Activities-1.jpg)\n\nStudents at booths\n\n![activities-2](https://fke.utm.my/wp-content/uploads/2017/09/Activities-2.jpg)\n\nStudents at booths\n\n![activities-3](https://fke.utm.my/wp-content/uploads/2017/09/Activities-3.jpg)\n\nStudents at booths\n\n![activities-5](https://fke.utm.my/wp-content/uploads/2017/09/Activities-5.jpg)\n\nStudents having fun with games\n\n![activities-4](https://fke.utm.my/wp-content/uploads/2017/09/Activities-4.jpg)\n\nStudents having fun with games\n\nBy Ir. Dr. Lau Kwan Yiew, Universiti Teknologi Malaysia\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/information-day-of-the-faculty-of-electrical-engineering#)"
}