{
  "markdown": "Academic Office : +607-5333716 | Email : academic-fcee@utm.my | Administration Office : +607-5533499 [fcee@utm.my](mailto:fcee@utm.my)\n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n![](https://fkt.utm.my/wp-content/uploads/2023/03/MKKL-724x1024.jpg \"MKKL\")\n\n###### _Updated : 10 March 2023_\n\n**MASTER OF SCIENCE (M.Sc) IN PROCESS PLANT MANAGEMENT**\n\nCurrent globalisation trend demands future managers to have the ability to change by shaping a definitive shift towards the development of high growth and sustainable process industry. Thus, the Integrated Process Plant Management Scheme (IPPMS), a modular-based training programme, affords qualified professionals from the chemical and related industries an opportunity to gain the degree of afore-mentioned competency and working knowledge requisite to effect the transfer, adaptation and integration of new technologies intrinsic to process plant management, future-ready to further spur the surge of national advancement within a global framework.\n\n**Benefits:**\n\n*   Modular based programme specially made for working adult\n*   Flexible course delivery\n*   Unique course content with both technical and business/ management aspects well covered\n\n*   [Programme Specifications](https://fkt.utm.my/msc-process-plant-management-2#)\n    \n*   [Programme Educational Objectives (PEO)](https://fkt.utm.my/msc-process-plant-management-2#)\n    \n*   [Programme Learning Outcomes (PLO)](https://fkt.utm.my/msc-process-plant-management-2#)\n    \n*   [Program Structure](https://fkt.utm.my/msc-process-plant-management-2#)\n    \n*   [General Entry Requirement](https://fkt.utm.my/msc-process-plant-management-2#)\n    \n*   [Entry Requirement](https://fkt.utm.my/msc-process-plant-management-2#)\n    \n*   [Career opportunities](https://fkt.utm.my/msc-process-plant-management-2#)\n    \n\nCurrent globalization trend demands future managers to have the ability to change by shaping a definitive shift toward the development of high growth and sustainable process industry. Thus, this programme affords qualified professionals from the chemical and related industries an opportunity to gain the degree of aforementioned competency and working knowledge requisite to affect the transfer, adaptation and integration of new technologies intrinsic to process plant management, future-ready to further spur the surge of national advancement within a global framework.\n\nMaster of Science (Process Plant Management) by Taught Course is suitable for any bachelor graduates from science, technology, and engineering field. Graduates from other disciplines with relevant experiences are also encouraged to apply. Depending on the candidate’s background, pre-requisite courses may be imposed to assist the candidate to comprehend more in-depth advanced courses offered.\n\n|     |     |\n| --- | --- |\n| PEO 1 | Mastery of knowledge and competency in advanced areas of Process Plant Management. |\n| PEO 2 | Practice professionalism and high standards of ethical conducts within organisation and society. |\n| PEO 3 | Responsive to changing situations by continuously acquiring new knowledge and skills. |\n\n|     |     |\n| --- | --- |\n| PLO 1 | Attain new frontiers of knowledge in the field of Process Plant Engineering. |\n| PLO 2 | Solve complex problems critically and integratively using systematic systematic approaches. |\n| PLO 3 | Apply practical skills to solve problems in the field of Chemical Engineering. |\n| PLO 4 | Demonstrate effective collaboration with stakeholders professionally. |\n| PLO 5 | Communicate effectively the knowledge, skills and ideas using appropriate methods to peers, experts and communities. |\n| PLO 6 | Use digital technologies and appropriate software competently to enhance study and practice. |\n| PLO 7 | Evaluate numerical and graphical data critically using quantitative or qualitative tools in solving problems. |\n| PLO 8 | Demonstrate leadership, autonomy and responsibility in managing resources. |\n| PLO 9 | Engage self-advancement through continuous learning or professional development. |\n| PLO 10 | Demonstrate entrepreneurial skills with relevant knowledge and expertise. |\n| PLO 11 | Demonstrate respectable ethical conducts and professionalism skills in an organisation and society. |\n\n**Program structure: Intake Semester 1**\n\n![](https://fkt.utm.my/wp-content/uploads/2023/03/MKKL-Programme-Structure-Intake-Sem-1.jpg)\n\n**Program structure: Intake Semester 2**\n\n![](https://fkt.utm.my/wp-content/uploads/2023/03/MKKL-Programme-Structure-Intake-Sem-2.jpg)\n\n*   A Bachelor’s Degree with good honours from Universiti Teknologi Malaysia or any other institution of higher learning recognised by the Senate; or\n*   A qualification equivalent to a Bachelor’s Degree and experience in the relevant field recognised by the Senate.\n\n![](https://fkt.utm.my/wp-content/uploads/2023/03/MKKL-General-Entry-Requirement-1.jpg)\n\n![](https://fkt.utm.my/wp-content/uploads/2023/03/MKKL-General-Entry-Requirement-2.jpg)\n\n*   Bachelor of Chemical Engineering with a minimum CGPA of 2.50 or equivalent, or\n*   Bachelor of Science with a minimum CGPA of 2.50 or equivalent, or\n*   Bachelor of Engineering with a minimum CGPA of 2.50 or equivalent, or\n*   Bachelor of Technology with a minimum CGPA of 2.50 or equivalent, or\n*   Other Bachelor’s Degree with at least CGPA 2.50 or equivalent and approved and recognized by the UTM Senate\n*   Candidates with CGPA of less than 2.50 with minimum 5 years of working experience in related fields\n\n**English Requirement for International Students:**\n\n*   Minimum English Test of English as a Foreign Language (TOEFL) score 550 or International English Language Test System (IELTS) band 6.0.\n*   Exceptions can be given to foreign candidates who are from a country whose native language is English or have a degree from that country.\n*   Candidates who do not have one of these qualifications are required to take the University English Test before registering for the program of study.\n*   If they fail, candidates are required to follow the Intensive English Program and pass before being allowed to continue their respective programs of study.\n\n*   Oil & Gas\n*   Chemical & Manufacturing Industry\n*   Oil Palm Industry\n*   Fine & Specialty Chemicals\n*   Other Related Chemical-based Industries"
}