{
  "markdown": "Third Year SKEL Student Briefing on Elective Courses\n====================================================\n\nby [commpic](https://fke.utm.my/author/commpic/ \"Posts by commpic\")\n | Dec 9, 2016 | [COMM](https://fke.utm.my/category/comm/)\n\n![](https://fke.utm.my/wp-content/uploads/2017/01/art23-2.jpg)\n\n29th November 2016 – The third year undergraduate students for the Degree of Electric and Electronic Engineering (SKEL) received a briefing regarding the elective courses offered to them during the three final semesters of their studies in the university. The briefing was conducted in Lecture Room 3 (BKT 3), Block P16 of the faculty of electrical engineering. Choosing an appropriate elective course is one of the most important points during their studies as not only it affects their academic direction but also more importantly career possibilities in the future. The briefing was organized by the Department of Electronic and Computer Engineering (ECE) with invitation towards representatives from the Department of Communication Engineering (COMM) to also promote their elective course offerings.\n\n[![](https://fke.utm.my/wp-content/uploads/sites/9/2017/01/art23-2.jpg)](https://fke.utm.my/wp-content/uploads/sites/9/2017/01/art23-2.jpg)\n**Dr. Eileen Su Lee Ming talked on the medical electronics related courses.**\n\nAssociate Professor Dr. Norlaili Mat Safri as the head of the ECE department officiated the briefing followed with talks given by Dr. Suhana Mohamed Sultan, Associate Prof Dr. Nadzir Marsono and Dr. Eileen Su Lee Ming regarding the ECE’s elective courses of Microelectronics, Electronic System Design and Computer Engineering as well as Medical Electronics respectively. Subsequent slot was then allocated for COMM department representatives Dr. Rashidah Arsat and Dr. Ahmad Shahidan Abdullah who took the opportunity for a short video screening highlighting the career opportunities for those students who chose to specialize their studies in the field of communication engineering. Apart from that, the video also touches on the topics of final year projects and offered elective courses namely Acoustics, Radio Frequency and Microwave, Photonic, Sonar Technology as well as Network Communication.\n\n[![](https://fke.utm.my/wp-content/uploads/sites/9/2017/01/art23-3.jpg)](https://fke.utm.my/wp-content/uploads/sites/9/2017/01/art23-3.jpg)\n**Short video screening by the representatives of COMM department Dr. Rashidah Arsat and Dr. Ahmad Shahidan Abdullah.**\n\nThe students demonstrated great interests throughout the briefing knowing that the choice they made here is of great importance in shaping their future. It is thusly hoped that the briefing has helped said students in making the best decision going forward to the final stages of their studies in the university.\n\n[![](https://fke.utm.my/wp-content/uploads/sites/9/2017/01/art23-1.jpg)](https://fke.utm.my/wp-content/uploads/sites/9/2017/01/art23-1.jpg)\n**Students gave full attention towards the contents of the briefing.**\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/third-year-skel-student-briefing-on-elective-courses#)"
}