{
  "markdown": "[+603-2180 5123](tel:+603-2180 5123)\n / [+603-2180 5182](tel:+603-2180 5182)\n [apel@utm.my](mailto:apel@utm.my)\n\n![](https://apel.utm.my/wp-content/uploads/sites/14/2023/09/apel-logo.jpg \"apel logo\")\n\n### WHAT IS APEL?\n\nAPEL or Accreditation of Prior Learning Experience is a process of recognizing skills and knowledge based on prior experience that has never been assessed or given credit before.\n\nThe experience is from formal or informal learning such as work experience, short-term courses, community service or voluntary work, self-study and leisure activities. Because the learning has never been assessed before, APEL applicants need to submit evidence (such as reports, portfolios, projects, performance, written assignments, oral, interviews, etc.) that will be assessed and verified by assessors recognized by MQA.\n\nThe APEL certificate you obtain means that your previous learning and professional experience have been officially recognized. It can contribute to your eligibility to follow a study program at a university where the academic entry requirements may not have been met before.\n\nAPEL has the potential to make a significant impact for those who, through life and work experience, have acquired knowledge, skills and analytical abilities comparable to higher education awards.\n\n### APEL CATEGORIES\n\nThe UTM APEL Centre offers for THREE categories which are:\n\n**APEL.A (Access)**\n\nAPEL.A is the award of entry to an accredited programme with a Higher Education (HEP) through prior experiential learning.\n\n**APEL.C (Credit Award)**\n\nAPEL.C is the award of credits to an accredited programme with a Higher Education (HEP) through prior experiential learning.\n\n**APEL.Q (Academic Qualification)**\n\nAPEL.Q is to obtain an award degree through of your working learning experiences.\n\nFUNCTION OF UTM APEL CENTRE\n\n![](https://apel.utm.my/wp-content/uploads/sites/14/2023/09/centre.png \"centre\")\n\n*   As a centre for assessing and recognizing non-formal and informal studies for the purpose of admission to formal higher education.\n\n*   Become a centre for the coordination of criteria and assessment instruments for admission through APEL to higher education centres.\n\n*   Become a referral and support resource centre for APEL applicants.\n\n*   Support and realize the nation’s lifelong learning agenda.\n\nOrganization Chart\n\n[![](https://apel.utm.my/wp-content/uploads/sites/14/2024/11/UTM-APEL-Organization-Chart.png \"UTM APEL Organization Chart\")](https://apel.utm.my/wp-content/uploads/sites/14/2024/11/UTM-APEL-Organization-Chart.png)"
}