{
  "markdown": "+607-553 0365 [odvcai@utm.my](mailto:odvcai@utm.my)\n\n##### JENIS SKIM TENAGA AKADEMIK PELAWAT/ADJUNG/JEMPUTAN\n\n##### Skim Pelawat\n\n1.  **Profesor Pelawat Kehormat/ Ulung (Distinguished Visiting Professor)**\n2.  **Profesor Pelawat Kanan (Senior Visiting Professor)**\n3.  **Profesor Pelawat (Visiting Professor)**\n4.  **Profesor Madya Pelawat (Associate Visiting Professor)**\n5.  **Pensyarah Pelawat (Visiting Lecturer)**\n\nTakrifan berdasarkan Garis Panduan Penggunaan Gelaran Profesor (Majlis Profesor Negara, 2014):\n\nProfesor Kehormat: Tokoh yang diberi gelaran tetapi tidak bertugas sebagai profesor dan diberi kepada sesiapa sahaja termasuk ahli politik dan warga korporat. Gelaran ini diberi kepada individu tetapi tidak disertai dengan tugas atau kewajipan. Gelaran ini tidak boleh digunakan di hadapan nama penerima.\n\nProfesor Pelawat: Profesor yang diundang mengajar atau memberi ceramah di sesebuah universiti lain untuk satu tempoh masa tertentu. Profesor Pelawat boleh dilantik secara sepenuh masa oleh IPT yang lain\n\n##### Skim Adjung\n\n1.  **Profesor Adjung**\n2.  **Profesor Madya Adjung**\n3.  **Pensyarah Adjung**\n\nTakrifan berdasarkan Garis Panduan Penggunaan Gelaran Profesor (Majlis Profesor Negara, 2014):\n\nProfesor Adjung: Profesor Adjung dianugerahkan kepada kakitangan bukan akademik yang mempunyai pengalaman luas dalam profesion beliau atau dalam sesuatu industri dan telah banyak memberi sumbangan kepada perkembangan sesuatu bidang ilmu. Biasanya gelaran itu diberikan kepada tokoh perunding, penyelidik dan pentadbir yang banyak membantu sesebuah universiti dalam sesuatu prakarsa atau program khas berkaitan pengembangan ilmu. Gelaran ini tidak boleh digunakan dihadapan nama penerima.\n\n##### Skim Jemputan\n\n1.  **Profesor Jemputan**\n2.  **Profesor Madya Jemputan**\n3.  **Pensyarah Jemputan**\n\nTakrifan: Ahli akademik yang dijemput UTM dalam perjalanan ke suatu destinasi tertentu dan universiti tidak membiayai kos perjalanan kecuali dari destinasi terhampir tempat bertugas ke UTM.\n\n##### Pemeriksa Luar ( External Examiner)\n\nTakrifan: Ahli akademik dari institusi pengajian tinggi lain yang dijemput bagi membantu dalam semakan kurikulum/ penasihatan tentang program.\n\n##### Panel Penasihat Industri (Industrial Advisory Panel)\n\nTakrifan: Wakil industri yang dijemput bagi membantu dalam semakan kurikulum/ penasihat tentang program akademik.\n\n**SYARAT PELANTIKAN:**\n\nTenaga Akademik Pelawat Akademik/ Adjung/ Jemputan yang dilantik hendaklah :\n\n1.  Mempunyai kepakaran dalam satu-satu bidang pengajian serta mempunyai pengalaman yang luas dalam bidang berkenaan serta mempunyai kelayakan yang setara dengan jawatan yang dilantik; dan\n2.  Berkebolehan dan terkemuka serta diperakui taraf akademik/ kesohorannya di peringkat kebangsaan/antarabangsa mengikut jawatan yang dilantik\n\n**TUGAS DAN TANGGUNGJAWAB:**\n\nAntara tugas Tenaga Akademik Pelawat/ Adjung/ Jemputan adalah seperti berikut:\n\n1.  Memberi nasihat dan membuat syor dari segi pembentukan kurikulum dalam bidang-bidang pengajian tertentu;\n2.  Mengkaji dan menilai mutu soalan peperiksaan dan kertas jawapan peperiksaan serta disertai pelajar serta memberi bimbingan ataupun ulasan mengenai perkara yang berkaitan;\n3.  Menyampaikan kuliah dan dialog dalam bidang kursus/kepakaran tertentu kepada staf akademik dan pelajar;\n4.  Memberi nasihat kepakaran dari segi kemudahan peralatan yang ada serta peralatan baru yang dirancang oleh fakulti;\n5.  Membantu dalam bidang penyelidikan,\n6.  Membantu fakulti untuk mendapatkan pengiktirafan daripada badan profesional untuk kursus baharu atau kursus yang belum mendapat pengiktirafan;\n7.  Menggalakkan kerjasama di antara UTM dengan badan/Universiti di mana calon itu bertugas\n\n**TEMPOH PELANTIKAN/BERTUGAS:**\n\n1.  Tempoh pelantikan minimum ialah empat (4) bulan dan maksimum satu (1) tahun\n2.  Walau bagaimanapun, pengecualian diberikan bagi kes-kes tertentu seperti staf yang dilantik bagi tujuan pengajaran atau dilantik di bawah perjanjian persefahaman (MoU) yang telah ditandatangani dengan insitusi luar, lantikan boleh dilakukan antara dua (2) hingga\n3.  lima (5) tahun.\n4.  Tempoh bertugas/ lawatan bagi tenaga akademik pelawat/ adjung/ jemputan boleh ditetapkan mengikut perancangan fakulti/sekolah/PTJ.\n\n**KAEDAH PENCALONAN/PELANTIKAN:**\n\n1.  Permohonan bagi semua pencalonan Tenaga Akademik Pelawat/ Adjung/ Jemputan perlu dibuat menggunakan Borang Permohonan Tenaga Pelawat Akademik. [Borang Permohonan Tenaga Pelawat Akademik ke UTM](https://dvcai.utm.my/wp-content/uploads/2022/06/Borang-Permohonan-Pelawat-Adjung-Baharu-2021-1.docx)\n    \n2.  Kaedah pencalonan:\n    *   Pencalonan daripada Universiti (atas keperluan universiti)\n        \n    *   Pencalonan daripada fakulti/sekolah/PTJ\n        \n    *   Permohonan dari individu (perlu melalui tapisan daripada fakulti/sekolah/PTJ berkaitan).\n        \n3.  Pelantikan Tenaga Akademik Pelawat/Adjung hendaklah diluluskan oleh:\n    *   Timbalan Naib Canselor (Akademik dan Antarabangsa) setelah mendapat perakuan daripada Dekan Fakulti/Sekolah/Ketua Jabatan Bahagian.\n        \n    *   Walau bagaimanapun, bagi kes-kes khas yang dikenalpasti oleh Universiti, kelulusan Naib Canselor diperlukan.\n        \n\n**PENILAIAN PRESTASI/ LAPORAN AKTIVITI:**\n\nPenilaian Prestasi/Laporan Aktiviti dibuat melalui penetapan KAI yang ditetapkan oleh Fakulti/Sekolah yang melantik. Penyambungan pelantikan adalah berdasarkan laporan yang disediakan oleh Fakulti/ Sekolah dan tertakluk kepada kelulusan Universiti.\n\n**NOTIS PENAMATAN:**\n\n1.  Universiti boleh pada bila-bila masa menamatkan perkhidmatan seseorang Tenaga Akademik Pelawat/ Tamu/ Jemputan dengan memberi sebulan notis secara bertulis\n2.  Tenaga Akademik Pelawat/ Tamu/ Jemputan juga boleh pada bila-bila masa berhenti dari perkhidmatan dengan memberi sebulan notis kepada Universiti.\n\n![](https://dvcai.utm.my/wp-content/uploads/2017/02/Proses-Kerja-Pelantikan.png)\n\n![](https://dvcai.utm.my/wp-content/uploads/2017/02/Carta-alir.png)"
}