{
  "markdown": "[Skip to content](https://comp.utm.my/history#content \"Skip to content\")\n\nHistory\n=======\n\n### Faculty of Computing\n\n![awan bangunan FC](https://comp.utm.my/wp-content/uploads/2023/10/awan-bangunan-FC.png \"awan bangunan FC\")\n\nThe Journey of Faculty of Computing\n\nThe history of Faculty of Computing (FC) began in 1981 when it was known as Department of Computer Science, under the wings of Faculty of Science. This department began its operation at UTM Gurney Road Kuala Lumpur where it received its first intake of Computer Science Integration Programme students. This programme integrated the programme of Diploma with Bachelor of Science (BSc) of Computer Science. In 1984, the department was established as Institute of Computer Science that consisted of Academic Unit and Administrative Computing Unit.  \n  \nIn 1991, the Institute was separated from the Administrative Computing Unit and be elevated to a faculty status knows as Faculty of Computer Science and Information Systems. The year also marked the first intake of Master of Science (MSc) and Doctor of Philosophy (PhD) of Computer Science students. The establishment of new faculty, increasing student and staff populations, and demands for facilities have resulted in a move to the UTM main campus in Skudai, Johor in 1995.\n\nAs the years go by, the faculty has seen a significant increasing number of students due to the popularity of its high quality postgraduate academic programmes. The number of postgraduate students and staff, and demands for more sophisticated facilities has resulted in additional 5-storey building in 2012 to provide a conducive environment for teaching, learning and research.\n\nIn January 2013, once again the faculty made a significant stride by rebranding the faculty’s name from Faculty of Computer and Information System to Faculty of Computing. Branding the organisational restructuring and strengthening the academic programmes as well the faculty researches will hopefully make it in line with the university vision to be recognized as a world class centre of academia and technological excellence.\n\nFaculty of Computing’s Journey\n------------------------------\n\n![](https://comp.utm.my/wp-content/uploads/2023/11/FC_s-journey.png)\n\nOur Strength\n------------\n\n### Vision\n\nTo be a recognised world-class faculty with academic and research excellence in computing technology\n\n### Mission\n\nTo develop future-oriented and industryrelevant digital talents, innovative solutions, and effective services in computing technology that will contribute to the nation’s wealth creation.\n\n### Strategic Objectives\n\n\\> Produce excellence and future-oriented talents in computing research and education.  \n  \n\\> Produce life ready graduates with premium employment and contribute professionally and ethically in society.  \n  \n\\> Enhance and strengthen flexible inclusive computing education  \n  \n\\> Championing for excellence computing research  \n  \n\\> Provide the best services and facilities to support the faculty’s strategy and desired stakeholders’ experience\n\n*   Produce excellence and future-oriented talents in computing research and education.\n*   Produce life ready graduates with premium employment and contribute professionally and ethically in society.\n*   Enhance and strengthen flexible inclusive computing education\n*   Championing for excellence computing research\n*   Provide the best services and facilities to support the faculty’s strategy and desired stakeholders’ experience\n\nHow can we help you?\n--------------------\n\nContact us at the Faculty of Computing, Administration office or submit a business inquiry online.\n\n[Contact Us](mailto:computing@utm.my)\n\nScroll to Top"
}