{
  "markdown": "Solar Electric Power Knowledge Transfer Programme Successfully Held at SK Taman Mutiara Rini 2\n==============================================================================================\n\nby [powerpic](https://fke.utm.my/author/powerpic/ \"Posts by powerpic\")\n | Feb 14, 2023 | [Faculty](https://fke.utm.my/category/faculty/)\n, [POWER](https://fke.utm.my/category/power/)\n, [Uncategorized](https://fke.utm.my/category/uncategorized/)\n\n![](https://fke.utm.my/wp-content/uploads/2023/02/Solar10-1080x675.jpg)\n\nOn 14 February 2023, the Solar Electric Power Knowledge Transfer Programme was successfully held at SK Taman Mutiara Rini 2, Johor. The programme was part of the initiatives under the grant “Iskandar Puteri Low Carbon 2.0: Solar Innovation at SK Taman Mutiara Rini 2”, led by Dr. Norazliani Md Sapari, a senior lecturer of the Faculty of Electrical Engineering, Universiti Teknologi Malaysia, and assisted by four other faculty members, namely, Dr. Zulkarnain Ahmad Noorden, Dr. Jasrul Jamani Jamian, Ir. Dr. Syed Norazizul Syed Nasir and Dr. Madihah Md Rasid.\n\nThree main agenda of knowledge transfer were delivered through the programme. First, a seminar on solar electric power was held for the teachers and primary four students. Quiz questions were also given to the students to gauge their level of understanding about the seminar. Second, an experimental session on the use of solar electric power as the source of electricity was carried out with the students. The students were impressed during the session, where they could see and feel for themselves the generation of electricity through solar electric power. This indirectly enhanced the exposure of the students to the concept of renewable power generation. Last, a knowledge transfer session was conducted for the teachers on the installed solar systems at the school in ensuring sustainable operation and maintenance of the installed solar systems. The solar systems installed at the school were located at the guard house, the outdoor corridor and the assembly area.\n\nVarious scenes captured during the programme are shown as follows.\n\n![](https://fke.utm.my/wp-content/uploads/2023/02/Solar8-226x300.jpg) ![](https://fke.utm.my/wp-content/uploads/2023/02/Solar9-300x225.jpg) ![](https://fke.utm.my/wp-content/uploads/2023/02/Solar10-300x225.jpg) ![](https://fke.utm.my/wp-content/uploads/2023/02/Solar11-300x225.jpg) ![](https://fke.utm.my/wp-content/uploads/2023/02/Solar12-300x225.jpg) ![](https://fke.utm.my/wp-content/uploads/2023/02/Solar13-300x225.jpg) ![](https://fke.utm.my/wp-content/uploads/2023/02/Solar14-300x225.jpg) ![](https://fke.utm.my/wp-content/uploads/2023/02/Solar15-300x225.jpg) ![](https://fke.utm.my/wp-content/uploads/2023/02/Solar16-300x226.jpg) ![](https://fke.utm.my/wp-content/uploads/2023/02/Solar17-1-300x225.jpg) ![](https://fke.utm.my/wp-content/uploads/2023/02/Solar18-300x226.jpg) ![](https://fke.utm.my/wp-content/uploads/2023/02/Solar19-300x168.jpg) ![](https://fke.utm.my/wp-content/uploads/2023/02/Solar1-226x300.jpg) ![](https://fke.utm.my/wp-content/uploads/2023/02/Solar2-300x225.jpg) ![](https://fke.utm.my/wp-content/uploads/2023/02/Solar3-225x300.jpg) ![](https://fke.utm.my/wp-content/uploads/2023/02/Solar4-300x225.jpg) ![](https://fke.utm.my/wp-content/uploads/2023/02/Solar5-225x300.jpg) ![](https://fke.utm.my/wp-content/uploads/2023/02/Solar6-225x300.jpg) ![](https://fke.utm.my/wp-content/uploads/2023/02/Solar7-300x225.jpg)\n\nPrepared by Dr. Norazliani Md Sapari, Universiti Teknologi Malaysia  \nTranslated by Assoc. Prof. Eur. Ing. Ir. Ts. Dr. Lau Kwan Yiew, Universiti Teknologi Malaysia\n\nOriginal Text in Malay  \nPada 14/2/2023, satu Program Pemindahan Ilmu Tenaga Elektrik Solar di SK Taman Mutiara Rini 2, Johor telah diadakan. Program ini merupakan salah satu objektif bagi menjayakan geran di bawah tajaan Iskandar Puteri Rendah Karbon 2.0: Inovasi Solar di SK Taman Mutiara Rini 2, yang diketuai oleh Dr. Norazliani Md Sapari, bersama 4 pensyarah iaitu Dr. Zulkarnain Ahmad Noorden, Dr. Jasrul Jamani Jamian, Ir. Dr. Syed Norazizul Syed Nasir dan Dr. Madihah Md Rasid.  \nTiga komponen utama proses pemindahan ilmu telah dijalankan melalui program ini, iaitu:  \ni) Ceramah mengenai ilmu penggunaan tenaga elektrik solar kepada para guru dan murid tahun 4. Soalan kuiz juga diberikan bagi mengukur tahap penerimaan para pelajar bagi ilmu yang disampaikan.  \nii) Sesi eksperimen mengenai penggunaan tenaga solar sebagai sumber tenaga elektrik. Pelajar sangat teruja, di mana mereka boleh sentuh, pegang dan melihat sendiri kesan dan faktor penghasilan elektrik. Secara tak langsung, pendedahan mengenai penggunaan sumber tenaga baharu dapat dipertingkatkan.  \niii) Pemindahan ilmu kepada para guru mengenai sistem solar yang telah dipasang di mana ia amat penting bagi memastikan kelestarian sistem solar yang telah dibangunkan dari geran ini. Tiga kawasan utama pemasangan solar di sekolah tersebut adalah di pondok pengawal, susur gajah luar dan kawasan tapak perhimpunan.\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/solar-electric-power-knowledge-transfer-programme-successfully-held-at-sk-taman-mutiara-rini-2#)"
}