{
  "markdown": "FKE Publication Webinar – Assoc. Prof. Dr. Waleed Ejaz\n======================================================\n\nby [postgraduatepic](https://fke.utm.my/author/postgraduatepic/ \"Posts by postgraduatepic\")\n | Jul 10, 2024 | [Anouncement](https://fke.utm.my/category/anouncement/)\n, [FKESeminarSeries](https://fke.utm.my/category/fkeseminarseries/)\n, [Postgraduate-info](https://fke.utm.my/category/postgraduate-info/)\n\n![](https://fke.utm.my/wp-content/uploads/2024/07/fkeseminar11july-resized.jpg)\n\nAssalamualaikum dan Selamat Sejahtera,\n\nAll academic staff and students are cordially invited to attend a publication webinar organized by the Telecommunication Software & Systems (TeSS) Research Group and the FKE Seminar Committee, which is scheduled as follows:\n\nSpeaker: Assoc. Prof. Dr. Waleed Ejaz  \nAffiliation: Department of Electrical Engineering, Lakehead University  \nTitle: Navigating the Landscape of Review Papers: Insights and Opportunities  \nDate: 11 July 2024 (Thursday)  \nTime: 10 AM – 12 Noon  \nModerator: Assoc. Prof. Dr. Rozeha A. Rashid  \nOnline Platform: Webex  \nLink: [https://utm.webex.com/utm/j.php?MTID=m1aa0c90b868334dcc57faafd7197f698](https://utm.webex.com/utm/j.php?MTID=m1aa0c90b868334dcc57faafd7197f698)\n  \nMeeting number: 2519 848 7529  \nPassword: ZEwPmzGd262\n\nWebinar Synopsis:  \nThis talk will offer a strategic approach to navigating the landscape of review and magazine papers published in esteemed IEEE and Elsevier journals that do not charge Article Processing Charges (APCs). The talk will provide valuable insights into identifying suitable journals, understanding the review process, and maximizing the impact of scholarly contributions.\n\nKey Topics:\n\n*   Identifying Target Journals: Learn how to select relevant IEEE and Elsevier journals based on your research area and objectives.\n*   Understanding the Review Process: Gain insights into the peer-review process for review and magazine papers, including the expectations of reviewers and editors.\n*   Crafting Compelling Review Articles: Discover strategies for structuring and writing impactful review papers that synthesize existing research and identify future directions.\n*   Leveraging Magazine Papers: Explore the unique opportunities magazine papers offer for disseminating research findings to a broader audience.\n*   Navigating the APC-Free Landscape: Understand the advantages and considerations of publishing in journals without APCs, particularly in the context of IEEE and Elsevier.\n\nThe talk will conclude with a Q&A session, allowing participants to discuss and seek clarification on specific aspects of the review and magazine paper publication process. This talk aims to empower researchers to make informed decisions and effectively navigate the landscape of scholarly publication in IEEE and Elsevier journals, maximizing the reach and impact of their research contributions.\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/fke-publication-webinar-assoc-prof-dr-waleed-ejaz#)"
}