{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/majlis-perasmian-galeri-kalam-oleh-dekan-fakulti-alam-bina-dan-ukur#)\n    \n*   [Instagram](https://builtsurvey.utm.my/majlis-perasmian-galeri-kalam-oleh-dekan-fakulti-alam-bina-dan-ukur#)\n    \n*   [RSS](https://builtsurvey.utm.my/majlis-perasmian-galeri-kalam-oleh-dekan-fakulti-alam-bina-dan-ukur#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/majlis-perasmian-galeri-kalam-oleh-dekan-fakulti-alam-bina-dan-ukur#)\n    \n*   [Instagram](https://builtsurvey.utm.my/majlis-perasmian-galeri-kalam-oleh-dekan-fakulti-alam-bina-dan-ukur#)\n    \n*   [RSS](https://builtsurvey.utm.my/majlis-perasmian-galeri-kalam-oleh-dekan-fakulti-alam-bina-dan-ukur#)\n    \n\nMajlis Perasmian Galeri KALAM oleh Dekan Fakulti Alam Bina dan Ukur\n===================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Jul 23, 2020 | [event](https://builtsurvey.utm.my/category/event/)\n, [News](https://builtsurvey.utm.my/category/news/)\n, [photo](https://builtsurvey.utm.my/category/photo/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2020/07/115798856_3455679687810746_4857425011346942343_o-1080x675.jpg)\n\nSebuah galeri yang mengandungi pelbagai bahan pameran dan kajian mengenai alam bina dunia melayu telah dirasmikan di Pusat Kajian Alam Bina Dunia Melayu (KALAM), Fakulti Alam Bina dan Ukur (FABU), Universiti Teknologi Malaysia (UTM).\n\nGaleri yang bakal menjadi pusat rujukan mengenai Alam Bina Melayu Nusantara itu telah dirasmikan oleh Dekan kepada fakulti tersebut, Prof. Sr. Dr. Hishamuddin Mohd Ali.\n\nPengarah KALAM, Ar. Noraslinda Abdul Rahman berkata khazanah di pusat ini telah didokumentasikan sejak tahun 1975 dan selain menjalankan aktiviti penyelidikan berkaitan seni bina tradisional melayu, pusat ini juga menyediakan perkhidmatan professional, penerbitan, jaringan industri, perundingan serta menganjurkan kursus,seminar, persidangan dan lain-lain perkhidmatan yang memacu pembangunan masyarakat dan negara.\n\n“Galeri KALAM menempatkan khazanah warisan negara yang sangat unik dan harus dipelihara. Ruangan pamerannya mempamerkan karya seni bina untuk dihayati oleh masyarakat tempatan dan luar negara.”\n\n“Selain menjadi medium pendidikan untuk memperkenalkan warisan negara kepada generasi muda, galeri ini juga mampu memberikan inspirasi kepada pengunjung agar dapat menanam sifat cintakan warisan dan budaya Malaysia,” katanya.\n\nGaleri ini juga mampu menjadi medan sosial seni yang berfungsi sebagai jambatan penghubung untuk mempertemukan masyarakat dari pelbagai lapisan bagi membincangkan kepelbagaian budaya, gagasan, gaya hidup, ideologi dan sebagainya.\n\nMajlis turut dimeriahkan dengan penyerahan replika cek kepada Dekan FABU oleh wakil Pengarah Institut Infrastruktur Pintar dan Pembangunan Inovatif (ISIIC), Prof. Madya Dr. Abdul Rahman Mohd Sam dan Pengarah Senibina, Prof. Madya Dr. Alice Sabrina Ismail sebagai simbolik menghargai kerjasama di antara mereka. Turut hadir adalah mantan Pengarah KALAM, Prof. Madya Dr. Raja Nafida Raja Shahminan.\n\n[**more photos click here..**](https://builtsurvey.utm.my/photos/2020/07/majlis-perasmian-galeri-kalam-oleh-dekan-fakulti-alam-bina-dan-ukur/)"
}