{
  "markdown": "KL +[603-2180 5023](tel:+60321805023)\n/[5025](tel:+60321805025)\n [ahibs@utm.my](mailto:ahibs@utm.my)\n\nEEP\n===\n\n#### Executive Education Programme\n\nEquipping managers with essential skills in business acumen, strategic thinking, and leadership, our programme addresses today’s business challenges. We offer short courses in key business areas, incorporating global trends and insights from academic experts and industry leaders. Our executive programmes include the Advanced Management Programme (AMP) and Advanced Leadership Programme (ALP) for senior managers. Flexible delivery modes allow participants to tailor courses to their needs.\n\n\n\n#### Duration\n\n1-day seminar\n\n3-day workshop\n\n8-week ALP, AMP\n\ni\n\n#### Entry Requirement\n\n*   Industry experience\n*   Fluency in English\n\n\n\n#### Class Mode : Face to Face\n\nClasses will be held at Azman Hashim International Business School premises.\n\n\n\nClients can choose from our courses for tailored content. We offer a customized EEP for a minimum of 15 participants.\n\nCourses offered\n---------------\n\n### Accounting and Finance for Decision Making\n\nThis course teaches participants accounting and financial principles and utilize these skills to be a better leader. Strengthen decision making process and gain a better understanding of finances and budgeting to make confident decisions in organization.\n\n### Advanced Decision Science and Data Analytics\n\nThis course helps participants develop a data mind-set and analytical skills to interpret and communicate data to develop future growth strategies. It also explores the use of data to manage day-to-day operations of a business.\n\n### Emerging Technological Applications in Business\n\nIn this course, participants will join faculty members and industry experts to discuss how emerging technology has changed the business landscape. It explores the potential of emerging technologies such as artificial intelligence, block chain, and the Internet of Things, and their applications in various industries.\n\n### Strategic Human Resource Management\n\nThe course focuses on aligning HR practices with organizational goals. It involves planning, implementing, and managing human resource strategies to enhance overall business performance. It integrates human resource functions with strategic objectives, ensuring a proactive and forward-thinking approach to human capital management.\n\n### Business Economics and Policy\n\nThe course is for participants that are interested in the role of economics in business, competition and public policy. The main objective of this module is to provide comprehensive coverage of business economics and policies within the micro-macroeconomics theories and application to business decision-making.\n\n### Global Innovation and Entrepreneurship\n\nThis course introduces participants to the entrepreneurial journey, from conception of business idea, to gaining a presence in the marketplace, as well as managing the finances. It explains how entrepreneurs validate ideas and refine business strategy providing students with the understanding of how businesses are built.\n\n### Islamic banking and finance\n\nThe course is designed to provide participants with an understanding of the principles and practices of Islamic banking and finance. Islamic banking is based on the principles of Shariah law, which prohibits the charging or payment of interest and emphasizes ethical and socially responsible business practices.\n\n### Design Thinking\n\nThis course trains participants how to approach complex problems with a creative and user-centered mindset. They will learn the principles and methods of design thinking, which involve understanding user needs, prototyping solutions, and testing ideas through rapid iteration.\n\n### Marketing Innovation\n\nThis course aims at critical evaluation of the contemporary concepts and tools for effectively marketing an innovation, particularly relating to High Tech innovations. It integrates product innovations with business model innovations as well as new innovations in marketing approaches.\n\n### People Leadership\n\nThe course is designed to equip participants with skills and knowledge to lead organisations in today’s complex business environment. Participants will learn how to develop a clear vision and strategy for their organisation, build high performing teams, navigate change and uncertainty, and foster a culture of innovation and continuous improvement.\n\n### Strategic Management\n\nIn this course, participants are given strategy concepts for knowledge and applications both at the organizational and the strategic business unit levels. The development of strategic thinking permits participants to approach complex organizational scenarios and opportunities from a larger perspective, particularly in the context of globalization of businesses, and with regard to business operational strategies as they relate to the overall corporate strategies of the organization.\n\nContact Us\n----------\n\n### For EEP programme\n\nName:  AHIBS Executive Education  \nEmail : execedu.ahibs@utm.my\n\nMore on AHIBS\n=============\n\n[View our postgraduate courses](https://business.utm.my/ahibs-postgraduate/)\n\nShare via:\n\n*   [Facebook](https://business.utm.my/executive-education#)\n    \n*   [Twitter](https://business.utm.my/executive-education#)\n    \n*   [LinkedIn](https://business.utm.my/executive-education#)\n    \n*   [More](https://business.utm.my/executive-education#)\n    \n\n \n\nShare via[](https://business.utm.my/executive-education#)\n\n[Facebook](https://business.utm.my/executive-education#)\n\n[X (Twitter)](https://business.utm.my/executive-education#)\n\n[LinkedIn](https://business.utm.my/executive-education#)\n\n[Mix](https://business.utm.my/executive-education#)\n\n[Email](https://business.utm.my/executive-education#)\n\n[Print](https://business.utm.my/executive-education#)\n\n[Copy Link](https://business.utm.my/executive-education#)\n\nPowered by [Social Snap](https://socialsnap.com/?utm_source=WordPress&utm_medium=link&utm_campaign=inthewild)\n\nCopy link[](https://business.utm.my/executive-education#)\n\n [CopyCopied](https://business.utm.my/executive-education#)\n\nPowered by [Social Snap](https://socialsnap.com/?utm_source=WordPress&utm_medium=link&utm_campaign=inthewild)"
}