{
  "markdown": "Research Laboratory Visit – Shibaura Institute of Technology\n============================================================\n\nby [lcrgpic](https://fke.utm.my/author/lcrgpic/ \"Posts by lcrgpic\")\n | Jul 16, 2023 | [COMM](https://fke.utm.my/category/comm/)\n, [LCRG](https://fke.utm.my/category/lcrg/)\n\n![](https://fke.utm.my/wp-content/uploads/2023/07/LCRG-SIT_2-Visit-230228-1080x675.png)\n\nOn February 28, 2023, two researchers from LCRG, Dr Nur Najahatul Huda Binti Saris and Dr Nurul Ashikin Binti Daud, had the opportunity to visit an overseas research laboratory at Shibaura Institute of Technology (SIT), Japan. This visit was under the supervision of Professor Yokoi Hideki, an expert in the field of optical waveguide.\n\n![](https://fke.utm.my/wp-content/uploads/2023/07/LCRG-SIT_3-Visit-230228-1024x620.png)\n\nThey were introduced to some interesting and innovative research results related to optical waveguide technology, such as:\n\n*   Optical nonreciprocal devices in the form of waveguides. These devices allow light to flow in only one direction, without being affected by magnetic field or light polarization. These devices have potential applications in optical communication systems, optical sensors and optical processing.\n*   Coupling/branching devices in the form of waveguides for wavelength division multiplexing (WDM). These devices allow light from different wavelengths to be combined or separated in one waveguide. These devices have advantages such as small size, low light loss and temperature resistance. These devices can improve the capacity and efficiency of optical transmission systems.\n*   Amplifiers in the form of waveguides. These amplifiers use active materials such as erbium or ytterbium to increase the intensity of light passing through the waveguide. These amplifiers have advantages such as stability, accuracy and compatibility with various wavelengths. These amplifiers can reduce light loss and interference in optical communication systems.\n\n![](https://fke.utm.my/wp-content/uploads/2023/07/LCRG-SIT_1-Visit-230228-1024x622.png)\n\nThis visit has provided a lot of useful knowledge and experience in their research field. They also hope to establish cooperation with Professor Yokoi Hideki and his team in the future.\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/research-laboratory-visit-shibaura-institute-of-technology#)"
}