{
  "markdown": "FLEX – UTM ENGAGEMENT\n=====================\n\nby [fydamohd](https://fke.utm.my/author/fydamohd/ \"Posts by fydamohd\")\n | Dec 24, 2024 | [Anouncement](https://fke.utm.my/category/anouncement/)\n, [CMED](https://fke.utm.my/category/cmed/)\n, [Faculty](https://fke.utm.my/category/faculty/)\n\n![](https://fke.utm.my/wp-content/uploads/2024/12/WhatsApp-Image-2024-12-24-at-3.19.00-PM.jpeg)\n\n**Flex-UTM Engagement: Celebrating FKE Industrial Partner**\n\n**Johor Baharu, 24 December 2024 –** A joyous occasion, celebrating a year-long relationship between Flex PTP and the [Faculty of Electrical Engineering](https://fke.utm.my/)\n, [Universiti Teknologi Malaysia](https://www.utm.my/)\n, Skudai, Johor. Attended by 15 delegates from Flex and 15 UTM staff members,on this event, the appointment of Mr Lim Lian Chong, the General Manager of [Flex PTP & Flex Skudai](https://flex.com/)\n, was extended for another year, until October 2025. The Flex-UTM Engagement event, held in Hyatt Place, Skudai, Johor, was to recognise Flex’s active collaboration with  UTM during the adjunct appointment, at the same time acknowledging Mr Lim’s appointment for another year.\n\n![](https://fke.utm.my/wp-content/uploads/2024/12/WhatsApp-Image-2024-12-24-at-3.19.03-PM.jpeg)\n\nThe event started with a welcoming speech by the Head of Department for Control and Mechatronics Engineering Department, from the Faculty of Electrical Engineering, Prof. Ir. Dr. Hazlina binti Selamat. Prof Hazlina highlighted that the event is a significant occasion which celebrates the fruitful collaboration between UTM and Flex, just within the last 12 months of Mr Lim’s adjunct Professor’s appointment. Throughout this period, numerous programs were conducted which involved the staff and the students of the faculty. Among the programs are MoU Exchange Ceremony in Flex on 5th December 2023, Flex participation as sponsor and industrial panels in the faculty [Electrical Engineering Capstone Showcase](https://eecs.fke.utm.my/)\n 2023 on 15th Jan 2024, upskilling program to Assistant Engineers from Faculty of Electrical Engineering on 19th – 20th March 2024, Flex visit to UTM on 22nd April 2024, Collaboration with UTM [Campus Sustainability](https://sustainable.utm.my/)\n (UTMCS) on Corporate Social Responsibilities and Sustainability programs, numerous visits by the students of Faculty of Electrical Engineering to Flex PTP and of course the [inaugural lecture by Mr Lim](https://fke.utm.my/adjunct-professor-lecture-series-mr-lim-lian-chong/)\n on 22nd October 2024. Prof Hazlina’s speech was perfectly complemented by two video compilations on these collaborations, prepared by Flex. \n\nProf Syed Abd Rahman bin Syed Abu Bakar, the Deputy Dean of Research, Innovation and Development for the Faculty of Electrical Engineering, then took the centre stage to highlight the future collaborations planned between UTM and Flex PTP. The nearest event is [EECS](https://eecs.fke.utm.my/)\n 2025 on 13th January 2025, with Flex PTP being the sponsor (again) and the industrial panels (again). The only difference is that, this year, four of the problems solved by the students’ groups come from Flex itself. Another program aligned is a second series for the inaugural lecture by Mr Lim, seeing how successful it was the first time. Another major program is a recycling drive involving the community, and last but not least, a well-being program, with the involvement of Flex’s psychologist in addressing mental health issues among staff and students both in Flex and UTM. Other additional programs include more industrial visits from the students to Flex PTP, a continuation in Final Year Projects and Capstone Projects, and a co-teach session by Flex engineers in one of the chapters in a selected course from the faculty. Hopefully every single program will be executed smoothly and successfully.\n\nAfter presenting Mr Lim with a certificate of re-appointment as adjunct professor and certificate of recognition for Flex’s active collaboration with UTM, came the final highlight of the event, a speech by Mr Lim Lian Chong. He mentioned that the Flex-UTM relationship was initiated since the Conference on [Artificial Intelligence and Robotics for Industry 4.0 2023](https://www.bharian.com.my/berita/nasional/2023/07/1127698/teknologi-ai-robotik-mampu-bantu-tingkat-ekonomi-negara)\n (AIR 2023), co-organised by [Centre for Artificial Intelligence and Robotics](https://research.utm.my/cairo)\n (CAIRO) UTM. AIR 2023 showcased a close collaboration between academia and the industry, empowered by the Chair of AIR 2023, Dr Yeong Che Fai a member of CAIRO UTM, as well as the co-founder of [DF Automation Sdn Bhd](https://www.dfautomation.com/)\n. Mr Lim then delivered a bouquet of flowers as well as a special gift to Dr Yeong, as a symbol of his gratitude towards Dr Yeong’s efforts in truly closing the gap between the industry and academia. Mr Lim also extended his gratitude to the Faculty of Electrical Engineering, symbolized by a bouquet of flowers, this time presented to Prof Syed. Mr Lim has high hopes for the collaboration, and hopes that the collaboration extends beyond the Adjunct Professor appointment.\n\n![](https://fke.utm.my/wp-content/uploads/2024/12/WhatsApp-Image-2024-12-24-at-3.19.00-PM-2.jpeg)\n\n![](https://fke.utm.my/wp-content/uploads/2024/12/WhatsApp-Image-2024-12-24-at-3.18.57-PM.jpeg)\n\n![](https://fke.utm.my/wp-content/uploads/2024/12/WhatsApp-Image-2024-12-24-at-3.19.00-PM-1.jpeg)\n\nThe event was finalised by a group photo session between the Flex delegates and UTM staff, before proceeding to the high-tea in Hyatt Place. A remarkable event, a significant milestone, and a truly cherished partnership, enriched by mutual contributions. Both Flex and UTM are looking forward to the programs planned. Hopefully, this collaboration extends beyond the Adjunct Professor appointment, bringing benefits to everyone around. All the best Flex PTP and Faculty of Electrical Engineering!\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/flex-utm-engagement#)"
}