{
  "markdown": "[Skip to content](https://fai.utm.my/faculty#content \"Skip to content\")\n\nAbout Faculty​\n==============\n\nHistory\n\nFaculty of Artificial Intelligence\n----------------------------------\n\n![](https://fai.utm.my/wp-content/uploads/2024/06/history_timeline03.png \"history_timeline03\")\n\nThe Razak Faculty of Technology and Informatics (FTIR) was established on 1 July 2018 in line with the implementation of the restructuring of academic entities for the sustainability of the university’s thrust through the UTM Sinergi 4.0 Project. FTIR consists of a combination of three (3) academic entities namely UTM Razak School (UTM Razak School of Engineering and Advanced Technology), UTM AIS (Advanced Informatics School) and UTM Perdana School (Perdana School of Science, Technology and Innovation Policy).  \n  \nAlong with the rapid development of artificial intelligence (AI) in the world, Malaysia has taken proactive steps to establish the country’s first Artificial Intelligence Study Center to empower the people’s economy. “Innovation and digital talent need to be empowered, especially in the field of AI to improve the country’s more sustainable economy”, quotes from the Prime Minister of Malaysia during the presentation of Budget 2024 in the Dewan Rakyat on 13 October 2023 – (reference source: _sinarharian.com.my_). In line with that, several public universities including Universiti Teknologi Malaysia (UTM) have submitted concept papers related to the establishment of a national artificial intelligence study center. After passing the screening process, on 13 October 2023 the Prime Minister of Malaysia – YAB Dato’ Seri Anwar bin Ibrahim has announced that UTM has been selected as a public university that will realize the nation’s wishes. The announcement was made during the presentation of the Malaysia MADANI Budget 2024 themed MADANI Economy: Empowering the People.  \n  \nFollowing the announcement, UTM through the Office of the Deputy Vice-Chancellor (Academic and International) has taken steps by holding the first phase AI Faculty Establishment Workshop on 17 to 18 October 2023. Through this workshop, UTM has agreed to establish the implementation process of re-purposing Razak Faculty of Technology and Informatics as the Faculty of Artificial Intelligence (FAI) starting on 31 October 2023 and is expected to complete its establishment in February 2024.  \n  \nThe establishment of FAI is based on the needs of the country where Malaysia needs to move quickly to lead the field of future propulsion. This is in line with the explosion of global digital transformation across various industrial disciplines that will open space for problem-solving innovation in the fields of manufacturing, finance, health, agriculture, renewable energy, security, economy and public services. Also related to the country’s aspirations for the development of highly competent human capital in the field of artificial intelligence, FAI will also intensify international cooperation to ensure the sustainability and safety of the use of artificial intelligence technology in Malaysia to have a positive impact on society as a whole.\n\n#### Vision\n\nA world-class artificial intelligence faculty in transdisciplinary education, research and innovation.\n\n#### Mission\n\nTo develop future oriented, industry-focused, and humanity-centered artificial intelligence talent in providing innovative solutions for societal well-being.\n\n#### **Strategic Objectives**\n\n[](https://fai.utm.my/faculty#)\n![](https://fai.utm.my/wp-content/uploads/2024/05/fast-forward_4662135.png)To produce talent through innovative artificial intelligence education.\n\n[](https://fai.utm.my/faculty#)\n![](https://fai.utm.my/wp-content/uploads/2024/05/fast-forward_4662135.png)To provide innovative solution through transdisciplinary research.\n\n[](https://fai.utm.my/faculty#)\n![](https://fai.utm.my/wp-content/uploads/2024/05/fast-forward_4662135.png)To support the industries in attaining high gains and high value in business.\n\n[](https://fai.utm.my/faculty#)\n![](https://fai.utm.my/wp-content/uploads/2024/05/fast-forward_4662135.png)To leverage humanity-centered artificial intelligence towards balance economic advancement for societal well-being.\n\nPiagam Pelanggan\n\nFakulti Kecerdasan Buatan\n-------------------------\n\n##### Pelajar kami akan memperolehi\n\nKelulusan akademik yang diiktiraf oleh kerajaan dan badan professional serta menepati keperluan industri dan masyarakat.\n\nPengijazahan dalam tempoh yang ditetapkan setelah memenuhi semua syarat.\n\nPerkhidmatan yang menyokong pengajaran dan pembelajaran dalam persekitaran kondusif.\n\n##### Kerajaan akan memperolehi\n\nModal insan terlatih dan hasil penyelidikan berasaskan teknologi selaras dengan wawasan negara.\n\nKomitmen fakulti dalam memelihara kelestarian dan kesejahteraan sejagat.\n\n##### Industri akan memperolehi\n\nGraduan yang menguasai dan berdaya sain dalam bidang sains dan teknologi.\n\nPenyelesaian professional dan efektif melalui aktiviti penyelidikan dan perundingan.\n\n##### Kepuasan Pelanggan\n\nPerkhidamatan yang cekap dan berkualiti diberikan oleh fakulti bagi memenuhi keperluan dan kepuasan pelanggan.\n\n[](https://www.instagram.com/utmfai/)\n[](https://www.facebook.com/utmfai)\n[](https://www.youtube.com/@utmfai)\n[](https://www.tiktok.com/@utm_fai)\n\n[](javascript:void(0);)"
}