{
  "markdown": "Frequently Asked Questions\n\n[Admission UTM](https://admission.utm.my/)\n\nGeneral\n\n##### Where is Universiti Teknologi Malaysia (UTM) situated?\n\nUTM have 2 campus in  Johor Bahru & Kuala Lumpur. The main campus is in Johor Bahru (the southern most state of Malaysia) and about 300 km south of Kuala Lumpur.  UTM Kuala Lumpur Campus is located in centered of Kuala Lumpur City (5km from KLCC). Both campus  conveniently accessible by all forms of ground and air transportation.\n\n##### What is the method of application?\n\nOur method of application is through [online](https://smart.utm.my/admission/Login.aspx)\n application.\n\n##### How many semester / intake does UTM have?\n\nTwo (2) semester / intake in a year. (February and September)\n\n##### If my application is been rejected, how do I know the reason of the rejection?\n\n If your application is rejected and want to know the reason, kindly email to [pgrad@utm.my](mailto:pgrad@utm.my)\n (postgraduate) or [ugrad@utm.my](mailto:ugrad@utm.my)\n (undergradute)\\_\n\n##### What level is postgraduate and undergraduate?\n\n|     |     |\n| --- | --- |\n| Undergraduate | Bachelor degree |\n| Postgraduate | Master/PhD/Doctorate |\n\n##### If I cannot make full payment, can I make payment half of the full registration fees?\n\n|     |     |\n| --- | --- |\n| **Local students** | Please refer to financial department “_Bendahari UTM_” through their email at bendahari-ukp@utm.my |\n| **International students** | **CANNOT**. You need to make full payment of registration fee. |\n\n##### May I appeal my unsuccessful application?\n\nYes. You may appeal your application by sending an email to [pgrad@utm.my](mailto:pgrad@utm.my)\n or [ugrad@utm.my](mailto:ugrad@utm.my)\n with complete justifications and attachments. \n\nUndergraduate\n\n##### What is the Offered Programmes in UTM?\n\n|     |     |\n| --- | --- |\n| **Local students** | Please visit and go through the website at [https://admission.utm.my/offered-allcourses-malaysian/](https://admission.utm.my/offered-allcourses-malaysian/) |\n| **International students** | Please visit and go through the website at [https://admission.utm.my/offered-allcourses-international/](https://admission.utm.my/offered-allcourses-international/) |\n\n##### What is the Entry and English Language Requirements and how many is the tuition fees?\n\nYou can get all the informations in our website at [admission.utm.my](https://admission.utm.my/)\n.\n\n##### Can I be Exempted from English Requirements?\n\n|     |     |\n| --- | --- |\n| **Local students** | No, you **CANNOT** be exempted from English requirements. |\n| **International students** | English requirements exemptions only given to:<br><br>1.  1.  1.  1.  1.  A-level, International School (American Curricular) and International Baccalaureate<br>                2.  Candidate you had completed/graduated their High School from the exempted countries. Please visit and go through this website to check the exempted countries [https://admission.utm.my/english-language-requirements-3/](https://admission.utm.my/english-language-requirements-3/) |\n\n##### How many is the fees application?\n\n|     |     |\n| --- | --- |\n| **Local students** | **February Intake**: RM30 and please pay only by using mentioned method in the application system. Payment by CDM is not accepted.<br><br>**September Intake**: Purchase unique number ID (UPU pin number) at BSN counter. |\n| **International students** | RM450 and please pay only by using mentioned method in the application systems. |\n\n##### How to pay the tuition fees?\n\n|     |     |\n| --- | --- |\n| **Local students** | The tuition fees can be pay by using **one of this method**:<br><br>1.  Bill Presentment (Any Bank Islam Sdn. Bhd. branches)<br>2.  Internet Banking _**CimbClicks**_<br>3.  If you have sponsor, please send the sponsorship letter by fax at 07-5530073 or email to bendahari-ukp@utm.my |\n| **International students** | The tuition fees can be pay by using **one of this method**:<br><br>1.  UTM Payment Portal – [https://ecommerce.utm.my](https://ecommerce.utm.my/)<br>    <br>2.  Telegraphic Transfer (TT)<br>3.  **_CimbClicks_** Internet Banking<br><br>#Please refer to Annex IV for payment methods |\n\n##### Does UTM prepares any financial assistance to new students?\n\n|     |     |\n| --- | --- |\n| **Local students** | UTM does not offer any financial aid to students. Students are recommended to apply to any form of scholarships from federal government, state government, statutory body for financial aid through any advertisments and websites. Student Welfare office also will exhibit any scholarships offers from time to time for students information. |\n| **International students** | UTM does not offer any financial aid for students. |\n\n##### What is the application methods?\n\n|     |     |\n| --- | --- |\n| **Local students** | **September/October Intake**<br><br>**STPM/Matrikulasi/Asasi/Diploma/Equivalent graduates**<br><br>Application through UPU Online at [http://upu.moe.gov.my.](https://upu.mohe.gov.my/)<br><br>**Feeder Diploma UTM/ Lepasan Asasi Sains UTM dan Asasi Sains UTM-MARA**<br><br>Entry application through [smart.utm.my.](https://smart.utm.my/admission/)<br><br>**February Intake**<br><br>Entry application through [smart.utm.my](https://smart.utm.my/admission/) (programmes offered depends on the Faculty/School). |\n| **International students** | **September Intake**<br><br>Entry application through [smart.utm.my.](https://smart.utm.my/admission/)<br><br>**February Intake**<br><br>Entry application through [smart.utm.my](https://smart.utm.my/admission/) (programmes offered depends on the Faculty/School). |\n\n##### How long will I get my Offer letter after submitting my application?\n\n|     |     |\n| --- | --- |\n| **Local students** | Application announcement is estimate on first/second week September for September/October Intake and first week of February for February/Mac Intake. |\n| **International students** | Your application will be processed within 1 day working time if completed. You will get the Offer Letter after all evaluations are done. |\n\n##### How can I check my application status?\n\n|     |     |\n| --- | --- |\n| **Local students** | **September/October Intake**<br><br>You may check your application result through [http://jpt.utm.my](http://jpt.utm.my/)<br><br>**February Intake**<br><br>You may check your application status at [smart.utm.my](https://smart.utm.my/admission/) |\n| **International students** | You may check your application status at [smart.utm.my](https://smart.utm.my/admission/) |\n\n##### Can I make an application even if I haven't finish my study yet?\n\n|     |     |\n| --- | --- |\n| **Local students** | You can however your application will not be consider after closing application date. You may update your updated graduation date and upload necessary documents during appeal application to be need considered. |\n| **International students** | You can. Students who in their last semester of study may apply with their  latest transcript copy. Students need to upload the result at least on 30th July for September/October semester and 31st December for February/March semester. The application will be processed to the next semester if students are late to the closing date of application. |\n\n##### Can I apply without IELTS/TOEFL/MUET certificate?\n\n|     |     |\n| --- | --- |\n| **Local students** | CANNOT |\n| **International students** | It is compulsory to attend Intensive English Programme under Language academy and get IELTS at least Band 5.5 or attend to Certified Intensive English Program under CIEP and pass level 108 if you do not fulfilled the English Requirements. You’re given maximum of 2 semester to fulfilled the English requirements. |\n\n##### Can I reapply to UTM after failing and terminated my study in UTM?\n\n|     |     |\n| --- | --- |\n| **Local students** | CANNOT |\n| **International students** | You can reapply however it is advise to you to apply for another programmes. |\n\n##### Can I apply through UPU Online if I'm a Red Identification Card (ID) holder?\n\nYou need to apply through [smart.utm.my](https://smart.utm.my/admission/)\n.\n\n##### I'm a foundation graduate from UTM SPACE, can I apply for Perdana Programme UTM?\n\nYes, you can apply to the Perdana Program if you pass the requirements.\n\n##### What should I do after getting an Offer Letter from UTM?\n\n|     |     |\n| --- | --- |\n| **Local students** | It is **COMPULSORY** for you to state if you’re accepting the offer or not before expiration date.<br><br>If you have accepted the offer, then you may proceed by completing the e-daftar as mentioned below:<br><br>a) Make payment for the tuition and hostel fees.<br><br>b) Update the information as stated in e-daftar menu:<br><br>i) Update tuition fee payment information.<br><br>ii) Fill in Diseases and Family information.<br><br>iii) Upload your photo for Matric Card preparation.<br><br>iv) Fill in account bank information. |\n| **International students** | It is **COMPULSORY** for you to state if you’re accepting the offer or not before expiration date.<br><br>If you have accepted the offer, the you may proceed to the next step:<br><br>a) Make VAL application. (Refer to Annex III)<br><br>b) Make fees payment before registration date. (Refer Annex IV) |\n\n##### Why do I need to attend \"Bridging programme\"?\n\nAll international students are required to attend and Pass the “_Bridging Programme_” The maximum duration for this programme is 2 semester. A-level, International High School (American Curricular) and Nusantara (Indonesia, Brunei, Singapore and fluent Bahasa Melayu South Thailand) are exempted from attending “_Bridging Programme_“.\n\n##### Why I don't see display options of my interested program in my application?\n\nThis is because you do not fulfilled the qualifications for the programme.\n\n##### How can I apply for UTM SPACE Foundation programme?\n\nYou may make the application through UTM SPACE system at [https://intake.utmspace.edu.my/register](https://intake.utmspace.edu.my/register)\n\n##### How can I apply for IDP Programme?\n\nYou may apply through UTMSPACE system at [https://intake.utmspace.edu.my/register](https://intake.utmspace.edu.my/register)\n\nPostgraduate\n\n##### Are UTM postgraduate programmes registered in the MQR?\n\nYes, all UTM postgraduate programmes are accredited and registered in the MQR.\n\n##### What is the requirement to enroll in Master’s programme?\n\nA Bachelor’s Degree with good honours from Universiti Teknologi Malaysia or any other institution of higher learning recognized by the Senate; or A qualification equivalent to a Bachelor’s Degree and experience in the relevant field recognized by the Senate.\n\n##### What is the requirement to enroll in Doctor of Philosophy Programme?\n\nA Master’s Degree from Universiti Teknologi Malaysia or any other Institutions of higher learning recognised by the Senate; or Other qualifications equivalent to a Master’s degree and experience in the relevant field recognised by the Senate; or Candidates who are currently registered in a Master’s Degree programme at Universiti Teknologi Malaysia, and approved by the Graduate Studies Committee of the respective faculty and the Senate\n\n##### How long is the duration of the studies?\n\nMaster’s Degree (3 to 8 semesters)\n\nDoctoral’s Degree (6 to 16 semesters)\n\n##### Are applications only available online?\n\nYes, you may apply at [SMART UTM](https://smart.utm.my/admission/Login.aspx)\n systems.\n\n##### What are the processes if I want to apply for an education withdrawal from my EPF account?\n\nStudent should refer to the EPF website for documents required for education withdrawal. University will provide Surat Pengesahan Pendaftaran Pelajar based on student’s request only. Request can be made at the following counters:\n\nMainstream programme – Direct request at the Customer Service Counter, Bursar Office, Skudai or KL campus or email to: [bursar@utm.my](mailto:bursar@utm.my)\n\nOffshore programme – Direct request at the Finance Unit Counter, School Of Graduate Studies, Skudai campus or email to: spsfinance@utm.my\n\n##### How do I fill up the part on my proposed research topic in the application form if I don't have a specific topic in mind?\n\nYou need not indicate a specific topic if you don’t have one in mind. You should, however, indicate the research area(s) that you are interested in. You may refer here [https://utmscholar.utm.my/](https://utmscholar.utm.my/) for research interests of all the staff members in the various departments.\n\n##### For the field on proposed supervisor(s), can I leave it blank as I don't know any staff in your University?\n\nYes. You can leave it blanks. If you have proposed supervisor(s) you can enter their name in that field\n\n##### Can International student apply for weekend class?\n\nYes if have the working pass for category 1 and 2."
}