{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/utm-architecture-students-win-architalent-design-competition#)\n    \n*   [Instagram](https://builtsurvey.utm.my/utm-architecture-students-win-architalent-design-competition#)\n    \n*   [RSS](https://builtsurvey.utm.my/utm-architecture-students-win-architalent-design-competition#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/utm-architecture-students-win-architalent-design-competition#)\n    \n*   [Instagram](https://builtsurvey.utm.my/utm-architecture-students-win-architalent-design-competition#)\n    \n*   [RSS](https://builtsurvey.utm.my/utm-architecture-students-win-architalent-design-competition#)\n    \n\nUTM Architecture Students win ARCHITALENT Design Competition\n============================================================\n\nby [webmaster FAB](https://builtsurvey.utm.my/author/norazreen/ \"Posts by webmaster FAB\")\n | Jul 24, 2017 | [Award](https://builtsurvey.utm.my/category/award/)\n, [News](https://builtsurvey.utm.my/category/news/)\n, [UTM News](https://builtsurvey.utm.my/category/utm-news/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2017/07/architecture-wins-1-1080x675.jpg)\n\nUTM Architecture students won the Grand Prize and the First Runner-up Prize for ARCHITALENT Architectural Student Design Competition, which was held from 11 May to 20 July 2017 in conjunction with the 18th International Architecture, Interior Design & Building Exhibition 2017 (ARCHIDEX17).\n\nThe competition was organised by Pertubuhan Akitek Malaysia (PAM) in collaboration with C.I.S Network Sdn. Bhd. Over 70 submissions were sent by students of accredited architecture schools and institutions across Malaysia, where 20 shortlisted finalists presented their ideas to a panel of industry-led judges at the Plenary Theatre of the Kuala Lumpur Convention Centre on 20 July 2017.\n\nThere were 9 entries from UTM Architecture students shortlisted as finalists: Ooi Soon Theng (supervised by Dr. Lim Yaik Wah), Wilson Tan Xern Ee (supervised by Dr. Lim Yaik Wah), Phua Chu Yun (supervised by Dr. Sharifah Salwa Bt Syed Mahdzar), Chiong Hoe Sieng (supervised by Dr. Sharifah Salwa Bt Syed Mahdzar), Koh Jhee Son and Lee Shun Shian (supervised by Ar. Samsiah binti Abdullah), Lee Chang Hern (supervised by Dr. Wan Hashimah Bte Wan Ismail), Lam Chee Hau (supervised by Dr. Khairul Anwar Bin Mohamed Khaidzir), Rashidah Jimi Sham (supervised by Dr. Khairul Anwar Bin Mohamed Khaidzir) and Ahmad Afiq Bin Mohd Jasmin (supervised by Dr. Dodo Yakubu Aminu).\n\nTwo of the UTM finalists had won the prizes. Ooi Soon Theng, who is in the 1st year of the Master of Architecture programme and under the supervision of Dr. Lim Yaik Wah, won the Grand Prize of RM3,000, a certificate and an air ticket sponsored by Malaysia Airlines to UIA 2017 Seoul World Architects Congress in September in South Korea. His project title is “Wind Driven Ventilated Malaysia Green Building Confederation Learning Centre”. Also, the First Runner-up Prize of RM2,000 and a certificate was awarded to Rashidah Jimi Sham, who is also in the 1st year of the Master of Architecture programme, with her project titled “Body Mechanics” and under the supervision of Dr. Khairul Anwar Bin Mohamed Khaidzir.\n\nSource: _[UTM Architecture Students win ARCHITALENT Design Competition | UTM NewsHub](http://news.utm.my/2017/07/utm-architecture-students-win-architalent-design-competition/)\n_"
}