{
  "markdown": "![](https://business.utm.my/actconference2024/wp-content/uploads/sites/58/2024/03/WEB-BANNER_AHIBS-ACT-2024-1-1.png \"WEB BANNER_AHIBS ACT 2024 (1) (1)\")\n\nAHIBS-ACT 2024\n--------------\n\nThe theme for AHIBS-ACT 2024 is ‘Act to Impact, Transform to Reform.’ We have chosen to use puzzles as symbolic representations of the journey taken by individuals and communities, transitioning from passive observers to active participants, from mere existence to profound impact, and from conventional norms to transformative reform.\n\nThe concept of “Act to Impact, Transform to Reform” serves as a rallying call for individuals to transcend passive observation and embrace their potential as agents of change. It underscores the interconnectedness of personal empowerment and collective progress, highlighting the symbiotic relationship between individual actions and societal transformation. By embracing the spirit of curiosity, resilience, and collaboration embodied by puzzles, individuals can embark on a journey of empowerment, impact, and enduring change.\n\nAHIBS-ACT 2024 takes great pride in presenting two affiliated conferences that align seamlessly with the spirit of this year’s theme. The International Action Research Conference 2024 showcases findings derived from collaborative research between industry and academia, spanning multidisciplinary fields. Simultaneously, The ANGEL Erasmus+ International Conference serves as a converging point for international partners involved in ANGEL Erasmus projects, bringing together professionals from both industry and academia within the realm of green entrepreneurship and leadership.\n\nThese two conferences intricately link together, forming a collaborative puzzle that embodies the essence of “Act to Impact, Transform to Reform.” The International Action Research Conference mirrors the theme by emphasizing active engagement, as researchers and professionals join forces to address real-world challenges. The multidisciplinary nature of the conference echoes the transformative journey highlighted in the theme, showcasing the collective impact that diverse perspectives can achieve.\n\nOn the other hand, The ANGEL Erasmus+ International Conference reinforces the theme through its focus on green entrepreneurship and leadership. By bringing together international partners, industry experts, academic scholars and marginalised community, this conference serves as a catalyst for impactful change in sustainable practices. The collaboration between these diverse stakeholders mirrors the collaborative spirit of solving a puzzle, where each piece contributes to the overall picture.\n\nIn essence, these two conferences not only individually represent the theme but also collaboratively form a larger puzzle that exemplifies the principles of “act to impact, transform to reform.” The interconnection between the conferences serves as a testament to the power of collective action, emphasizing that the synergy of diverse perspectives and collaborative efforts is key to achieving meaningful and transformative reforms in both research and sustainable entrepreneurship.\n\nBE PART OF US TODAY!\n\nAffiliate Conference\n--------------------\n\n*   International Action Research Conference (IARC)\n*   ANGEL International Conference (AIC)\n\n![](http://business.utm.my/actconference/wp-content/uploads/sites/57/2023/06/kl-city2.jpg)\n\n#### VISIT KUALA LUMPUR\n\n[www.visitkl.gov.my](http://www.visitkl.gov.my/)\n\n**ENQUIRY**  \nFor enquiry please email to [ahibs-actconference@utm.my](mailto:ahibs-actconference@utm.my)\n or fill up form below :\n\nName \n\nEmail Address \n\nMessage\n\n11 + 13 = \n\nSubmit\n\n*   [Follow](https://www.facebook.com/utmahibs/ \"Follow on Facebook\")\n    \n*   [Follow](https://www.instagram.com/utmahibs/ \"Follow on Instagram\")\n    \n*   [Follow](https://twitter.com/utmahibs \"Follow on X\")\n    \n*   [Follow](http://www.youtube.com/@utmahibs \"Follow on Youtube\")\n    \n\n![](http://business.utm.my/actconference/wp-content/uploads/sites/57/2023/05/act2023-logo.jpeg \"act2023 logo\")"
}