{
  "markdown": "### **RELATED LINKS**\n\n[**PROGRAM OFFERED**](https://admission.utm.my/postgraduate-school-of-electrical-engineering/)\n\n[**UTM ENTRY REQUIREMENT (MALAYSIAN)**](https://admission.utm.my/postgraduate-entry-requirements/)\n\n[**UTM ENTRY REQUIREMENT (INTERNATIONAL)**](https://admission.utm.my/int-pg-entry-requirements/)\n\n[**ENGLISH REQUIREMENT**](https://admission.utm.my/english-language-requirements-3/)\n\n[**TUITION FEE (MALAYSIAN)**](https://admission.utm.my/fees-pg-malaysian/)\n\n[**TUITION FEE (INTERNATIONAL)**](https://admission.utm.my/fees-pg-inter/)\n\n**LIVING & EXPENSES**\n\n[**ACCOMMODATIONS**](https://studentaffairs.utm.my/pejabat-kolej-kediaman/)\n\n[**POSTGRADUATE HANDBOOK**](https://drive.google.com/file/d/1Wpb86NqNhljVbIvIfOUyn7So1NwVghZZ/view?usp=sharing)\n\n[APPLY NOW!](https://admission.utm.my/apply-now/)\n\n**ENTRY REQUIREMENTS FOR POSTGRADUATE PROGRAM**\n-----------------------------------------------\n\nGet the summarized version [HERE](https://fke.utm.my/wp-content/uploads/2023/08/Kertas-Kerja-Pindaan-Syarat-Kemasukan-v2_page-0007.jpg)\n.\n\n|     |     |\n| --- | --- |\n| #### **Postgraduate Program Taught Course Program (MKEH, MEEM, MEEP, MKET)** |     |\n| The admission requirements for students entering the Taught Course program are as follows: |     |\n| i   | Bachelor’s degree in Electrical Engineering or its equivalent recognized by the University Senate (accredited program by the EAC body) with a CGPA ≥ 2.50 / 4.00 or CGPA < 2.50 / 4.00 with a minimum of 5 years of work experience in the relevant field; or |\n| ii  | Bachelor’s degree in Engineering other than Electrical Engineering (e.g., Mechanical Engineering, Aeronautical Engineering, Civil Engineering, etc.) or its equivalent with a minimum CGPA ≥ 3.00 / 4.00 and 2 years of work experience in the field of electrical engineering; or |\n| iii | Bachelor’s degree in Science (Physics) or its equivalent with a minimum CGPA ≥ 3.00 / 4.00; or |\n| iv  | Bachelor’s degree in Science (Computer Science, Software, Information Technology) or its equivalent with a minimum CGPA ≥ 3.00 / 4.00 and 2 years of work experience in the field of electrical engineering; or |\n| v   | Bachelor’s degree in Engineering Technology (specifically in the field of electrical engineering) or its equivalent with a minimum CGPA ≥ 3.00 / 4.00; or |\n| vi  | Other qualifications approved by the Faculty’s Academic Committee. |\n| Candidates who meet the requirements of (ii – vi) are required to take and pass the prerequisite courses determined by the Faculty with a minimum grade of (B-). |     |\n\n|     |     |\n| --- | --- |\n| #### **Postgraduate Research Program, Master of Philosophy** |     |\n| The admission requirements for students entering the research program are as follows: |     |\n| i   | Bachelor’s degree in Electrical Engineering or its equivalent recognized by the University Senate with a CGPA >= 2.75 / 4.00 or 2.50 <= CGPA < 2.75 / 4.00, subject to thorough internal assessment, or CGPA < 2.50 / 4.00 along with at least 5 years of work experience; or |\n| ii  | Bachelor’s degree in Engineering other than Electrical Engineering (e.g., Mechanical Engineering, Aeronautical Engineering, Civil Engineering) or its equivalent with a minimum CGPA of 3.30 and 2 years of work experience in the field of electrical engineering; or |\n| iii | Bachelor’s degree in Science (Physics) or its equivalent with a minimum CGPA of 3.30; or |\n| iv  | Bachelor’s degree in Science (Computer Science, Software, Information Technology) or its equivalent with a minimum CGPA of 3.30 and 2 years of work experience in the field of electrical engineering; or |\n| v   | Bachelor’s degree in Engineering Technology (electrical engineering specialization only) or equivalent with a minimum CGPA of 3.30. |\n| vi  | Or other qualifications approved by the Faculty’s Academic Committee. |\n| Candidates who meet the admission requirements (ii – vi), must enroll in and pass the prerequisite courses determined by the Faculty with a minimum grade of (B-). |     |\n\n|     |     |\n| --- | --- |\n| #### **Fast-Track Doctor of Philosophy (PhD) Postgraduate Research Program** |     |\n| The admission requirements for students entering the Fast-Track Doctor of Philosophy (PhD) Postgraduate Research Program are as follows: |     |\n| i   | Bachelor’s degree in Electrical Engineering or its equivalent from UTM with a CGPA >= 3.67 / 4.00; or |\n| ii  | Bachelor’s degree in Electrical Engineering or equivalent from another recognized research university, as determined by the University Senate, with a CGPA >= 3.67 / 4.00, subject to thorough internal assessment. |\n\n|     |     |\n| --- | --- |\n| #### **Doctor of Philosophy (PhD) Postgraduate Research Program** |     |\n| The admission requirements for students entering the Doctor of Philosophy (PhD) research program are as follows: |     |\n| i   | Bachelor’s degree in Engineering, Electrical Engineering discipline, from UTM or its equivalent from other recognized higher education institutions, as determined by the University Senate. |\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/entry-requirements#)"
}