{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/quantity-surveying-computer-lab-officially-launched-by-ybhg-dato-sr-abdul-aziz-abdullah-president-of-board-of-quantity-surveyors-malaysia-bqsm#)\n    \n*   [Instagram](https://builtsurvey.utm.my/quantity-surveying-computer-lab-officially-launched-by-ybhg-dato-sr-abdul-aziz-abdullah-president-of-board-of-quantity-surveyors-malaysia-bqsm#)\n    \n*   [RSS](https://builtsurvey.utm.my/quantity-surveying-computer-lab-officially-launched-by-ybhg-dato-sr-abdul-aziz-abdullah-president-of-board-of-quantity-surveyors-malaysia-bqsm#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/quantity-surveying-computer-lab-officially-launched-by-ybhg-dato-sr-abdul-aziz-abdullah-president-of-board-of-quantity-surveyors-malaysia-bqsm#)\n    \n*   [Instagram](https://builtsurvey.utm.my/quantity-surveying-computer-lab-officially-launched-by-ybhg-dato-sr-abdul-aziz-abdullah-president-of-board-of-quantity-surveyors-malaysia-bqsm#)\n    \n*   [RSS](https://builtsurvey.utm.my/quantity-surveying-computer-lab-officially-launched-by-ybhg-dato-sr-abdul-aziz-abdullah-president-of-board-of-quantity-surveyors-malaysia-bqsm#)\n    \n\nQuantity Surveying Computer Lab officially launched by Ybhg Dato’ Sr Abdul Aziz Abdullah, President of Board of Quantity Surveyors Malaysia (BQSM)\n==================================================================================================================================================\n\nby [webmaster FAB](https://builtsurvey.utm.my/author/norazreen/ \"Posts by webmaster FAB\")\n | Dec 13, 2017 | [Alumni](https://builtsurvey.utm.my/category/alumni/)\n, [News](https://builtsurvey.utm.my/category/news/)\n, [photo](https://builtsurvey.utm.my/category/photo/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2017/12/MajlisRasmiKomputerQS-31.jpg)\n\nJohor Bahru, 21st November 2017: Department of Quantity Surveying, Faculty of Built Environment has officially launched its newly upgraded computer lab on 21st November 2017. The official launching ceremony was graced by YBhg Dato’ Sr Abdul Aziz, President of Board of Quantity Surveying Malaysia (BQSM). The ceremony was held to appreciate the generous contribution from the Department of Quantity Surveying alumni in materialising the upgrading process. Initially, the computer lab which is previously known as Quantity Surveying Computer Studio (Studio Komputer Ukur Bahan) was designed with science lab furniture and layout. Not only it deterred the teaching and learning process, it was also unergonomic, supplied with dilapidated and outdated hardware and computer software applications. It has transformed quite significantly into a more conducive facility and equipped with updated computer hardware and software applications suitable for quantity surveying and construction teaching and learning activities. The name was later changed to Quantity Surveying Computer Lab (Makmal Komputer Ukur Bahan) to reflect its functions.\n\nThe planning of upgrading works started in 2012 with initial discussion among the department members on the crucial needs for an updated computer facility as well as suitable computer software applications to aid the teaching and learning process. Initiatives were taken among the Quantity Surveying department members especially by the then Head of Department, Assoc. Prof. Sr Dr Fadhlin Abdullah to collect donations among Quantity Surveying Department alumni to initiate the upgrading process. The minimum amount of the donations received was RM 3,000.00. 14 alumni had generously donated with a total accumulated sum of RM 50,000.00. Among the generous alumni are Dato’ Hj Mohd Azmi Abdul Ghani, Sr Dr. Rosli Abdul Rashid, Dato’ Sr Abdullah Che Mat, Sr Dr. Wan Maimun Wan Abdullah, Sr Azinal Abidin Ali, Mr Razak Paojan and Mr Harmize Ahmad. Additional fund was obtained from the faculty’s budget to carry out the upgrading works involving the change of furniture and layout of the computer lab. The injection of the 4th maintenance rolling plan under the Unit Pengurusan Makmal Universiti (UPMU) had tremendously aid the upgrading works into becoming what it is now. The computer lab is now equipped with 51 high-end computers, a substantial upgrade in quantities for both hardware and software applications. The total amount of the upgrading works as in December 2014 was RM 363,432.00.\n\nDepartment of Quantity Surveying alumni, other than those who have contributed to the upgrading works, were also invited together with the software vendors and potential collaborators to witness the successfully upgraded works.  The alumni were overwhelmed with the donation initiatives and they are looking forward in participating with Quantity Surveying Department for any upcoming projects.  The recently upgraded computer lab facility is working in close collaboration with Building Information Modelling Centre for Digital Innovations and Solution (BIMCDIS) lead by Assoc. Prof. Sr Dr. Kherun Nita Ali as well as other research groups namely the BIM Research Group (BIMRG), Construction Economics and Management Research Group (CEMRG) and Construction Research and Policy Analysis Research Group (CRPARG).  Close collaboration with BIMCDIS has successfully acquired a Memorandum of Understanding with Construction Industry Development Board (CIDB) in becoming one of the CIDB’s Satellite myBIM Centre and hosting various BIM training programmes for southern region."
}