{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/pelajar-geoinformasi-dari-fabu-sertai-global-outreach-program-gop-ke-tokyo-jepun#)\n    \n*   [Instagram](https://builtsurvey.utm.my/pelajar-geoinformasi-dari-fabu-sertai-global-outreach-program-gop-ke-tokyo-jepun#)\n    \n*   [RSS](https://builtsurvey.utm.my/pelajar-geoinformasi-dari-fabu-sertai-global-outreach-program-gop-ke-tokyo-jepun#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/pelajar-geoinformasi-dari-fabu-sertai-global-outreach-program-gop-ke-tokyo-jepun#)\n    \n*   [Instagram](https://builtsurvey.utm.my/pelajar-geoinformasi-dari-fabu-sertai-global-outreach-program-gop-ke-tokyo-jepun#)\n    \n*   [RSS](https://builtsurvey.utm.my/pelajar-geoinformasi-dari-fabu-sertai-global-outreach-program-gop-ke-tokyo-jepun#)\n    \n\nPelajar Geoinformasi dari FABU sertai Global Outreach Program (GOP) Ke Tokyo, Jepun\n===================================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Jan 27, 2019 | [Global Outreach Program](https://builtsurvey.utm.my/category/global-outreach-program/)\n, [News](https://builtsurvey.utm.my/category/news/)\n, [photo](https://builtsurvey.utm.my/category/photo/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2019/01/geoinformatic.jpg)\n\nPelajar dari Fakulti Alam Bina dan Ukur (FABU) berpeluang menimba pengalaman di negara maju melalui pengamatan terhadap budaya belajar, bekerja dan bersosial mereka apabila menyertai _Global Outreach Program_ (GOP) ke Tokyo, Jepun pada 11 hingga 18 Januari 2019 yang lalu.\n\nTujuh orang pelajar dari program Sarjana Muda Sains (Geoinformatik) tersebut diiringi oleh dua orang pensyarah, Prof Madya Sr Mohamad Nor Said dan Dr Muhammad Imzan Hassan, dengan sebahagian besar pembiayaan adalah hasil sumbangan dan penajaan oleh alumni program Geoinformasi, FABU.\n\nLawatan akademik melibatkan penglibatan para pelajar dalam beberapa siri kuliah di Tokyo Metropolitan University (TMU).\n\nKehadiran kumpulan ini dialu-alukan oleh Profesor Takaya Ohashi selaku Pengarah Eksekutif _International Office_ TMU.\n\nKuliah yang berkait rapat dengan pembelajaran mereka di UTM dalam bidang Geoinformatik telah banyak mendedahkan bagaimana Jepun memanfaatkan pelbagai maklumat geospatial di dalam pelbagai sektor seperti pengangkutan, pelancongan dan lain-lain lagi.\n\nMereka juga didedahkan dengan kaedah pembelajaran tanpa peperiksaan di TMU.\n\n[![](https://builtsurvey.utm.my/wp-content/uploads/2019/01/geo1.png)](https://builtsurvey.utm.my/wp-content/uploads/2019/01/geo1.png)\n\n**Prof Takaya Ohashi selaku Pengarah Eksekutif _International Office_ TMU** **bergambar semasa mengalu-alukan kedatangan pelajar GOP UTM**\n\n[![](<Base64-Image-Removed>)](https://builtsurvey.utm.my/wp-content/uploads/2019/01/geo2.png)\n\n**Pelajar-pelajar mengikuti kuliah “Tourism and Transport Planning”** **oleh Profesor Tetsuo Shimizu**\n\nPelajar-pelajar juga telah menghayati budaya kerja yang amat mementingkan masa dalam pergerakan lawatan yang diuruskan oleh pihak TMU.\n\nPerkara yang sama dilalui apabila bergerak dengan menggunakan pengangkutan awam seperti keretapi dan bas.\n\nPenyediaan maklumat dan sistem capaian yang cekap telah memberi kefahaman kepada pelajar tentang program Geoinformatik yang mereka ikuti di UTM.\n\nLawatan sosial ke beberapa destinasi seperti Gunung Fuji dan resort ski Gala Yuzawa pula telah memberi peluang kepada pelajar melihat topografi dan merasai iklim yang jauh berbeza dengan Malaysia.\n\nKemudahan peta lokasi dan maklumat lain dalam bentuk digital memperlihatkan bagaimana Negara Jepun memanfaatkan Sistem Maklumat Geografi (GIS) yang menjadi teras kepada program Geoinformatik yang sedang diikuti pelajar-pelajar ini di UTM.\n\n[![](<Base64-Image-Removed>)](https://builtsurvey.utm.my/wp-content/uploads/2019/01/geo3.jpg)\n\n**Pelajar menghayati suhu beku di resort ski Gala Yuzawa, Niigata**\n\nDi samping itu, belajar juga berpeluang menyertai program promosi kebudayaan tarian tradisional Jepun (_Fujimusume_) dan demonstrasi pemakaian _kimono_.\n\nIni juga merupakan sebahagian daripada objektif GOP agar pelajar dapat memahami amalan kebudayaan dan tradisi sesuatu Negara.\n\nRujukan : [Pelajar Geoinformasi dari FABU sertai Global Outreach Program (GOP) Ke Tokyo, Jepun](https://news.utm.my/ms/2019/01/pelajar-geoinformasi-dari-fabu-sertai-global-outreach-program-gop-ke-tokyo-jepun/)"
}