{
  "markdown": "IEEE DEIS Sponsored Distinguished Lecturer Programme: Lecture by Professor Toshikatsu Tanaka\n============================================================================================\n\nby [powerpic](https://fke.utm.my/author/powerpic/ \"Posts by powerpic\")\n | Nov 10, 2017 | [POWER](https://fke.utm.my/category/power/)\n\n![](https://fke.utm.my/wp-content/uploads/2017/11/DLPLecture1-980x588.jpg)\n\nOn 7th November 2017, the IEEE Dielectrics and Electrical Insulation Society (DEIS) sponsored distinguished lecturer programme (DLP) was held at the Institute of High Voltage and High Current, Universiti Teknologi Malaysia, Johor Bahru. The lecture was conducted by Professor Toshikatsu Tanaka of Waseda University, Japan, on “Polymer Nanocomposite Dielectrics: Fundamentals and Applications”. A total of 129 participants including students, lecturers and engineers attended the lecture.\n\nDuring the lecture, Professor Tanaka shared with the audience on the fundamentals of nanocomposites, including an overview of nanocomposites, nanocomposite fabrication methods, interfaces of nanocomposites, and performance improvements of nanocomposites. Various promising experimental findings of nanocomposites, including partial discharge, treeing breakdown, and space charge, were shown to the audience. The applications of nanocomposites in high voltage engineering, such as in switchgears, dry-type transformers, power generators, and extruded cables, were also demonstrated to the audience. In addition, the DEIS educational video was broadcasted to the audience during the break. Through the video, the audience had the chance to understand the DEIS’ mission and vision, as well as its scope of interest in solid, liquid, and gaseous dielectrics.\n\nThe committee members of the DEIS Malaysia Chapter wish to express their sincere thanks to Professor Tanaka for his willingness to share his expertise in the field of nanocomposites with the Malaysian community. Co-operation and support from the members of the Institute of High Voltage and High Current of Universiti Teknologi Malaysia and Malaysian High Voltage Network were also acknowledged for making the DLP event in Malaysia a great success.\n\n![dlplecture1](https://fke.utm.my/wp-content/uploads/2017/11/DLPLecture1.jpg)\n\nProfessor Tanaka delivering his lecture\n\n![dlplecture3](https://fke.utm.my/wp-content/uploads/2017/11/DLPLecture3.jpg)\n\nThe audience\n\n![dlplecture2](https://fke.utm.my/wp-content/uploads/2017/11/DLPLecture2.jpg)\n\nProfessor Tanaka receiving a token of appreciation from Professor Zulkurnain Abdul Malek, Director of the Institute of High Voltage and High Current\n\n![dlplecture6](https://fke.utm.my/wp-content/uploads/2017/11/DLPLecture6.jpg)\n\nProfessor Tanaka receiving a token of appreciation from Ir. Dr. Lau Kwan Yiew, Chair of the IEEE DEIS Malaysia Chapter\n\nBy. Ir. Dr. Lau Kwan Yiew, Universiti Teknologi Malaysia\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/ieee-deis-sponsored-distinguished-lecturer-programme-lecture-by-professor-toshikatsu-tanaka#)"
}