{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/research-topics-greenovation#)\n    \n*   [Instagram](https://builtsurvey.utm.my/research-topics-greenovation#)\n    \n*   [RSS](https://builtsurvey.utm.my/research-topics-greenovation#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/research-topics-greenovation#)\n    \n*   [Instagram](https://builtsurvey.utm.my/research-topics-greenovation#)\n    \n*   [RSS](https://builtsurvey.utm.my/research-topics-greenovation#)\n    \n\nNew Research Topics Offered by Greenovation Research Group for Postgraduate Studies\n===================================================================================\n\nby [webmaster FAB](https://builtsurvey.utm.my/author/norazreen/ \"Posts by webmaster FAB\")\n | May 22, 2013 | [Featured Slider](https://builtsurvey.utm.my/category/featured-slider/)\n, [News](https://builtsurvey.utm.my/category/news/)\n, [Uncategorized](https://builtsurvey.utm.my/category/uncategorized/)\n\n**Dr. Kei Saito**  \n1\\. Towards New Urban Design Process Incorporating Urban Cooling Effects Verification Models for Historical Town in Malaysia\n\n2\\. Analytical Design Approaches for Understanding Walkable Urban Residential Neighborhood in Malaysia\n\n**Dr. Ismail Said**\n\n1\\. Effect of Urban Morphology on Distribution of Loose Fit Spaces for Children’s Play in Small Town\n\n2\\. Old Settlement Morphology in Malaysian Small Town: A Progression or Disturbance\n\n3\\. Spatial Planning of Landscape Arts as Identity of Place in Small Towns in Malaysia\n\n4\\. Spatio-temporal analysis of Urban Morphology on Riverside Towns in Malaysia\n\n5\\. Landscape Ecology and Urban Diversity of Small Towns in Malaysia\n\n6\\. Children’s Language Signifying Interaction with Nature Towards Environmental Learning\n\n**Dr. Hisyam Rashidi**\n\n1\\. Urban River as a Social and Habitat Corridor in a City\n\n2\\. Urban Street as a Green Corridor in a City\n\n3\\. Sustainable Community Environment for Agriculture Land Development: A Case Study of FELDA\n\n4\\. Heritage foot print on public space development at Riverside Corridor: A Case Study of Melaka River\n\n**Dr. Dilshan Remaz Ossen**\n\n1\\. Urban Design and Climate\n\nThe research areas are focused on urban microclimate and human comfort.  \na). The influence of urban geometry on outdoor microclimate in the tropics  \ne.g.: Sub topic\n\n*    The influence of street geometry on outdoor temperature/ ventilation\n*   The influence of open spaces geometry (urban squares) on outdoor temperature/ventilation\n*   The influence of landscape and water bodies on outdoor thermal comfort\n*   The influence of thermal properties of urban surfaces on outdoor temperature\n*   Residential Neighborhood Layout and outdoor temperature\n\nb). Influence of Future Master Plan on Urban Heat Island  \nc). Environment conscious city model\n\n2\\. Building Environmental Performance, User Response\n\nThe research areas are focused on indoor microclimate and human comfort in the tropics, user response on environmental performance of building and environmental responsive architecture:\n\n*   Thermal comfort in court yard houses in the hot and humid tropical climate, e.g.:Traditional Malay courtyard houses/ Traditional Chinese Shophouse/ Modern terraced house with court yard\n*   Daylight performance of court yard houses in the hot and humid tropical climate, e.g.: Traditional Malay courtyard houses/ Traditional Chinese Shophouse/Modern terraced house with court yard\n*   Influence of “Green Roof” and “Green Façade” on indoor thermal comfort in the hot and humid tropical climate\n*   Workplace occupants’ satisfaction e.g.: User response to daylight & lighting design/ User response to thermal comfort/ User response to outdoor view (office space, library, studio etc.)\n*   Form and Function in Environment Responsive Buildings\n*   Influence of Environmental Responsive Design on Place Attachment\n*   Evident Base Architecture\n\n3\\. Urban Heritage & Conservation\n\n*   Urban Centers of the Vernacular Cities: e.g. Traditional Malay Royal Towns: Basic Elements of Malay Royal Towns, Spatial Organization\n*   Design Principles of New Buildings in Historic Urban Context\n*   Capturing the public value in Heritage: Melaka & George Town\n*   Environmental and Climatic threat on Urban Heritage"
}