{
  "markdown": "Academic Office : +607-5333716 | Email : academic-fcee@utm.my | Administration Office : +607-5533499 [fcee@utm.my](mailto:fcee@utm.my)\n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n**BACHELOR OF CHEMICAL ENGINEERING WITH HONOURS**\n\nChemical engineering is a field that is expanding widely through out the world. The expertise is greatly needed to fulfill the demand for carrying the task that cannot be performed by the mechanical engineers and chemists. This fields has matured and currently covers many aspects of engineering such as systems design and processing of agricultural products, petroleum and petrochemicals, polymers, pharmaceuticals, bio-fuel, biochemical and many more. In the current state of the world, where resources are limited and sustainable development is a major challenge, the requirement for expertise in chemical engineering is even more crucial. In addition to fundamental fields such as science and mathematics, humanities and social sciences and basic engineering, there are four major areas in the Bachelor of Chemical Engineering course, These are separation technology, reaction engineering, environmental engineering and process systems engineering.\n\n**Read More**\n\nIn separation technology, student are exposed to processes and unit operation equipment in chemical engineering. To understand separation processes. a strong grasp on transport phenomena, which include momentum transfer, mass and heat transfer, is necessary. Mass and heat transfer theories are essential in designing or choosing a suitable heat exchanger to be utilized in a chemical plant. Meanwhile, the unit operation subject covers theories and design of major equipment in the separation of liquid-liquid, gas-liquid,solid-liquid and solid-gas system. Among the equipment are distillation, evaporation, drying, absorption, leaching and other separation techniques such as membrane technology and filtration. Knowledge in separation theory and unit operations is necessary in designing an optimum and safe plant.\n\nChemical engineering also focuses on the thermodynamics and chemical reaction aspects apart from designing a reaction system. Amongst the topics discussed are reaction kinetics in a reactor, types of reactors and reactor design. The students will learn chemical engineering thermodynamics aspects, which elucidate the characteristics of pure fluid, thermal effects, fluid thermodynamics characteristics, homogeneous thermodynamics, phase equilibrium and chemical reaction equilibrium. The knowledge will consequently be used in learning chemical reaction of processes. Another important aspect in chemical engineering is environmental safety. Environmental engineering subjects cover types of air and water pollution, and also analytical method for pollution measurement, waste treatment and waste management. The workers safety aspects will also be introduced.\n\nIn process system engineering, mass and energy balances is the fundamental subject. In this subject, the students will be introduces to the processes in chemical engineering as well s the calculation method for mass and energy balances for different processes. This includes the processes that have chemical reactions and also processes with physical transformations only. The skill in calculating mass and energy balances is very important in many other chemical engineering subjects.\n\nThe crux of the chemical engineering course is plant design and synthesis, which includes the selection of process, constructing flow sheets, mass and energy balance, detailed design, selection of equipment and raw materials, process control, operational instruction, cost and economics and also environmental and safety aspects in a plant. Students are also required to complete a processing plant design project in groups. Here, all the techniques learn in the previous years will be integrated in proposing a design for an assigned plant.\n\nApart from chemical engineering theories, students are also exposed to practical aspects of the field. Every area mentioned before has its own practical or laboratory sessions. The students are also required to prepare a project report to train them to integrate technical knowledge with communication and management in carrying out a task. For the group exercise, the students are required to complete a plant design as mentioned before. In addition, students will also carry out a bachelor’s level research project, in which they will individually work under the supervision of a lecturer. At the end of the design and research work, the students are required to prepare a thesis and give an oral presentation, which will be evaluated by internal and external examiners.\n\nThe UTM curriculum requires students to undergo industrial training fro 10-12 weeks during the semester break after the third year of education. A written report about the work done and experiences during the training must be presented at the end of the training period.\n\n*   [Programme Specifications](https://fkt.utm.my/bachelor-of-chemical-engineering-2#)\n    \n*   [Programme Educational Objectives (PEO)](https://fkt.utm.my/bachelor-of-chemical-engineering-2#)\n    \n*   [Programme Learning Outcomes (PLO)](https://fkt.utm.my/bachelor-of-chemical-engineering-2#)\n    \n*   [Engineering Programme Accreditation](https://fkt.utm.my/bachelor-of-chemical-engineering-2#)\n    \n*   [Program Structure](https://fkt.utm.my/bachelor-of-chemical-engineering-2#)\n    \n*   [Career opportunities](https://fkt.utm.my/bachelor-of-chemical-engineering-2#)\n    \n*   [Entry requirement](https://fkt.utm.my/bachelor-of-chemical-engineering-2#)\n    \n*   [Graduation Checklist](https://fkt.utm.my/bachelor-of-chemical-engineering-2#)\n    \n\n|     |     |     |\n| --- | --- | --- |\n| 1.   Programme Name | Bachelor of Chemical Engineering with Honours |     |\n| 2.   Final Award | Bachelor of Chemical Engineering with Honours |     |\n| 3.   Awarding Institution | Universiti Teknologi Malaysia |     |\n| 4.   Teaching Institution | Universiti Teknologi Malaysia |     |\n| 5.   Professional or Statutory Body of Accreditation | Engineering Accreditation Council (EAC) Board of Engineers Malaysia (BEM) |     |\n| 6.   Language(s) of Instruction | English and Bahasa Melayu |     |\n| 7.   Mode of Study (Conventional, distance learning, etc) | Conventional |     |\n| 8.   Mode of operation (Franchise, self-govern, etc) | Self-governing |     |\n| 9.   Study Scheme (Full Time/Part Time) | Full Time |     |\n| 10\\. Study Duration | Minimum   : 4 yrs<br><br>Maximum  : 6 yrs |     |\n| Type of Semester | No. of Semesters | No. of weeks per semester |\n| Normal | 8   | 14  |\n| Short | 4   | 8   |\n\n**PEO 1** – Perform competently in chemical Industries and become important contributors to national development.\n\n**PEO 2** – Become creative, innovative and adaptable engineers as leaders or team members in their organizations and society.\n\n**PEO 3** – Contribute professionally towards the environmental well-being and sustainable development.\n\n[PLO of School of Chemical and Energy Engineering (SCEE): 2005-2016](https://fkt.utm.my/newfcee/files/2017/08/PLO-of-Faculty-of-Chemical-and-Energy-Engineering-FCEE-2005-2016.pdf)\n   \n[PLO of School of Chemical and Energy Engineering (SCEE): 2017](https://fkt.utm.my/newfcee/files/2017/08/PROGRAMME-LEARNING-OUTCOMES-PLO-2017.pdf)\n\n[MALAYSIAN QUALIFICATION REGISTER](https://www2.mqa.gov.my/mqr/english/epapariptaAA.cfm?IDAkrKP=16393)\n\n[ENGINEERING PROGRAMME ACCREDITATION (CPS CEA Knowledge Profile)](https://fkt.utm.my/wp-content/uploads/2020/04/ENGINEERING-PROGRAMME-ACCREDITATION-CPS-CEA-Knowledge-Profile.pdf)\n\n[Undergraduate Guidebook 2024/2025](https://fkt.utm.my/wp-content/uploads/2024/09/GUIDEBOOK-UG-FKT-1-2024-2025.pdf)\n\nChemical engineers are universal engineers, who are versatile and capable of performing many types of tasks.  They can be assigned in various sectors of industries including banking, insurance, administration and business. However, many are working in the industry as production and process engineers, maintenance engineers and project engineer. With their ability spanning these three important aspects, many chemical engineers have been promoted to the position of plant manager, which manages the whole processing plant.  The industrial sectors that need many chemical engineers are petroleum and petrochemicals, palm oil and oleo chemicals, rubber and plastics, pharmaceuticals and medicine, food and electronics. Here the chemical engineers’ job is to ensure the design and the operation is carried out in an optimum condition, economical, safe as well as environmentally friendly manner.\n\nWith rapid development in the process industry, the need for chemical engineers in sectors supporting the industry is also becoming more important. For example, the demand for chemical engineers in banking and insurance industry is increasing. A chemical   engineer is needed in the management and marketing of raw materials, products and main equipment and  instrumentation, which are related to the processing industry. Many engineering consulting companies are also opened and this gives more career opportunities for the newly graduating chemical engineers.\n\nChemical engineers are needed in semi-government sectors such as in MIDA and the Department of Environment. They are also desired in research institutions such as in MPOB, MARDI and RRI.  In institutions of higher learning, chemical engineers with PhDs are highly in demand.\n\nFor students in the Bachelor of Chemical Engineering program, the tendency towards any specific industry can be fulfilled by choosing the right optional subjects. This will provide them with additional suitable expertise for the industry.\n\n**Malaysian**\n\n[https://admission.utm.my/undergraduate-malaysian/](https://admission.utm.my/undergraduate-malaysian/ \"Malaysian\")\n\n**International**\n\n[https://admission.utm.my/undergraduate-international/](https://admission.utm.my/undergraduate-international/ \"International\")\n\n**For further enquiries please contact:  \n**  \n![](https://fkt.utm.my/wp-content/uploads/2022/06/Dr-Hajar.png)**Assoc. Prof. Dr. Hajar Alias**  \n**Program Director (Chemical)**  \nOffice: +607-5535486  \nEmail: r-hajar@utm.my"
}