{
  "markdown": "607-5537599/7595 ( Office ) [utmpesisir@utm.my](mailto:utmpesisir@utm.my)\n\n*   [Home](https://odl.utm.my/)\n    \n*   [About Us](https://odl.utm.my/about-us/)\n    \n*   [Programmes](https://odl.utm.my/program/)\n    \n*   [Learning Platform](https://odl.utm.my/learning-platform/)\n    \n*   [Learners Support](https://odl.utm.my/online-learning-support/)\n    \n*   [ODL Guideline](https://odl.utm.my/utm-odl-guideline/)\n    \n*   [FAQs](https://odl.utm.my/faqs/)\n    \n*   [News & Announcement](https://odl.utm.my/news-announcement/)\n    \n*   [Contact Us](https://odl.utm.my/contact-us/)\n    \n\nOpen & Distance Learning Platform\n=================================\n\nhttps://odlsystem.utm.my is the official online learning platform for Open & Distance Learning (ODL) lecturers and students. The LMS is deployed using Moodle (Current Version) as our Learning Management System.  All courses offered by the Universiti Teknologi Malaysia under Open Distance Learning mod can be found in this platform. This LMS platform enables smooth course administration, delivery and management between lecturers, student and course administrator.\n\nActive students will be provided with a userid and password to access this system. Courses registered by active students will appear at their dashboard automatically for the online learning process.\n\n![](https://odl.utm.my/wp-content/uploads/sites/190/2022/10/LOGO-UTM-1-1.png \"LOGO UTM (1)\")\n\n[Login](https://odlsystem.utm.my/)\n\n\n\n#### Personalised Dashboard\n\nDisplay current, past and future courses, along with tasks due.\n\n\n\n#### Collaborative tools & activities\n\nWork and learn together in forums, wikis, glossaries, database activities, and much more.\n\n\n\n#### Track progress\n\nInstructors and students can track progress and completion with an array of options for tracking individual activities or resources and at course level.\n\n\n\n#### Recording audio and video\n\nStudents and Instructors can easily record sound and video from within the Atto editor for reflections or additional guidance.\n\nAll our courses are designed for self-paced learning with an opportunity to interact with the instructors through video conference or chat.\n\nEach course includes with a mixture of rich content, targeted learning strategies, dynamic screens, interactive tests, exercises with reinforcement feedback and illustrative case studies make often complex topics accessible to novice learners while meeting the needs of experienced professionals wishing to update their skills.\n\nIn addition to the learning materials, you will find links to online resources, recommended reading and self-study tutorials to get you started in applying what you have learned."
}