{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/utm-to-collaborate-with-wni-on-research-and-training-about-weather-related-disaster#)\n    \n*   [Instagram](https://builtsurvey.utm.my/utm-to-collaborate-with-wni-on-research-and-training-about-weather-related-disaster#)\n    \n*   [RSS](https://builtsurvey.utm.my/utm-to-collaborate-with-wni-on-research-and-training-about-weather-related-disaster#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/utm-to-collaborate-with-wni-on-research-and-training-about-weather-related-disaster#)\n    \n*   [Instagram](https://builtsurvey.utm.my/utm-to-collaborate-with-wni-on-research-and-training-about-weather-related-disaster#)\n    \n*   [RSS](https://builtsurvey.utm.my/utm-to-collaborate-with-wni-on-research-and-training-about-weather-related-disaster#)\n    \n\nUTM To Collaborate With WNI On Research and Training About Weather Related Disaster\n===================================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Sep 3, 2018 | [News](https://builtsurvey.utm.my/category/news/)\n, [UTM News](https://builtsurvey.utm.my/category/utm-news/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2018/09/D35A0130-1-1080x675.jpg)\n\nProf. Azlan (fifth right) exchanging the MoU with Mr. Yasushi Shiga, Senior Manager Director & Chief Revenue Officer (Japan & Asia) of WeatherNews Inc. (WNI)\n\n**JOHOR BAHRU**, 16 August 2018 – Universiti Teknologi Malaysia (UTM) will collaborate with Weathernews Inc (WNI), a private Japanese weather service corporation to conduct research and training on weather related disasters in Malaysia.\n\nThe Deputy Vice Chancellor (Development), Prof. Dr. Azlan Abd. Rahman in his welcoming speech said that WNI is a private weather service corporation established and existing under the Law of Japan, having its principal office at Chiba-shi, Chiba, Japan.\n\n“WNI offers a wide range of services at international level covering airline industries, mobile computing markets, fuel operations; ship routing, media, retail markets, disaster management and disaster management support for countries that are subject to weather risks.\n\n“The ultimate goal of the collaboration is to mitigate the negative impact of severe weather and extreme natural hazards on the life of people as well as business activities and to enhance the sustainable development of Malaysia,” said. Prof. Azlan.\n\nProf. Azlan said that through this collaboration WNI will provide weather data measured by WITH Radar that is worth RM 200,000 per year to UTM.\n\n“WITH Radar was developed using aviation Doppler radar with the latest meteorological technology in order to capture rapidly developing cumulonimbus clouds that often bring damage in the form of sudden torrential thunderstorms, wind gusts and tornados.\n\n“The WITH Radar makes a complete scan of a 50km2 area every 6 seconds and captures precipitation intensity, and the direction and speed of movement of the storm cell in the lower troposphere to capture clouds forming even lower than 2km,” he said.\n\nThe scans are also three-dimensional allowing the capture of the development of the clouds as well.\n\n“Data captured by WITH Radar will be used to produce more accurate predictions of weather related disasters such as floods in Malaysia.  \n\nThis forecast will then be used in various risk communication services and support operations of the nation in taking direct actions to minimize potential weather risk,” he said.\n\nBoth UTM and WNI will collaborate to conduct workshops/seminars to private companies and public institutions to utilise the data for disaster mitigation in Malaysia. The data and results will also be used for teaching purposes in UTM.\n\nThis Memorandum shall remain in force for 5 years and shall continue to remain in force by mutual agreement between WNI and UTM.\n\nThe overall implementation of the project shall be headed by Mr.Yuta Seto or his successor from WNI whereas, the substantive research and development aspects of the Project shall be headed by Assoc. Prof. Dr. Kasturi Devi Kanniah from UTM or her successor.\n\nThe MoU document was signed by UTM’s Vice Chancellor (Development), Prof. Dr. Azlan Abdul Rahman and Mr. Yasushi Shiga, Senior Manager Director & Chief Revenue Officer (Japan & Asia) of WeatherNews Inc. (WNI), Japan.\n\nThe ceremony was held at the Faculty of Built Environment & Surveying, UTM Johor Bahru on August 16th, 2018.\n\n![](<Base64-Image-Removed>)"
}