{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/international-design-colloquium-between-universitas-tanjung-pura-and-utm-architecture-program#)\n    \n*   [Instagram](https://builtsurvey.utm.my/international-design-colloquium-between-universitas-tanjung-pura-and-utm-architecture-program#)\n    \n*   [RSS](https://builtsurvey.utm.my/international-design-colloquium-between-universitas-tanjung-pura-and-utm-architecture-program#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/international-design-colloquium-between-universitas-tanjung-pura-and-utm-architecture-program#)\n    \n*   [Instagram](https://builtsurvey.utm.my/international-design-colloquium-between-universitas-tanjung-pura-and-utm-architecture-program#)\n    \n*   [RSS](https://builtsurvey.utm.my/international-design-colloquium-between-universitas-tanjung-pura-and-utm-architecture-program#)\n    \n\nInternational Design Colloquium between Universitas Tanjung Pura and UTM Architecture Program\n=============================================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Jul 11, 2021 | [Conference & Seminar](https://builtsurvey.utm.my/category/conference-seminar/)\n, [News](https://builtsurvey.utm.my/category/news/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2021/07/unnamed.png)\n\n**By: AP Dr. Alice Sabrina Ismail**\n\nAn International Design Colloquium between Universitas Tanjung Pura (UNTAN), Kalimantan Barat, Indonesia and Architecture Program, Faculty of Built Environment and Surveying (FABU), Universiti Teknologi Malaysia (UTM) had been conducted on 21 June 2021 through an online platform.\n\nThis event which was organized by UTM Architecture program was officiated by the Director of Institute Sultan Iskandar, Prof. Dr. Syed Ahmad Iskandar Syed Ariffin, and its opening speech was delivered by Dr. Purwoharjono, ST, MT, the representative from Dean of Graduate Studies, UNTAN.\n\nFour represented panellists from UTM for this International Design Colloquium were Assoc. Prof. Dr. Alice Sabrina Ismail, Dr. Roshida Abdul Majid, Assoc. Prof. Dr. Khairul Anwar Khaidzir and Mr. Azari Mat Yasir. Meanwhile, six involved Masters of Architecture (MArch) students were Muhamad Jeffry Sofian, Wan Ashieryl Wan Azahari, Francis Chuah Kok Sheng, Veroll Valerius Wong, Mohd Nizarhamdon Rosli and Muhammad Arib Affan Mohd Hamzan.\n\nOn behalf of UNTAN Architecture program, there were Mr. Jawas Dwijo Putro S.T, Msc, Mr. Irwin S.T, MT, Madam Emylia Kalsum, S.T, MT and Madam B. Jumaylinda Gultom, ST MT as the represented panellist. The involved UNTAN final Year Architecture students were Andyani Eka Lestari, Elicia Javiera, Arif Affandi, Gaudensius Waldi Fernando, Hastika Tri Aprilla and Riesa Rizli Amalia. These two parallel sessions were moderated by Dr. Iziq Eafifi Ismail and Dr. Izura Tukiman.\n\nThe design colloquium has been beneficial for both academicians and students as it strengthens the relationship between both universities and valuable in developing a better appreciation of architecture from various cultural backgrounds. Understanding how culture manifests itself from a different built environment setting can indirectly help to shape a positive educational experience for students and academicians.\n\nThis event that lasted for four hours had also allowed the UTM architecture program to reach out more extensive network of students and academicians from India Architecture school instead of being restricted by geographical boundaries within Indonesia and Malaysia.\n\nThe UTM Architecture program hoped that the broader discourse on the built environment considers areas such as an [interdisciplinary](https://en.wikipedia.org/wiki/Interdisciplinary)\n field that addresses the design, construction, and management, can be conducted again with Universitas Tanjungpura in the future to benefit both universities.\n\n*   ![](https://ci5.googleusercontent.com/proxy/Cqi1jWR3PhKYu1bu3X8JFcKxYkcRngdIQ7UaImm3Y5WLlWeABfNaqq7V3YaqDTzSagAUVHhjDKUVnVQqwxLTrWyakw3YtGSmiHR8UVZBlto=s0-d-e1-ft#https://news.utm.my/wp-content/uploads/2021/06/Picture2-6.png)"
}