{
  "markdown": "Lecture on Dielectric Measurement System Using Microwaves Guides\n================================================================\n\nby [commpic](https://fke.utm.my/author/commpic/ \"Posts by commpic\")\n | Dec 7, 2016 | [COMM](https://fke.utm.my/category/comm/)\n\n**Speakers:** Dr You Kok Yeow\n\n**Date & Time:**29 July 2013; 9:00 am – 12:00 pm\n\n**Venue:** Department Communication Engineering Meeting Room & Microwave Laboratory  \n**Organizer:** [Sonar Technology and Marine Instrumentation Research Group (STAR) Group, Infocomm Research Alliance](https://fke.utm.my/star/)\n\n**Bibliography:** You Kok Yeow was born in 1977. He obtained his B.Sc. Physics (Honours) degree in Universiti Kebangsaan Malaysia (UKM) in 2001. He pursued his M.Sc. in Microwave at the Faculty of Science in 2003 and his Ph.D. in Wave Propagation at the Institute for Mathematical Research in 2006 in Universiti Putra Malaysia (UPM), Serdang, Selangor, Malaysia. Recently, he is a senior lecturer at Communication Engineering Department, Faculty of Electrical Engineering, Universiti Teknologi Malaysia (UTM), Skudai, Johor, Malaysia. His main personnel research interest is in the theory, simulation, and instrumentation of electromagnetic wave propagation at microwave frequencies focusing on the development of microwave sensors for agricultural applications.\n\n**Abstract:** Since 1946, Robert and von Hippel initiated the dielectric measurements by using coaxial line technique based on the shift of position nodes of standing wave patterns of a short-circuited sample. Recently, the most frequently used broadband measurement method for the determination of the complex permittivity of materials is based on measurements of a sample placed in a standard waveguide or coaxial line. The method has the advantage of using commercially available, good quality calibration standards. The material characterization using coax/waveguide discontinuity method can be categorized into one-port measurement and two port measurement. The one-port measurement is based on the principle that a reflected signal through the aperture waveguide, which is contacting firmly with a test material. While, the two-port measurement using both reflection and transmission methods, which a sample is placed between the segment of two coaxial transmission lines or the cross section of rectangular waveguide transmission line. Normally, the obtained measured reflection and transmission coefficients, S11 and S21 of sample are converted to relative permittivity, εr using Nicolson-Ross-Weir (1970) routine. The advantage of using two ports near field measurement is that the both permittivity and permeability of sample can be measured and the errors due to radiation or scatter conditions can be reduced. The disadvantage of this method is the solid sample under test almost required a machining cut process in order to fit the sample into the waveguide. The most difficult is to ensure that no air gap exists between the solid sample and the metal walls of the waveguide.\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/lecture-on-dielectric-measurement-system-using-microwaves-guides#)"
}