{
  "markdown": "Academic Office : +607-5333716 | Email : academic-fcee@utm.my | Administration Office : +607-5533499 [fcee@utm.my](mailto:fcee@utm.my)\n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n[![](https://fkt.utm.my/wp-content/uploads/2023/03/MKKT-724x1024.jpg \"MKKT\")](https://fkt.utm.my/wp-content/uploads/2023/03/MKKT.pdf)\n\n###### _Updated : 10 March 2023_\n\n**MASTER OF SCIENCE (M.Sc) IN HERBAL TECHNOLOGY**\n\nThe herbal industry offers a unique and strategic investment opportunity that resulted in its rapid growth worldwide. Thus, Institute of Bioproduct Development (IBD) is offering Master of Science (Herbal Technology) programme, a taught course modular-based master level programme. This programme, that tackles the technological part of the development of herbal based products, is expected to meet the needs of skilled manpower in herbal industry. Being the only programme of its kind in the world, this programme is anticipated to contribute significantly to the development of relevant human capital that will spur the growth of herbal industry in Malaysia, and the world.\n\n**Benefits:**  \nAt the end of the programme graduates are able to analyze critically, plan, solve complex problems associated with herbal science and technology and related fields and design plant-wide processes including unit operations leading to a professional qualification that will serve the herbal or phytochemical industry. The graduates will also acquire strategic knowledge on “seed to shelf” concept at the herbal business value chain.\n\n*   [Programme Specifications](https://fkt.utm.my/msc-herbal-technology#)\n    \n*   [Programme Educational Objectives (PEO)](https://fkt.utm.my/msc-herbal-technology#)\n    \n*   [Programme Learning Outcomes (PLO)](https://fkt.utm.my/msc-herbal-technology#)\n    \n*   [Program Structure](https://fkt.utm.my/msc-herbal-technology#)\n    \n*   [Career opportunities](https://fkt.utm.my/msc-herbal-technology#)\n    \n*   [Entry requirement](https://fkt.utm.my/msc-herbal-technology#)\n    \n\nMaster of Science (Herbal Technology) by taught course is suitable for any bachelor graduates from science, technology and engineering field. Graduates from other disciplines with relevant experiences are also encouraged to apply. \n\nThe programme graduates are able to analyse critically, plan, solve complex problems associated with herbal science and technology and related fields and design plant-wide processes including unit operations leading to a professional qualification that will serve the herbal or phytochemical industry. The graduates will also acquire strategic knowledge on “seed to shelf” concept at the herbal business value chain.\n\n**PEO 1** : Mastery of knowledge and competency in advanced areas of herbal science and processing technology\n\n**PEO 2** : Practice professionalism and high standards of ethical conducts within organization and society\n\n**PEO 3** : Responsive to changing situations by continuously acquiring new knowledge and skills\n\n**CURRENT STUDENT**\n\n**PLO 1** : Graduates are able to integrate scientific knowledge in the field of herbal technology and evaluate related processes\n\n**PLO 2** : Graduates are able to construct research project to explain phenomena studied through master’s project in the field of herbal technology\n\n**PLO 3** : Graduates are able to display the ability to clearly communicate findings, knowledge, recommendations and rationale to peers and experts in the related fields\n\n**PLO 4** : Graduates are able to demonstrate universal values in professional practices by displaying truth, intellectual integrity and ethics.\n\n**PLO 5** : Graduates are able to demonstrate contemporary knowledge to expand enquiring mind and knowledge culture.\n\n**PLO 6** : Graduates are able to organize complex matters (project/ research) and identify competitive and workable business plan\n\n**FUTURE STUDENT**\n\n**PLO 1** : Attain new frontiers of knowledge in the field of herbal science and processing technology.\n\n**PLO 2** : Solve complex problems critically and integratively using systematic approaches.\n\n**PLO 3** : Apply practical skills to solve problems in a field of herbal science and processing technology.\n\n**PLO 4** : Demonstrate effective collaboration with stakeholders professionally.\n\n**PLO 5** : Communicate effectively the knowledge, skills and ideas using appropriate methods to peers, experts and communities.\n\n**PLO 6** : Use digital technologies and appropriate softwares competently to ensure study and practice.\n\n**PLO 7** : Evaluate numerical and graphical data critically using quantitative or qualitative tools in solving problems.\n\n**PLO 8** : Demonstrate leadership, autonomy and responsibility in managing resources.\n\n**PLO 9** : Engage self-advancement through continuous learning or professional development.\n\n**PLO 10** : Demonstrate entrepreneurial skills with relevant knowledge and expertise.\n\n**PLO 11** : Demonstrate respectable ethical conducts and professionalism skills in an organization and society.\n\n**Current Student**\n\n|     |     |     |\n| --- | --- | --- |\n|     | Core Courses |     |\n| Course Code | Course Name | Credit |\n| MKKT1013 | Botany & Herbal Chemistry | 3   |\n| MKKT1023 | Herbal Quality Management | 3   |\n| MKKT1033 | Herbal Processing | 3   |\n| MKKT1043 | Product Formulation | 3   |\n| MKKT1053 | Practical Science and Herbal Technology | 3   |\n| MKKT2013 | Herbal Cosmeceutical | 3   |\n| MKKT2023 | Nutraceutical and Functional Food | 3   |\n| MKKT2053 | Legislation and Registration of Herbal Product | 3   |\n| MKKT2063 | Research Methodology and Value Creation through Innovation | 3   |\n|     | Master Project |     |\n| MKKT2014 | Master Project 1 | 4   |\n| MKKT3016 | Master Project 2 | 6   |\n|     | University General Course |     |\n| UXXX XXXX | University General Courses | 3   |\n|     | Total Credit | 40  |\n\n**Future Student**\n\n|     |     |     |\n| --- | --- | --- |\n|     | Core Courses |     |\n| Course Code | Course Name | Credit |\n| METT1013 | Botany & Herbal Chemistry | 3   |\n| METT1023 | Herbal Quality Management | 3   |\n| METT1033 | Herbal Processing | 3   |\n| METT1043 | Product Formulation | 3   |\n| METT1053 | Practical Science and Herbal Technology | 3   |\n| METT2013 | Herbal Cosmeceutical | 3   |\n| METT2023 | Nutraceutical and Functional Food | 3   |\n| METT2053 | Eksekutif halal profesional | 3   |\n| METT2063 | Research Methodology and Value Creation through Innovation | 3   |\n|     | Master Project |     |\n| METT2014 | Master Project 1 | 4   |\n| METT3016 | Master Project 2 | 6   |\n|     | University General Course |     |\n| UXXX XXXX | University General Courses | 3   |\n|     | Total Credit | 40  |\n\nCandidates must hold a Bachelor Degree in any field of engineering, science or technology with Cumulative Grade Point Average (CGPA) of at least 3.0/4.0 or equivalent from Universiti Teknologi Malaysia or any other Institutions of Higher Learning recognized by the Senate."
}