{
  "markdown": "Laboratory Visit to Institute of High Voltage and High Current\n==============================================================\n\nby [powerpic](https://fke.utm.my/author/powerpic/ \"Posts by powerpic\")\n | Oct 22, 2017 | [POWER](https://fke.utm.my/category/power/)\n\n![](https://fke.utm.my/wp-content/uploads/2017/10/Lab-Visit1-980x588.jpg)\n\nOn 22 October 2017, students undertaking the course “Introduction to Electrical Engineering” had the opportunity to visit the high voltage laboratory of the Institute of High Voltage and High Current, Universiti Teknologi Malaysia, Johor. The main objectives of the visit to the Institute of High Voltage and High Current were to allow the students to gain exposure on high voltage engineering and be aware of the responsibilities of electrical/electronic engineers in high voltage industries. The visit was necessary for the students to fulfill part of the requirements for completing the course “Introduction to Electrical Engineering”, where at the end of the 12-week course, the students were expected to be able to (i) analyse the responsibilities of engineers to the society; (ii) explain the importance of sustainable solutions; (iii) be accountable on assigned tasks in an ethical manner; and (iv) manage a project. The visit to the Institute of High Voltage and High Current was fruitful for the students where the students had the chance to tour around the laboratory to understand various high voltage generation processes and watch a live demonstration on the flashover of a glass insulator.\n\n![lab-visit1](https://fke.utm.my/wp-content/uploads/sites/9/2017/10/Lab-Visit1-1024x614.jpg)\n\nGroup photo at the high voltage laboratory of the Institute of High Voltage and High Current, Universiti Teknologi Malaysia.\n\nBy Ir. Dr. Lau Kwan Yiew, Universiti Teknologi Malaysia.\n\nAbout Institute of High Voltage and High Current\n\nThe Institute of High Voltage and High Current (IVAT) of the Faculty of Electrical Engineering, Universiti Teknologi Malaysia was established in 1991. It was initially an educational laboratory which provides facilities for carrying out experiments, research and consultancy services in high voltage engineering beginning as early as the 1970s. More details about the Institute of High Voltage and High Current can be found [here](http://ivat.utm.my/about-us/)\n.\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/laboratory-visit-to-institute-of-high-voltage-and-high-current#)"
}