{
  "markdown": "Academic Office : +607-5333716 | Email : academic-fcee@utm.my | Administration Office : +607-5533499 [fcee@utm.my](mailto:fcee@utm.my)\n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n![](https://fkt.utm.my/wp-content/uploads/2023/03/METW-724x1024.jpg \"METW\")\n\n###### _Updated : 10 March 2023_\n\n**MASTER OF SCIENCE (M.Sc) IN SAFETY, HEALTH AND ENVIRONMENT (SHE)**\n\nStricter and stricter compliances imposed by the authorities in regards to the safety, health and environmental (SHE) aspects in the workplace have led to increasing demands for competent and professional SHE workforces in all sectors of industries. Master of (Science, Health and Environment) offers a great platform to produce graduates who master the advanced SHE knowledge and competency. This program is also recognized by the Malaysian Department of Occupational Safety and Health (DOSH) as a training centre for Safety and Health Officers (SHOs). Hence, our graduates could directly apply for SHOs from the DOSH after graduation (i.e., providing the requirements by the DOSH are fulfilled). The program's courses are highly relevant, and the contents of the courses are continuously updated to ensure our graduates are well-equipped to serve their best in the area of SHE wherever they are working.\n\nMaster of Science (Safety, Health and Environment) by Taught Course is suitable for any bachelor graduates from engineering, science, and technology field. Graduates from other disciplines with relevant experiences are also encouraged to apply.\n\n*   [Programme Specifications](https://fkt.utm.my/msc-safety-health-and-environment#)\n    \n*   [Programme Educational Objectives (PEO)](https://fkt.utm.my/msc-safety-health-and-environment#)\n    \n*   [Programme Learning Outcomes (PLO)](https://fkt.utm.my/msc-safety-health-and-environment#)\n    \n*   [Program Structure](https://fkt.utm.my/msc-safety-health-and-environment#)\n    \n*   [Career opportunities](https://fkt.utm.my/msc-safety-health-and-environment#)\n    \n*   [Entry requirement](https://fkt.utm.my/msc-safety-health-and-environment#)\n    \n\nThe UTM Master of Science (Safety, Health & Environment) programme is offered on a fulltime basis at the UTM main campus in Johor Bahru and also on a part-time basis (Offshore) (weekend classes) in Kuala Lumpur. The duration of the study is one to three years for fulltime and two to four years for part-time. This programme is open for any graduate with a degree in science, technology and engineering. Graduates from other disciplines but with  \nrelevant experiences are also encouraged to apply.\n\n|     |     |\n| --- | --- |\n| PEO 1 | Mastery of knowledge and competency in advanced areas of Safety, Health and Environment |\n| PEO 2 | Practice professionalism and high standards of ethical conducts within organization and society |\n| PEO 3 | Responsive to changing situations by continuously acquiring new knowledge and skills |\n\n \n\n|     |     |     |     |\n| --- | --- | --- | --- |\n| PLO 1 | Synthesize complex information, specialized concepts, theories, methods and practice independently in the field of safety, health and environment. | Knowledge and Understanding | Technical |\n| PLO 2 | Construct solutions to complex problems or issues in the field of safety, health and environment . | Cognitive Skills |\n| PLO 3 | Apply practical skills involving the use of equipment, devices and technology based on the latest knowledge  in the field of safety, health and environment. | Practical Skills |\n| PLO 4 | Demonstrate effective collaboration with different people in learning and working, ethically and professionally. | Interpersonal Skills |\n| PLO 5 | Communicate effectively the results of scholarly work to peers, experts and non-experts. | Communication Skills | Generic |\n| PLO 6 | Use digital technologies competently to support research work or studies in the field of safety, health and environment. | Digital Skills | Technical |\n| PLO 7 | Analyze numerical and graphical data using quantitative and qualitative methods related to the field of safety, health and environment. | Numeracy Skills |\n| PLO 8 | Demonstrate leadership, autonomy and responsibility in the context of complex application and unpredictable situation. | Leadership, Autonomy and Responsibility | _Generic_ |\n| PLO 9 | Demonstrate self-advancement through continuous academic and  professional development. | Personal Skills |\n| PLO 10 | Initiate entrepreneurial projects with relevant knowledge and expertise. | Entrepreneurial Skills |\n| PLO 11 | Demonstrate adherence to ethical and professional codes of practice  in advising and decision making. | Ethics and Professionalism Skills |\n\n|     |     |     |\n| --- | --- | --- |\n| **Mainstream (special program)** |     | **Offshore** |\n| 6 max semesters \\| 3 min semesters |     | 8 max semesters \\| 4 min semesters |\n|     |     |     |\n| **LIST OF COURSES \\| sem 1** |     | **LIST OF COURSES \\| sem 1** |\n| MKKH 1313 SHE Legislations |     | MKKH 1313 SHE Legislations |\n| MKKH 1113 Research Methodology & Design of Experiment |     | MKKH 1113 Research Methodology & Design of Experiment |\n| MKKH 1213 Risk Assessment & Accident Modelling |     | MKKH 1213 Risk Assessment & Accident Modelling |\n| MKKH1423 Occupational Heath & Diseases |     | MKKH1423 Occupational Heath & Diseases |\n| MKKH 1523 Pollution Control Technology |     |     |\n|     |     |     |\n| **LIST OF COURSES \\| sem  2** |     | **LIST OF COURSES \\| sem 2** |\n| MKKH 1323 Safety Management Systems |     | MKKH 1523 Pollution Control Technology |\n| MKKH 1614 SHE Project 1 |     | MKKH 1323 Safety Management Systems |\n| U\\*\\* \\*\\*\\*3 University General Elective |     | MKKH 1513 Environmental Management |\n| MKKH 1513 Environmental Management |     | MKKH 1413 Industrial Hygiene |\n| MKKH 1413 Industrial Hygiene |     |     |\n| **LIST OF COURSES \\| sem 3** |     | **LIST OF COURSES \\| sem 3** |\n| MKKH 1626 SHE Project 2 |     | MKKH 1614 SHE Project 1 |\n| _Elective 1_ |     | U\\*\\* \\*\\*\\*3 University General Elective |\n| _Elective 2_ |     | _Elective 1_ |\n| _Elective 3_ |     | **LIST OF COURSES \\| sem 4** |\n|     |     | MKKH 1626 SHE Project 2 |\n|     |     | _Elective 2_ |\n|     |     | _Elective 3_ |\n\nGraduate with Master of Science in Safety, Health, and Environment has broadening areas to choose for career development. International and local companies are always interested to hire graduate with Master of Science in Safety, Health, and Environment.\n\n*   Candidate must hold a Bachelor Degree in any field of science, technology or engineering with CGPA at least 3.0/4.0 (or equivalent) from Recognised Higher Learning Institution.  For those having CGPA less than that, Appendix B of UTM entry qualification will be followed.\n*   Candidates with other academic backgrounds must have at least 3 years minimum working experience in the field of safety, health or environment."
}