{
  "markdown": "About **Us**\n\n[HOME](https://space.utm.my/)\n > ABOUT US\n\n**Welcome Message from Dean**\n=============================\n\n### School of Professional and Continuing Education (SPACE) UTM\n\nSchool of Professional and Continuing Education (SPACE) UTM was established in 1993. The main objective was to be a center of excellence in providing professional continuing education for career advancement. SPACE believes in the lifelong learning philosophy that everyone can be educated regardless of his or her age and prior academic background. Our focus is to provide a learning platform such as mainstream academic programmes being offered on a part-time basis to accommodate the working communities throughout Malaysia. SPACE provides opportunities for working adults to gain higher education without them leaving their workplaces.\n\nStarting in the 1995/1996 academic session, SPACE offered 8 programmes of which three were Diploma Programmes and five degree programmes. Currently, SPACE collaborates with 14 private colleges throughout Malaysia to offer UTM Diploma and Degree programmes.\n\nFrom a humble beginning at the registrar office of UTM, SPACE is currently operating at Block T05, UTM Johor Bahru, and Level 2, UTM Residency, Kuala Lumpur. Several new programmes are being offered such as Foundations, Bachelor of General Studies, Bachelor of Business Administration (International Business), and International Degree Programmes. SPACE is led by a Dean and assisted by two Deputy Dean. SPACE also manages the franchising of UTM academic programmes locally and abroad.\n\n**PROF. DR. MOHD SHAHRIZAL BIN SUNAR**  \nDean  \nSchool of Professional and Continuing Education (SPACE) UTM\n\nFacts About SPACE UTM\n=====================\n\nOn 15 October 1992, the Ministry of Education Malaysia had approved for the establishment of School for Continuing Education for UTM to promote lifelong learning programmes. The School was officially launched in July 1993 and known as the School of Professional and Continuing Education (SPACE). Initially, SPACE offered part-time UTM academic programmes in collaboration with UTM faculties and conducted short courses and Seminars.\n\nIn 2010. SPACE managed UTM Centre for Diploma Studies and UTM Franchise Management Unit which offered UTM Diploma programmes.\n\nCurrently, SPACE is actively involved in offering and conducting UTM academic programs such as Foundation, Diploma and Degree either on a full-time or part-time basis. SPACE is led by a Dean and assisted by two Deputy Dean. SPACE also manages the franchising of UTM academic programmes locally and abroad.\n\n##### (update : 11 July 2023)\n\nFacts & Figures\n\n\\*As at December 2023\n\n2453\n----\n\nUndergraduate Students Full-time\n\n4861\n----\n\nUndergraduate Students Part-time\n\n**Programme Offered**\n\nSPACE offers the following programmes:\n\n1\\. UTM academic programmes. All academic programmes offered are subjected to UTM academic regulations.\n\n2\\. UTM joint/collaboration programmes. The joint/collaboration programmes are conducted through collaboration with private colleges across the country. Currently, 14 private colleges are verified to deliver UTM joint/collaboration programmes.\n\n3\\. Transnational programmes. UTM gives SPACE the responsibility to implement UTM academic programmes through a franchise approach, offshore, or hybrid mode.\n\n(update: 31 May 2023)\n\nFoundation Programme\n--------------------\n\nFull-time Programme\n\nDiploma Programme\n-----------------\n\nFull-time and Part-time Programme\n\nDegree Programme\n----------------\n\nFull-time and Part-time Programme\n\nVISION\n\nTo be an International Centre of Excellence in Lifelong Learning\n\nMISSION\n\nTo provide quality Lifelong Learning Programmes that are widely accessible, customized and flexible that meet customer needs and expectations\n\nMOTTO\n\nAnyone  \nAnything  \nAnywhere  \nAnytime\n\nCORE VALUES\n\nIntelligence  \nQuality  \nGlobal  \nSynergy\n\n**HISTORY**\n===========\n\n2023\n====\n\nSPACE Celebrated 30th Anniversary\n\n2016 – 2018\n===========\n\n**2016**  \nPUPW Programme launched\n\n**2017**  \nUTM International International Degree Programme launched on full- time basis\n\n**2018**  \nSPACE celebrated 25th anniversary\n\nNew Program launched UTM Foundation Programme, Bachelor of General Studies, and Bachelor of Business Administration\n\nTransnational Education Qaiwan University (Kurdistan), NIBM (Sri Lanka), AVID College (Maldives), Malaysian Consortium for Education Mauritius (Mauritius)\n\n2013 – 2015\n===========\n\n**2013**  \nSPACE celebrated 20th anniversary\n\n**2015**  \nOffered full-time diploma programmes\n\n2010\n====\n\n**2010**  \nManaged UTM College of Science and Technology and the Joint Programme Management Unit\n\n1993 – 2000\n===========\n\n**1993**  \nSPACE started operation at UTM main campus in Johor Bahru\n\n**1995/96**  \nOffered part-time academic programmes  \nSet up branch office at UTM City Campus, Kuala Lumpur\n\n**1996/97**  \nManaged UTM Joint Programmes\n\n**1998**  \nBecame the secretariat of the Distance Learning Study Programme\n\n**1999/2000**  \nSPACE exclusively handled the Part-Time Study Programme and Distance Learning Study Programme for Diploma and Bachelor’s degree level\n\n**2000**  \nPurchased 10 units of shoplots at Taman University, Skudai and converted into office for SPACE staff"
}