{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/program-libatsama-komuniti-pensyarah-dan-pelajar-fabu-di-sm-pendidikan-khas-vokasional-indahpura-kulai#)\n    \n*   [Instagram](https://builtsurvey.utm.my/program-libatsama-komuniti-pensyarah-dan-pelajar-fabu-di-sm-pendidikan-khas-vokasional-indahpura-kulai#)\n    \n*   [RSS](https://builtsurvey.utm.my/program-libatsama-komuniti-pensyarah-dan-pelajar-fabu-di-sm-pendidikan-khas-vokasional-indahpura-kulai#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/program-libatsama-komuniti-pensyarah-dan-pelajar-fabu-di-sm-pendidikan-khas-vokasional-indahpura-kulai#)\n    \n*   [Instagram](https://builtsurvey.utm.my/program-libatsama-komuniti-pensyarah-dan-pelajar-fabu-di-sm-pendidikan-khas-vokasional-indahpura-kulai#)\n    \n*   [RSS](https://builtsurvey.utm.my/program-libatsama-komuniti-pensyarah-dan-pelajar-fabu-di-sm-pendidikan-khas-vokasional-indahpura-kulai#)\n    \n\nProgram Libatsama Komuniti Pensyarah dan Pelajar FABU di SM Pendidikan Khas Vokasional Indahpura, Kulai\n=======================================================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Sep 8, 2019 | [Conference & Seminar](https://builtsurvey.utm.my/category/conference-seminar/)\n, [CSR](https://builtsurvey.utm.my/category/csr/)\n, [News](https://builtsurvey.utm.my/category/news/)\n, [photo](https://builtsurvey.utm.my/category/photo/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2019/09/7-1080x640-1080x640.jpg)\n\nSekumpulan pensyarah dan pelajar daripada Fakulti Alam Bina dan Ukur (FABU), UTM telah berjaya melaksanakan program bersama komuniti, iaitu Mitigasi Perubahan Iklim Libatsama Komuniti di SMPK Vokasional Indahpura, Kulai, Johor.\n\nProgram ini adalah sebahagian daripada Program Matematik Pendidikan Islam Pendidikan Moral Literasi Komputer (MaPIML FIESTA) yang dianjurkan oleh pihak sekolah.\n\nProgram ini bertujuan untuk mendedahkan kepada pelajar berkenaan isu pemanasan global dengan menggabungkan pelbagai teknik pembelajaran, iaitu pameran, taklimat ringkas, dan permainan yang berdasarkan kepada punca dan kesan pemanasan global, serta kaedah untuk mengurangkan pemanasan global daripada terus berlaku.\n\nSelain itu, para peserta juga diberikan maklumat berkenaan ilmu falak dan astronomi, terutama berkaitan sistem matahari dan planet-planet sistem suria.\n\nAktiviti yang pertama adalah pengumpulan maklumat, di mana para peserta akan mengunjungi pameran yang ada, dan mengumpul maklumat daripada pameran itu. Selepas selesai sesi pameran, para peserta kemudiannya diberikan taklimat berkaitan astronomi oleh Dr Othman bin Zainon. Dalam sesi ini juga, peserta diminta untuk membina jam matahari menggunakan peralatan yang disediakan.\n\nSelepas sesi taklimat, aktiviti seterusnya adalah sesi permainan. Sesi ini bertujuan untuk menerangkan beberapa kaedah yang boleh dilaksanakan bagi mengurangkan pemanasan global dalam bentuk permainan. Antara permainan yang dilaksanakan adalah pembinaan kincir angin, dan padanan gambar bagi barang yang boleh dikitar semula.\n\nSemua permainan ini dikaitkan dengan isu semasa berkaitan pemanasan global, dan bagaimana pelajar-pelajar ini mampu menjadi ejen kepada pengurangan kesan kepada pemanasan global.\n\nProgram ini telah dilaksanakan bersama sekitar 150 orang pelajar sekolah. Seramai 5 orang pensyarah, diketuai oleh Dr Ainur Zaireen binti Zainuddin bersama 3 staf teknikal dan seorang pelajar daripada FABU telah bersama-sama menjayakan program ini.\n\nProgram ini telah dirasmikan penutupannya oleh Penyelaras Program Matematik Pendidikan Islam Pendidikan Moral Literasi Komputer (MaPIML FIESTA) SM Pendidikan Khas Vokasional Indahpura, Kulai, iaitu Puan Sulasteri Hairodin.\n\n[**more photos click here..**](https://builtsurvey.utm.my/photos/2019/09/program-libatsama-komuniti-pensyarah-dan-pelajar-fabu-di-sm-pendidikan-khas-vokasional-indahpura-kulai/)"
}