{
  "markdown": "MyHVnet Colloquium Sucessfully Held\n===================================\n\nby [powerpic](https://fke.utm.my/author/powerpic/ \"Posts by powerpic\")\n | Feb 10, 2016 | [POWER](https://fke.utm.my/category/power/)\n\n![2016-myhvnet-colloquium](https://fke.utm.my/wp-content/uploads/2016/12/2016-MyHVnet-Colloquium.jpg)\n\nThe 2016 MyHVnet (Malaysian High Voltage Network) Colloquium was successfully held at the Faculty of Electrical Engineering, Universiti Teknologi Malaysia, Johor Bahru on 25 January 2016. The colloquium, being a biennial key event by MyHVnet, was organised with an aim to promote networking among academicians, industrialists, and students in Malaysia for the effective communication of high voltage related research and development. The Institute of High Voltage and High Current of Universiti Teknologi Malaysia was the host institution for this very first colloquium since MyHVnet’s informal inception in 2015 by members from various Malaysian organisations, including Tenaga Nasional Berhad Research Sdn. Bhd., AM SGB Sdn. Bhd. Universiti Sains Malaysia, Universiti Malaya, Universiti Putra Malaysia, Universiti Teknologi Malaysia, Universiti Malaysia Pahang, Universiti Malaysia Perlis, Universiti Malaysia Sabah, Universiti Teknikal Malaysia Melaka, Universiti Tun Hussein Onn Malaysia, Universiti Tenaga Nasional, and Universiti Kuala Lumpur.\n\nThe 2016 MyHVnet Colloquium featured five technical tracks, i.e., lightning, insulation and electrical discharges, condition monitoring, transformers, and other high voltage related areas. For this, five invited talks associated with the tracks were delivered by working professionals from various Malaysian organisations. They are “Challenges in Condition Monitoring” by Dr. Hidayat Zainuddin from Universiti Teknikal Malaysia Melaka, “Asset Management of Transformer Fleet: An Overview” by Mr. Mohd Aizam Talib from Tenaga Nasional Berhad Research, “Comparison of Partial Discharge Models in Condition based Monitoring” by Dr. Hazlee Illias from Universiti Malaya, “The Evaluation of Lightning Return Stroke Current Using Measured Field” by Dr. Mahdi Izadi from Universiti Putra Malaysia, and “Partial Discharge Location Technique for Covered-conductor Overhead Distribution Line” by Dr. Muzamir Isa from Universiti Malaysia Perlis. In addition, the colloquium received 71 extended abstracts for oral presentations by academicians, industrialists, and students from various organisations across Malaysia; the total number of registered participants was 104.\n\nMyHVnet wishes to thank all the participants of the colloquium for sharing their work on high voltage engineering during the colloquium. MyHVnet would also like to acknowledge the committee members for their voluntary efforts and contributions for making the colloquium a success. MyHVnet Colloquium will be held again in two years’ time – see you again then!\n\nMore details on MyHVnet is available at [http://ivat.utm.my/myhvnet/](http://ivat.utm.my/myhvnet/)\n\nDr. Lau Kwan Yiew, Organising Chair, 2016 MyHVnet Colloquium\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/myhvnet-colloquium-sucessfully-held#)"
}