{
  "markdown": "Academic Office : +607-5333716 | Email : academic-fcee@utm.my | Administration Office : +607-5533499 [fcee@utm.my](mailto:fcee@utm.my)\n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n**BACHELOR OF CHEMICAL ENGINEERING (BIOPROCESS) WITH HONOURS**\n\n**Bioprocess Engineering** is an engineering dicipline where biotechnology and natural based products research are being transformed to industrial setting to fuel the current and future world economic powerhouses.  In this program, various engineering principles especially chemical and bioprocess are applied to design, develop and evaluate processes that utilize biological based materials (eg:animals, plants, microorganisms) to produce products.  Throughout our four years of intensive training and industrial exposure, students will experience state-of-the-art-technologies that will pave the way for professional bioprocess engineering qualifications.  The graduates will be well versed in mathematical-based engineering analysis that will be enable them to explain the physical, biological and chemical processes of complex biological systems and design processes that will yield products which could create wealth, promote health and promote sustainability.  The sectors served by bioprocess engineers are in the area of medical, food, environment, agriculture and many more.\n\n*   [Programme Specifications](https://fkt.utm.my/bachelor-of-engineering-chemical-bioprocess-2#)\n    \n*   [Programme Educational Objectives (PEO)](https://fkt.utm.my/bachelor-of-engineering-chemical-bioprocess-2#)\n    \n*   [Programme Learning Outcomes (PLO)](https://fkt.utm.my/bachelor-of-engineering-chemical-bioprocess-2#)\n    \n*   [Program Structure](https://fkt.utm.my/bachelor-of-engineering-chemical-bioprocess-2#)\n    \n*   [Engineering Programme Accreditation](https://fkt.utm.my/bachelor-of-engineering-chemical-bioprocess-2#)\n    \n*   [Career opportunities](https://fkt.utm.my/bachelor-of-engineering-chemical-bioprocess-2#)\n    \n*   [Entry requirement](https://fkt.utm.my/bachelor-of-engineering-chemical-bioprocess-2#)\n    \n*   [Graduation Checklist](https://fkt.utm.my/bachelor-of-engineering-chemical-bioprocess-2#)\n    \n\n|     |     |     |\n| --- | --- | --- |\n| 1.   Programme Name | Bachelor in Chemical Engineering (Bioprocess) with Honours |     |\n| 2.   Final Award | Bachelor in Chemical Engineering (Bioprocess) with Honours |     |\n| 3.   Awarding Institution | Universiti Teknologi Malaysia |     |\n| 4.   Teaching Institution | Universiti Teknologi Malaysia |     |\n| 5.   Professional or Statutory Body of Accreditation | Engineering Accreditation Council (EAC) Board of Engineers Malaysia (BEM) |     |\n| 6.   Language(s) of Instruction | English and Bahasa Melayu |     |\n| 7.   Mode of Study (Conventional, distance learning, etc) | Conventional |     |\n| 8.   Mode of operation (Franchise, self-govern, etc) | Self-governing |     |\n| 9.   Study Scheme (Full Time/Part Time) | Full Time |     |\n| 10\\. Study Duration | Minimum   : 4 yrs<br><br>Maximum  : 6 yrs |     |\n| Type of Semester | No. of Semesters | No. of weeks per semester |\n| Normal | 8   | 14  |\n| Short | 4   | 8   |\n\nAfter having exposed to 3 to 5 years working experience, our graduates should become professionals who demonstrate the following competencies:\n\n**PEO1** – Perform competently in chemical/ petroleum/ bioprocess/ gas/ nuclear Industries and become important contributors to national development.\n\n**PEO2** – Become creative, innovative and adaptable engineers as leaders or team members in their organizations and society.\n\n**PEO3** – Contribute professionally towards the environmental well-being and sustainable development\n\nAfter having completed the programme, graduates should be able to demonstrate the following competencies\n\n|     |     |\n| --- | --- |\n| **Code** | **Intended Learning Outcomes** |\n| PLO1 (KW) | Ability to apply knowledge of mathematics, natural science, engineering fundamentals, chemical/petroleum/bioprocess/ gas/nuclear engineering principles to the solution of complex<br><br>engineering problems. |\n| PLO2 (THPA) | Ability to identify, formulate, conduct research literature, and analyze complex chemical/ petroleum/ bioprocess/ gas/ nuclear engineering problems using first principles of<br><br>mathematics and engineering sciences. |\n| PLO3 (THDS) | Ability to design solution for complex chemical/ petroleum/ bioprocess/gas/nuclear engineering problems and design system or process to meet specified needs with appropriate consideration for public health and safety, cultural, societal,<br><br>and environmental considerations. |\n| PLO4 (THI) | Ability to conduct investigation of complex chemical/ petroleum/ bioprocess/ gas/ nuclear engineering problems using research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of information to provide valid<br><br>conclusions. |\n| PLO5 (SCMT) | Ability to inculcate modern computational techniques and tools complex chemical/ petroleum/ bioprocess/ gas/ nuclear which include prediction and modeling to solve complex engineering<br><br>problem with an understanding of the limitations. |\n| PLO6 (AD) | Ability to responsibly act as well as respond to the societal health, safety, environment, legal and cultural issues that are<br><br>relevant to the professional engineering practice. |\n| PLO7 (GCS) | Ability to explain and evaluate the sustainability and impact of professional engineering work in the solution of complex chemical/ petroleum/ bioprocess/ gas/ nuclear engineering<br><br>problems in societal and environmental contexts. |\n| PLO8 (GCE) | Ability to apply ethical principles and commit to professional ethics  and  responsibilities   and       norms  of          engineering<br><br>practice. |\n| PLO9 (CS) | Ability to communicate effectively through written and oral modes to all levels of society |\n| PLO10 (TW) | Ability to work independently, and as a member or a leader in a team to manage project in multi-disciplinary environment. |\n| PLO11 (SC) | Ability to acquire knowledge and engage in independent and life-long learning. |\n| PLO12 (ES) | Ability demonstrate knowledge of engineering management principles and entrepreneurial mindset to manage projects in multi-disciplinary environments. |\n\nNote: KW = Engineering Knowledge; THPA = Thinking Skills-Problem Analysis; THDS= Thinking Sills Design/Development of Solution; THI =Thinking Skills-Investigation; SCMT= Scholarship Modern Tool Usage; AD = Global Citizen Adaptability; GCS = Global Citizen Sustainability; GCE = Global Citizen Ethics; CS = Communicating Skills; TW = Leadership and Team Working; SC = Life Long Learning; ES = Enterprising Skills.\n\n[Undergraduate Guidebook 2024/2025](https://fkt.utm.my/wp-content/uploads/2024/09/GUIDEBOOK-UG-FKT-1-2024-2025.pdf)\n\n[MALAYSIAN QUALIFICATION REGISTER](https://www2.mqa.gov.my/mqr/english/epapariptaAA.cfm?IDAkrKP=16393)\n\n[ENGINEERING PROGRAMME ACCREDITATION (CPS CEA Knowledge Profile)](https://fkt.utm.my/wp-content/uploads/2020/04/ENGINEERING-PROGRAMME-ACCREDITATION-CPS-CEA-Knowledge-Profile.pdf)\n\nThe demand for Bio-process Engineers in Malaysia is enormous.  To realize Vision 2020 and beyond, the government is actively pursuing the establishment of biotechnological-based industries in Malaysia through various Economic Corridors such as Iskandar Malaysia in Johor.  The government of Malaysia’s commitment in promoting biotechnology industries is reflect in the fund allocated in the ninth Malaysia Plan and further enhanced in the tenth Malaysia Plan.  The establishment of Malaysia Biotechnology Corporation and others will nourish the expansion of existing industries while encouraging more relevant industries to participate in the new economic endeavors. Our bio-process engineers are designed to lead biotechnology related industries and equipped with versatile and balanced capability to accommodate other industries such as chemical, petroleum, polymers, oil and gas.\n\n**Malaysian**\n\n[https://admission.utm.my/undergraduate-malaysian/](https://admission.utm.my/undergraduate-malaysian/ \"Malaysian\")\n\n**International**\n\n[https://admission.utm.my/undergraduate-international/](https://admission.utm.my/undergraduate-international/ \"International\")\n\n**For further enquiries please contact:**\n\n![](https://fkt.utm.my/wp-content/uploads/2022/06/Dr-Yanti-Maslina.jpeg) **Dr. Yanti Maslina Binti Dato’ Mohd Jusoh**  \n**Program Director (BioPolymer)**  \nOffice: +607-553 5691  \nEmail : yantimaslina@utm.my"
}