{
  "markdown": "IEEE International Conference on ATNT 2024\n==========================================\n\nby [fydamohd](https://fke.utm.my/author/fydamohd/ \"Posts by fydamohd\")\n | Aug 20, 2024 | [Anouncement](https://fke.utm.my/category/anouncement/)\n, [Faculty](https://fke.utm.my/category/faculty/)\n\n![](https://fke.utm.my/wp-content/uploads/2024/08/Banner-v6-980x552.png)\n\n**Title: Non-Presenter Keynote Session Promotion for IEEE International Conference on Advanced Telecommunication and Networking Technologies (ATNT 2024)**\n\nDear all researchers and academicians,\n\nJoin us for the highlight of IEEE Advanced Telecommunication and Networking Technologies (ATNT) International Conference, our Keynote Session, featuring groundbreaking insights from renowned academician and industry trailblazers:\n\n**KEYNOTE SPEAKERS:**  \n▪Dato’ Kamarul A. Muhamed, visionary founder of Aerodyne Group , will reveal transformative potential of drone technology to create precise digital twin for the telecommunications landscape.  \n▪Dr. Waleed Ejaz from Lakehead University Canada , a leading expert in next gen 6G networks, will unravel the next frontier in wireless communication network.  \n▪Dr. Anthony Lo from Futurewei Technologies Inc. will showcase revolutionary advancements shaping a sustainable future for Internet of Things (IoT) technologies.\n\nIn less than a month, prepare to be inspired and equipped with the know-how on driving telecommunication industries’ future. Don’t miss this opportunity to engage with the vanguards of technology!\n\n**KEYNOTE SESSION DETAILS:**  \n▪ Conference Name: IEEE ATNT 2024  \n▪ Date: 9 September 2024  \n▪ Time: 9.00 am – 1.00 pm  \n▪ Fee: RM150.00  \n▪ Benue: Emeral 1-L hall, Sunway Hotel Big Box, Iskandar Puteri, Johor, Malaysia (5 km from Legoland Malaysia)\n\nAll registered Keynote Session participants are welcomed to attend the parallel technical paper presentations by international researchers at no cost in the afternoon for the following tracks :\n\n**PRESENTATION TRACKS:**  \n▪ Network & Connectivity  \n▪ Optical Communication and Photonics  \n▪ RF/Microwave Communication and Technologies  \n▪ Acoustic Communication  \n▪ Machine Learning and Artificial Intelligence for Communication\n\nRegister now via the following link and be part of the future!  \nhttps://shorturl.at/YgbZh\n\n![](https://fke.utm.my/wp-content/uploads/2024/08/Banner-v6.png)\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/ieee-international-conference-on-atnt-2024-2#)"
}