{
  "markdown": "Monthly Talk of Institute of High Voltage and High Current Succesfully Held\n===========================================================================\n\nby [website](https://fke.utm.my/author/website/ \"Posts by website\")\n | Sep 12, 2019 | [POWER](https://fke.utm.my/category/power/)\n\n![](https://fke.utm.my/wp-content/uploads/2020/02/power2.jpg)\n\n<img class=”alignnone wp-image-11323″ src=”http://ee.utm.my/wp-content/uploads/2019/09/Talk-Aug19-1024×768.jpg” alt=”” width=”460″ height=”345″ />\n\nDr. Hafizi in action\n\n&nbsp;\n\nAs part of the activities of the Institute of HIgh Voltage and High Current (IVAT), School of Electrical Engineering, a monthly talk on Partial Discharge was successfully conducted on 28th August 2019 at IVAT’s Seminar Room. This informative talk was given by Dr. Mohd Hafizi Ahmad (IVAT), an expert in partial discharge study. The 2-hour talk began at 10.00 a.m. with registration from participants and ended at 12 noon. Approximately 15 participants attended the talk, with majority of them being IVAT’s staff and postgraduate students, while some of the participants were from industry. It is hoped that the main objective of this talk, that is to encourage knowledge transfer among IVAT staff, public and student, is achieved throughout this activity. IVAT will continuously help the university in sharing our knowledge and expertise to ensure the university is always at the forefront of science and technology development.\n\n&nbsp;\n\n<img class=”alignnone wp-image-11324″ src=”http://ee.utm.my/wp-content/uploads/2019/09/Talk2-Aug19.jpg” alt=”” width=”721″ height=”293″ />  \n<p style=”text-align: left;”>Group photo</p>  \n&nbsp;\n\nBy Dr. Noor Azlinda Ahmad, Universiti Teknologi Malaysia\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/monthly-talk-of-institute-of-high-voltage-and-high-current-succesfully-held#)"
}