{
  "markdown": "Academic Office : +607-5333716 | Email : academic-fcee@utm.my | Administration Office : +607-5533499 [fcee@utm.my](mailto:fcee@utm.my)\n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n**BACHELOR OF CHEMICAL ENGINEERING (GAS) with HONOURS**\n\nGas Engineering is a field of profession that involved activities such as gas processing, pipeline transmission & distribution and gas utilization. Skills and expertise in the process design, installation, system operation, project supervision, research and management are important to ensure those activities are performed in a safe and efficient manner for the benefit of mankind. With the 84.9 trillion cubic feet (2004) gas reserves,  Malaysia is in need of skill manpowers in gas engineering area in order to utilize this energy that is estimated to last for about 6o years. Malaysia is 16th in the list of world gas reserves. In 1984, the first Gas Processing Plant in Peninsular Malaysia (Terengganu) was launched. This mark the beginning of gas era in Malaysia that was followed by the implementation of peninsular gas utilization projects. \n\n**Read more…**\n\nGas engineer has been in high demand to meet the increasing manpower requirement to support the numerous gas projects. These are in the area of gas liquefaction,  gas processing, petrochemical processing and the delivery of gas to the power plant, industrial user, commercial center, domestic consumer throughout peninsular Malaysia. A combination of chemical process and gas engineering knowledge make it a uniquely distinct engineering discipline as the graduate can work as a chemical and process engineer as well as gas engineer for transportation and gas utilization.\n\nKnowledge in chemical engineering will enable the graduates to also work  in petrochemical industries, oleo chemical industries, manufacturing industries, governmental and private sectors. Our graduates can apply to company such as PETRONAS, SHELL, EXXONMOBIL, Energy Commission of Malaysia, Gas Malaysia Sdn Bhd,  SIRIM, DOSH, NIOSH, Consultant company and service industry. Chemical (gas) graduates can also involve in teaching and R&D  at higher learning institutions and research centers.\n\n*   [Programme Specifications](https://fkt.utm.my/bachelor-of-chemical-gas-2#)\n    \n*   [Programme Educational Objectives (PEO)](https://fkt.utm.my/bachelor-of-chemical-gas-2#)\n    \n*   [Programme Learning Outcomes (PLO)](https://fkt.utm.my/bachelor-of-chemical-gas-2#)\n    \n*   [Program Structure](https://fkt.utm.my/bachelor-of-chemical-gas-2#)\n    \n*   [Engineering Programme Accreditation](https://fkt.utm.my/bachelor-of-chemical-gas-2#)\n    \n*   [Career opportunities](https://fkt.utm.my/bachelor-of-chemical-gas-2#)\n    \n*   [Entry requirement](https://fkt.utm.my/bachelor-of-chemical-gas-2#)\n    \n*   [Graduation Checklist](https://fkt.utm.my/bachelor-of-chemical-gas-2#)\n    \n\n|     |     |     |\n| --- | --- | --- |\n| 1.   Programme Name | Bachelor in Chemical Engineering (Gas) with Honours |     |\n| 2.   Final Award | Bachelor of Chemical Engineering (Gas) with Honours |     |\n| 3.   Awarding Institution | Universiti Teknologi Malaysia |     |\n| 4.   Teaching Institution | Universiti Teknologi Malaysia |     |\n| 5.   Professional or Statutory Body of Accreditation | Engineering Accreditation Council (EAC) Board of Engineers Malaysia (BEM) |     |\n| 6.   Language(s) of Instruction | English and Bahasa Melayu |     |\n| 7.   Mode of Study (Conventional, distance learning, etc) | Conventional |     |\n| 8.   Mode of operation (Franchise, self-govern, etc) | Self-governing |     |\n| 9.   Study Scheme (Full Time/Part Time) | Full Time |     |\n| 10\\. Study Duration | Minimum   : 4 yrs<br><br>Maximum  : 6 yrs |     |\n| Type of Semester | No. of Semesters | No. of weeks per semester |\n| Normal | 8   | 14  |\n| Short | 4   | 8   |\n\nAfter having exposed to 3 to 5 years working experience, our graduates should become professionals who demonstrate the following competencies:\n\n**PEO1** – Perform competently in chemical/ petroleum/ bioprocess/ gas/ nuclear Industries and become important contributors to national development.\n\n**PEO2** – Become creative, innovative and adaptable engineers as leaders or team members in their organizations and society.\n\n**PEO3** – Contribute professionally towards the environmental well-being and sustainable development\n\nAfter having completed the programme, graduates should be able to demonstrate the following competencies\n\n|     |     |\n| --- | --- |\n| Code | Intended Learning Outcomes |\n| PLO1 | Ability to apply knowledge of mathematics, natural science, engineering fundamentals,  <br>chemical/petroleum/bioprocess/gas/nuclear engineering principles to the solution of  <br>complex engineering problems. |\n| PLO2 | Ability to identify, formulate, conduct research literature, and analyze complex engineering  <br>problems using first principles of mathematics and engineering sciences. |\n| PLO3 | Ability to design solution for complex engineering problems and design system or process  <br>to meet specified needs with appropriate consideration for public health and safety,  <br>cultural, societal, and environmental considerations. |\n| PLO4 | Ability to conduct investigation of complex engineering problems using research-based  <br>knowledge and research methods including design of experiments, analysis and  <br>interpretation of data, and synthesis of information to provide valid conclusions. |\n| PLO5 | Ability to inculcate modern computational techniques and tools which include prediction  <br>and modelling to solve complex engineering problem with an understanding of the  <br>limitations. |\n| PLO6 | Ability to responsibly act as well as respond to the societal health, safety, environment,  <br>legal and cultural issues that are relevant to the professional engineering practice. |\n| PLO7 | Ability to explain and evaluate the sustainability and impact of professional engineering  <br>work in the solution of complex engineering problems in societal and environmental  <br>contexts. |\n| PLO8 | Ability to apply ethical principles and commit to professional ethics and responsibilities  <br>and norms of engineering practice |\n| PLO9 | Ability to communicate effectively through written and oral modes to all levels of society |\n| PLO10 | Ability to work independently, and as a member or a leader in a team to manage project  <br>in multi-disciplinary environment. |\n| PLO11 | Ability to acquire knowledge and engage in independent and life-long learning. |\n| PLO12 | Ability demonstrate knowledge of engineering management principles and  <br>entrepreneurial mindset to manage projects in multi-disciplinary environments. |\n\n[Undergraduate Guidebook 2024/2025](https://fkt.utm.my/wp-content/uploads/2024/09/GUIDEBOOK-UG-FKT-1-2024-2025.pdf)\n\n[MALAYSIAN QUALIFICATION REGISTER](https://www2.mqa.gov.my/mqr/english/epapariptaAA.cfm?IDAkrKP=16393)\n\n[ENGINEERING PROGRAMME ACCREDITATION (CPS CEA Knowledge Profile)](https://fkt.utm.my/wp-content/uploads/2020/04/ENGINEERING-PROGRAMME-ACCREDITATION-CPS-CEA-Knowledge-Profile.pdf)\n\nThe gas era and the country’s 2020 vision have spawned the development of the gas industry, such as gas processing, transmission, distribution and utilization, and as well as petrochemical industry. These industries need manpower equipped with technical expertise in both chemical and gas engineering. Students who graduate as a chemical-gas engineer have a wide base of career choices from either in pure chemical engineering to gas engineering background. They can also easily adapt themselves in public and as well as private sectors. These include government agency, research and development centre, higher learning institution and many others.\n\n**Malaysian**\n\n[https://admission.utm.my/undergraduate-malaysian/](https://admission.utm.my/undergraduate-malaysian/ \"Malaysian\")\n\n**International**\n\n[https://admission.utm.my/undergraduate-international/](https://admission.utm.my/undergraduate-international/ \"International\")\n\n![Dr. Hasrinah Hasbullah](https://fkt.utm.my/wp-content/uploads/2022/06/Dr-Hasrinah.png)  **Dr. Hasrinah Hasbullah  \n  Program Director (Chemical-Gas)**  \n  Office: +607553 5582  \n  Email: hasrinah@utm.my"
}