{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/program-senibina-telah-mengadakan-sesi-dialog-bersama-panel-industri-penasihat-terkemuka#)\n    \n*   [Instagram](https://builtsurvey.utm.my/program-senibina-telah-mengadakan-sesi-dialog-bersama-panel-industri-penasihat-terkemuka#)\n    \n*   [RSS](https://builtsurvey.utm.my/program-senibina-telah-mengadakan-sesi-dialog-bersama-panel-industri-penasihat-terkemuka#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/program-senibina-telah-mengadakan-sesi-dialog-bersama-panel-industri-penasihat-terkemuka#)\n    \n*   [Instagram](https://builtsurvey.utm.my/program-senibina-telah-mengadakan-sesi-dialog-bersama-panel-industri-penasihat-terkemuka#)\n    \n*   [RSS](https://builtsurvey.utm.my/program-senibina-telah-mengadakan-sesi-dialog-bersama-panel-industri-penasihat-terkemuka#)\n    \n\nProgram Senibina telah mengadakan sesi dialog bersama Panel Industri Penasihat Terkemuka\n========================================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Sep 28, 2020 | [News](https://builtsurvey.utm.my/category/news/)\n, [photo](https://builtsurvey.utm.my/category/photo/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2020/09/120391183_3661616130550433_7833899212487805197_o-1080x675.jpg)\n\nProgram Senibina telah mengadakan sesi dialog bersama Panel Industri Penasihat terkemuka, bertempat di Universiti Teknologi Malaysia, Kuala Lumpur Jalan Semarak pada 24 September 2020. Sesi ini dihadiri oleh empat Panel Penasihat Industri yang mempunyai kepakaran dalam bidang seni bina, mereka terdiri daripada Dato’ Ar Nur Haizi Binti Abdul Hai, Dato’ Ar Ezumi Harzani bin Ismail, Ar Saifudin bin Ahmad dan Ar Jasmeet Pal Singh Sidhu bersama staf akademik, pentadbiran dari program Senibina. Sesi dialog ini berjaya memenuhi pelbagai aspek objektif program. Ia dapat merangkumi perkara-perkara seperti memperoleh nasihat mengenai relevansi kurikulum seni bina supaya sesuai dengan keperluan industri semasa; membincangkan cabaran kritikal di pasaran yang berkaitan dengan disiplin seni bina profesional dan persekitaran binaan; mendapatkan nasihat mengenai pendekatan terbaik untuk pendedahan pelajar kepada amalan industri; mendapatkan nasihat mengenai cara membuat pautan yang mampu memudahkan dan meningkatkan kebolehpasaran graduan; meminta nasihat mengenai kaedah untuk memperkukuhkan lagi hubungan antara program seni bina profesional dengan industri nasional dan antarabangsa untuk memenuhi keperluan badan profesional; mendapatkan nasihat mengenai cara membuat pautan yang dapat memfasilitasi kerjasama penyelidikan antara program seni bina dengan industri. Sesi dialog yang berlangsung selama sehari ini dapat memberi faedah bersama kepada kedua-dua belah pihak dan sangat bermanfaat untuk pembangunan program seni bina serta perancangan penggantian di masa hadapan. Semoga pelbagai sesi bersama panel industri penasihat yang dilantik dapat dijalankan pada masa akan datang untuk memastikan kualiti program Senibina dari segi menghasilkan graduan yang mencapai matlamat pasaran dan kurikulum untuk masa hadapan.\n\n[**more photos click here..**](https://builtsurvey.utm.my/photos/2020/09/program-senibina-telah-mengadakan-sesi-dialog-bersama-panel-industri-penasihat-terkemuka/)"
}