{
  "markdown": "Research and Training Collaboration between IVAT and Behr Bircher Cellpack Malaysia Sdn. Bhd.\n=============================================================================================\n\nby [powerpic](https://fke.utm.my/author/powerpic/ \"Posts by powerpic\")\n | Apr 4, 2017 | [POWER](https://fke.utm.my/category/power/)\n\n![](https://fke.utm.my/wp-content/uploads/2017/04/IVAT-BBC-JV1-980x735.jpg)\n\nStaff from the the Institute of High Voltage and High Current (IVAT) / Department of Electrical Power Engineering (POWER), have embarked in a joint-venture project, namely as “Research and Testing Collaborations on Power Cable Transition Joints”, with Behr Bircher Cellpack Malaysia Sdn. Bhd. (BBCMY). The project consists of 5 modules; 1) Introduction to Cellpack products, 2) Paper insulation lead cable (PILC) and cross-linked polyethylene (XLPE) cables construction, 3) Introduction to PILC-XLPE transition cable joint component, 4) Transition joint installation steps and 5) Laboratory testing. Modules 1 to 4 were conducted as a 1-day training and hands-on sessions at the BBCMY factory in Gelang Patah, while Module 5 was carried out as a 2-day laboratory testing work at IVAT. A team of 4 members of academic staff and 1 member of technical staff from IVAT participated the 1-day training. The training started at 9:00 am on 22 February 2017, welcomed by the BBCMY’s Managing Director, Mr. Hanspeter Ritzmann and facilitated by two experienced engineers from the company, Mr. Sapto Endar Djuniarso (Technical Engineer) and Mr. Dody Ismoyo (Application Technology Engineer). During the 1-day training session, the participants were theoretically and practically exposed to the construction, components selection, and installation steps of a PILC-XLPE transition cable joint. All these processes were demonstrated in detail step-by-step by both the facilitators. The training session of Modules 1 to 4 was concluded at 5:30 pm with a brief gratuity speech by both parties. The Module 5, which was the 2-day laboratory testing work on the constructed PILC-XLPE transition cable joint, was then carried out in IVAT on 13-14 March 2017. The testing work was led by Dr. Lau Kwan Yiew and Dr. Noor Azlinda and assisted by IVAT’s technical staff. In accordance to Cenelec HD 629.2 S2:2006 standard, the cable joint was tested under three tests; 1) AC power frequency voltage, 2) DC voltage and 3) lightning impulse voltage. The testing work was successfully completed at 5:00 pm on the second day.\n\n![ivat-bbc-jv3](https://fke.utm.my/wp-content/uploads/2017/04/IVAt-BBC-JV3.jpg)\n\nMr. Sapto (third from left) and Mr. Dody (sixth from left) were explaining the theoretical lesson on cable joint transition during the training session at BBCMY Gelang Patah.\n\n![ivat-bbc-jv2](https://fke.utm.my/wp-content/uploads/2017/04/IVAT-BBC-JV2.jpg)\n\nThe facilitators were demonstrating the PILC-XLPE transition cable joint processes.\n\n![ivat-bbc-jv1](https://fke.utm.my/wp-content/uploads/2017/04/IVAT-BBC-JV1.jpg)\n\nThe completed PILC-XLPE transition cable joint.\n\n![ivat-bbc-jv4](https://fke.utm.my/wp-content/uploads/2017/04/IVAt-BBC-JV4.jpg)\n\nGroup photo of the training participants; from left, Dr. Hafizi, Dr. Azlinda, Dr. Mona, Mr. Hairoisyam and Dr. Zulkarnain, and the facilitators; Mr. Sapto and Mr. Dody.\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/research-and-training-collaboration-between-ivat-and-behr-bircher-cellpack-malaysia-sdn-bhd#)"
}