{
  "markdown": "Short Course on High Voltage Engineering Successfully Held\n==========================================================\n\nby [powerpic](https://fke.utm.my/author/powerpic/ \"Posts by powerpic\")\n | Mar 7, 2018 | [POWER](https://fke.utm.my/category/power/)\n\n![](https://fke.utm.my/wp-content/uploads/2018/03/Shortcourse5a.jpg)\n\nThe Institute of High Voltage and High Current (IVAT) successfully organised the Short Course on High Voltage Engineering for the participants from the University College of Technology Sarawak (UCTS) from 25 February to 1 March 2018. Through the short course, the participants were exposed to the concept and theory of gaseous, liquid and solid insulation breakdown. The participants also learned the key principles of high voltage technology as well as insulation testing, including the generation and measurement of high voltage, with appropriate safety considerations. The participants also had hands-on experience to construct and conduct experiments relevant to high voltage engineering. In addition, the participants also had the opportunity to have a complete tour of the laboratory and equipment at IVAT and understand the daily operational needs of the high voltage laboratory at IVAT. A fruitful discussion session on potential collaborations between IVAT and UCTS was also carried out, where IVAT and UCTS are expected to strengthen their tie on high voltage related matters in the future. The facilitators of the short course, Assoc. Prof. Dr. Mohamed Afendi Mohamed Piah, Dr. Noor Azlinda Ahmad and Ir. Dr. Lau Kwan Yiew, wish to thank the participants for their keen interest and active participation during the short course. IVAT sincerely hopes that the five-day short course equips the participants with the appropriate knowledge on high voltage engineering and helps the participants on future matters relevant to high voltage engineering.\n\n![](http://ivat.utm.my/wp-content/uploads/sites/9/2018/03/Shortcourse6-1024x683.jpg)\n\nGroup photo\n\n![](http://ivat.utm.my/wp-content/uploads/sites/9/2018/03/Shortcourse4-1024x576.jpg)\n\nParticipants of the short course\n\n![](http://ivat.utm.my/wp-content/uploads/sites/9/2018/03/Shortcourse5-1024x576.jpg)\n\nLaboratory hands-on session\n\n![](http://ivat.utm.my/wp-content/uploads/sites/9/2018/03/Shortcourse8-576x1024.jpg)\n\nDiscussion session\n\nby Ir. Dr. Lau Kwan Yiew, Universiti Teknologi Malaysia\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/short-course-on-high-voltage-engineering-successfully-held#)"
}