{
  "markdown": "Quality of Service in Wireless Communication\n============================================\n\nby [commpic](https://fke.utm.my/author/commpic/ \"Posts by commpic\")\n | Dec 7, 2016 | [COMM](https://fke.utm.my/category/comm/)\n\n*   **Title:** Quality of Service in Wireless Communication\n*   **Date :** 10 July 2014\n*   **Venue :** VCR Room, FKE\n    \n    **Time :** 10 am – 12 pm\n    \n    **Speaker:** [Dr Martin Jacobsson from Uppsala University, Sweden](http://katalog.uu.se/empinfo?id=N11-2467_1&q=+Dr+Martin+Jacobsson)\n    \n*   **Abstract:**\n    \n    Many wireless technologies allow transmissions of different packet sizes.  Examples include popular technologies, such as WLAN and IEEE 802.15.4. This is a good feature since it reduces unnecessarily long transmissions and thereby reducing energy consumption and contention. However, previous research has shown that packet length has an impact on the delivery ratio; longer packets have a larger chance of getting corrupted.  The most important implication of this is related to link quality estimation (LQE), where the goal is to find the quality of a given wireless link. For higher layer protocols (e.g., ETX), the packet error rate (PER) is the measurement being used, but this one is then dependent on the used packet length.\n    \n    In this talk, I investigate exactly what effect packet length differences has on packet loss and how LQEs can compensate for this.  I will show how hello protocol-based LQEs can be designed to take this effect into account. However, this work also applies to more advanced LQEs based on other types of channel state information (CSI), such as received signal strength (RSS), signal-to-interference-and-noise-ratio (SINR), chip/symbol error rate, etc.\n    \n    **Biography:** \n    \n    Martin Jacobsson graduated in Computer Science from University of Linköping, Sweden in 2002. In June 2008, he received his doctor degree from Delft University of Technology, The Netherlands.  He is currently affiliated with Uppsala University, Sweden as a Researcher and takes part in a research project on programming of WSNs called ProFuN and funded by the Swedish strategic research fund SSF. During his doctoral studies and afterwards, he participated in several Dutch and European research projects, including FP6 MAGNET, MAGNET Beyond and Freeband PNP2008 on personal networks.  He has acted as task leader, workpackage leader, and project leader in some of his research projects.  As the main author, he has written a book on personal networks published by Wiley in 2010.  His current research topics include wireless sensor networks (WSNs) and Internet of Things (IoT), where he focuses on wireless networking, green communication, ease of use, and programming thereof.\n    \n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/quality-of-service-in-wireless-communication#)"
}