{
  "markdown": "Academic Office : +607-5333716 | Email : academic-fcee@utm.my | Administration Office : +607-5533499 [fcee@utm.my](mailto:fcee@utm.my)\n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n**MASTER / DOCTOR OF PHILOSOPHY IN GAS ENGINEERING**  \n \n\n  Gas engineer has been in high demand to meet the increasing manpower requirement to support the numerous gas projects. These are in the area of gas liquefaction, gas processing, petrochemical processing and the delivery of gas to the power plant, industrial user, commercial center, domestic consumer throughout peninsular Malaysia. A combination of chemical process and gas engineering knowledge make it a uniquely distinct engineering discipline as the graduate can work as a chemical and process engineer as well as gas engineer for transportation and gas utilization. Knowledge in gas engineering will enable the graduates to work in petrochemical industries, oleo chemical industries, manufacturing industries, governmental and private sectors. Our graduates can apply to company such as PETRONAS, SHELL, EXXONMOBIL, Energy Commission of Malaysia, Gas Malaysia Sdn Bhd, SIRIM, DOSH, NIOSH, Consultant company and service industry. Moreover, graduates can also involve in teaching and R&D at higher learning institutions and research centers.    \n \n\n**Read more…**\n\n   \n   \n**Benefits:** Graduates are expected to work in various areas such as in gas and chemical engineering, membrane manufacturing for water and gas purification, advanced material for water and gas purification and energy application, gas transmission and distribution system, development of adsorbent for water and gas application, computational fluid dynamics (CFD) development and application, waste combustion, storage system, industrial process tomography, explosion protection and mitigation, corrosion of metals, nondestructive testing (NDT) and radiation, safety and risk assessment and biomass to biofuels.\n\n**Areas of research**\n\n*   Storage system\n*   Nuclear engineering\n*   Waste combustion\n*   Biomass to Biofuel\n\n*   [Programme Specifications](https://fkt.utm.my/m-eng-phd-gas-eng-2#)\n    \n*   [Programme Educational Objectives (PEO)](https://fkt.utm.my/m-eng-phd-gas-eng-2#)\n    \n*   [Programme Learning Outcomes (PLO)](https://fkt.utm.my/m-eng-phd-gas-eng-2#)\n    \n*   [Program Structure](https://fkt.utm.my/m-eng-phd-gas-eng-2#)\n    \n*   [Career opportunities](https://fkt.utm.my/m-eng-phd-gas-eng-2#)\n    \n*   [Entry requirement](https://fkt.utm.my/m-eng-phd-gas-eng-2#)\n    \n\n##### Areas of research\n\n*   Storage system\n*   Nuclear engineering\n*   Waste combustion\n*   Biomass to Biofuel\n\n**PEO1** – Graduates successfully incorporate the advanced knowledge of gas engineering, research and problem solving skills to formulation and solution of diverse gas engineering problems taking into account safety, environmental, economic and societal impacts.\n\n**PEO2** – Graduates communicate effectively to convey and acquire technical ideas, information, and recommendations in a multi-disciplinary environment.\n\n**PEO3** – Graduates responsibly practice professional ethics with appreciation for the value of continuing professional development in maintaining their professional competence.\n\n|     |     |\n| --- | --- |\n| PLO1 | Able to demonstrate continuing and advanced knowledge in gas engineering and have the capabilities to further develop or use these in new situations or multi-disciplinary contexts |\n| PLO2 | Able to analyse and evaluate critically problems in gas engineering, particularly in situations with limited information and to provide solutions through the application of appropriate tools and techniques |\n| PLO3 | Able to appraise available information and research evidence and apply it in the gas engineering context |\n| PLO4 | Able to plan and perform research undertakings professionally, ethically and responsibly |\n| PLO5 | Able to report technical findings in both written and oral forms |\n| PLO6 | Able to recognise the needs for continuing professional development |\n\n|     |     |     |\n| --- | --- | --- |\n| **Master of Philosophy** |     | **Doctor of Philosophy** |\n| 8 max semesters \\| 3 min semesters |     | 16 max semesters \\| 6 min semesters |\n|     |     |     |\n| **LIST OF COURSES** |     | **LIST OF COURSES** |\n| University elective |     | University elective |\n| Research methodology |     | Research methodology |\n| PKPG Research |     | PKPG Research |\n\nGraduates are expected to work in various areas such as in gas and chemical engineering, membrane manufacturing for water and gas purification, advanced material for water and gas purification and energy application, gas transmission and distribution system, development of adsorbent for water and gas application, computational fluid dynamics (CFD) development and application, waste combustion, storage system, industrial process tomography, explosion protection and mitigation, corrosion of metals, nondestructive testing (NDT) and radiation, safety and risk assessment and biomass to biofuels.\n\n*   Candidate must hold a Bachelor Degree in Chemical Engineering (Gas) or Chemical Engineering with Cumulative Grade Point Average (CGPA) of at least 3.0/4.0 or equivalent from Universiti Teknologi Malaysia or any other Institutions of Higher Learning recognized by the Senate. In the case where CGPA is less than 3.0, a minimum of 1 year working experience is needed.\n*   Candidate with other Bachelor of Engineering, Science or Technology Degree from Institutions of Higher Learning recognized by the Senate with CGPA of 3.0/4.0 may be required to take certain courses. The requirement for taking certain courses will be determined by the Department of Energy Engineering. The courses must be registered as HW\\*._\\*HW is a registration status of a course which is stipulated by the faculty and is subjected to normal assessment_\n\n**For further enquiries please contact:**\n\n![](https://fkt.utm.my/wp-content/uploads/2019/03/Dr.-Wan-Norharyati-binti-Wan-Salleh.jpg)**Dr. Wan Norhayati Wan Salleh  \nProgramme Coordinator**  \nOffice: +6075535388  \nEmail: hayati@petroleum.utm.my / w-norharyati@utm.my"
}