{
  "markdown": "KL +[603-2180 5023](tel:+60321805023)\n/[5025](tel:+60321805025)\n [ahibs@utm.my](mailto:ahibs@utm.my)\n\n**AHIBS Alumni Network**\n========================\n\n**Stay Connected, Stay Inspired**\n\nAt **Azman Hashim International Business School (AHIBS)**, our alumni are our greatest ambassadors, driving impact across industries and borders. Whether you are a recent graduate or an established leader, the **AHIBS Alumni Network** provides a platform to reconnect, collaborate, and contribute to a thriving global community.[](https://forms.gle/gQi5ospjdVfcbgPT8)\n\n### **AHIBS Alumni Association**\n\nWe are proud to introduce the latest **AHIBS Alumni Association Committee**, dedicated to fostering a strong, engaged, and supportive alumni network:\n\n![](https://business.utm.my/wp-content/uploads/2025/03/dr-nomahaza-scaled-e1741142701451.jpg)\n\n#### **Assoc. Prof. Dr. Nomahaza Mahadi**\n\nAdvisor\n\n![](https://business.utm.my/wp-content/uploads/2025/03/alumni-e1741331118582.png)\n\n#### **Dato’ Mohd Iznamshahmi Mustapha**\n\nPresident\n\n![](https://business.utm.my/wp-content/uploads/2025/03/alumni-1-2-e1741332078403.png)\n\n#### **Ts. Ainarull Assikin Abdul Hadi**\n\nVice President\n\n![](https://business.utm.my/wp-content/uploads/2025/03/alumni-1-1-e1741332359245.png)\n\n#### **Mr. Mohd Izwan Othman**\n\nSecretary\n\n![](<Base64-Image-Removed>)\n\n#### **Dato’ Mokhtar Bin Muhammad**\n\nTreasurer\n\n### **Why Join the AHIBS Alumni Network?**\n\n*   **Lifelong Connections** – Reconnect with old friends and make new professional connections.\n*   **Exclusive Events & Networking** – Participate in alumni gatherings, industry talks, and mentorship programs.\n*   **Career Advancement** – Gain insights, opportunities, and collaborations with fellow alumni.\n*   **Give Back** – Inspire the next generation by sharing your experiences and expertise.\n\n### **Alumni Success Stories**\n\nOur alumni continue to make waves in various industries, showcasing the strength of an AHIBS education.\n\nBeing one of the elders among the young and vibrant MBA students from various industries locally and internationally has been giving me a unique opportunity to learn and build business connections. In addition, AHIBS provides superb learning facilities, veteran and experienced educators with industrial background as well as a very supportive administrative team, has made the learning process interesting and memorable in preparing myself to lead a new IT start-up.\n\nMr. Mohd Taib Pardi\n\nCEO, Bizapp Ventures Sdn Bhd\n\nEmbarking on UTM’s MBA programme has been a transformative experience for my professional journey, significantly enhancing my work performance and igniting newfound creativity as a healthcare professional. Economics became my favourite subject, providing me with valuable insights and analytical skills. The programme also deepened my understanding of healthcare financial planning, empowering me to navigate real-life complex scenarios, and eventually leading me to the position of Assistant Principal Director of Serdang Hospital. UTM’s MBA has truly been a catalyst for my professional growth and expertise.\n\nDr. Neesa Amran Amir Gurdev\n\nAssistant Principal Director, Hospital Sultan Idris Shah, Serdang\n\nDriven by passion and strong entrepreneurial spirit, i decided to pursue my passion in the automotive industry and established the “Autohaus KL” brand as a reputable car service and tyre center in the Malaysia. Armed with the knowledge and skills gained during the MBA study at AHIBS UTM, I have been very determined to create a business venture that would transform the automotive industry mainly in the independent car service and tyres business.\n\nMr. Muhammad Eezam Masripan\n\nCEO and Founder, Autohaus KL\n\nMy experience at the University Technology Malaysia (UTM) while pursuing my MBA was truly remarkable, offering me a wealth of networking and research opportunities that played a pivotal role in shaping my career as an Assistant Professor in the United States. UTM’s robust network of accomplished professionals, esteemed faculty, and ambitious students provided an ideal environment for forging invaluable connections. Through numerous opportunities to attend conferences and collaborative projects, I had the privilege of interacting with influential individuals in various fields, enabling me to broaden my horizons and cultivate meaningful relationships.\n\nDr. Nargess M. Golshan\n\nAssistant Professor of Accounting, Indiana University\n\nEnrolling MBA in AHIBS is always a wise decision made as it has benefited my career development. As a technical undergraduate, the management skills acquired in an MBA contribute to survive the transition from executive to managerial level. AHIBS offers a good learning environment. I enjoyed having discussions on global finance and economic topics with experienced industry background lecturers.\n\nMr. Mohd Zul Azmi Mohammed Kassim\n\nAssistant Director, Royal Malaysian Customs Department, Johor\n\nI always believe that Education is the best way to improve our current life. ODL UTM is one of the best platform for me to equip and upgrade myself in term of knowledge and experience.\n\nAs the saying goes” If you are not willing to learn, no one can help you. If you are determined to learn, no one can stop you.” I would like to inspire others especially the diploma holders do not give up to continue their Master Degree Study!\n\nMej Wai Lik\n\nPilot, RAMF\n\n### **Get Involved**\n\nJoin us in shaping the future of the AHIBS alumni community. Whether it’s through networking events, knowledge-sharing sessions, or industry collaborations, your engagement makes a difference!\n\n\n\n**Stay Updated** – Follow us on social media and check out our latest updates.\n\n\n\n**Connect with Us** – Reach out to the AHIBS Alumni Association to explore opportunities.\n\nContact Us\n----------\n\n### For AHIBS Alumni Network[](mailto:ahibsalumni@utm.my)\n\nEmail: [ahibsalumni@utm.my](mailto:ahibsalumni@utm.my)\n\nTelephone: 011-2623 2425\n\nShare via:\n\n*   [Facebook](https://business.utm.my/alumni#)\n    \n*   [Twitter](https://business.utm.my/alumni#)\n    \n*   [LinkedIn](https://business.utm.my/alumni#)\n    \n*   [More](https://business.utm.my/alumni#)\n    \n\n \n\nShare via[](https://business.utm.my/alumni#)\n\n[Facebook](https://business.utm.my/alumni#)\n\n[X (Twitter)](https://business.utm.my/alumni#)\n\n[LinkedIn](https://business.utm.my/alumni#)\n\n[Mix](https://business.utm.my/alumni#)\n\n[Email](https://business.utm.my/alumni#)\n\n[Print](https://business.utm.my/alumni#)\n\n[Copy Link](https://business.utm.my/alumni#)\n\nPowered by [Social Snap](https://socialsnap.com/?utm_source=WordPress&utm_medium=link&utm_campaign=inthewild)\n\nCopy link[](https://business.utm.my/alumni#)\n\n [CopyCopied](https://business.utm.my/alumni#)\n\nPowered by [Social Snap](https://socialsnap.com/?utm_source=WordPress&utm_medium=link&utm_campaign=inthewild)"
}