{
  "markdown": "Staff from IVAT/POWER Initiates its Own Postgraduate Seminar\n============================================================\n\nby [powerpic](https://fke.utm.my/author/powerpic/ \"Posts by powerpic\")\n | May 5, 2016 | [POWER](https://fke.utm.my/category/power/)\n\n![ivat-postgrad-seminar](https://fke.utm.my/wp-content/uploads/2016/12/IVAT-Postgrad-Seminar.png)\n\nIn an effort to achieve Universiti Teknologi Malaysia’s aspiration to have 70 percent of its doctoral students to graduate within six semesters of the study, i.e., “graduate-on-time”, the Institute of High Voltage and High Current (IVAT), with all of its staff are also from the Department of Electrical Power Engineering (POWER), has initiated a seminar called IVAT’s Postgraduate Seminar. The seminar is scheduled to happen once every four months or thrice a year, involving all IVAT’s doctoral students. The main aim of the seminar is to ensure that the students have made sufficient progress throughout their study to “graduate-on-time”. A knowledge sharing session between presenters, audience and panels is expected during the seminar in such a way that could motivate and inculcate the students to take appropriate action to complete their study as planned.\n\nThe first IVAT’s Postgraduate Seminar was held on 26 April 2016 and 3 May 2016, for the first and second sessions, respectively. In both sessions, there were a total of 10 doctoral students attended and presented their current research progress and future plans for their research. Each presenter was evaluated accordingly by two academic panels, which were among IVAT’s academic staff. The presentations cover various research topics focusing on high voltage research areas such as lightning characterisation, lightning grounding improvement, high voltage plasma treatment application, monitoring techniques for gas insulating systems, nanofluid and nanodielectric applications, evaluation of mineral oil as an insulating oil and food treatment based on pulse electric field. The students attained meaningful discussion not only with the panels, but also among the presenters and audience. It is expected that with such an effort, more IVAT’s doctoral students will be able to “graduate-on-time” in the future.\n\n\\# Dr. Zulkarnain Ahmad Noorden, Institute of High Voltage and High Current, Universiti Teknologi Malaysia.\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/staff-from-ivatpower-initiates-its-own-postgraduate-seminar#)"
}