{
  "markdown": "IEEE DEIS Sponsored Distinguished Lecturer Programme: Workshop with Professor Toshikatsu Tanaka\n===============================================================================================\n\nby [powerpic](https://fke.utm.my/author/powerpic/ \"Posts by powerpic\")\n | Nov 10, 2017 | [POWER](https://fke.utm.my/category/power/)\n\n![](https://fke.utm.my/wp-content/uploads/2017/11/DLPWorkshop1-980x478.jpg)\n\nIn conjunction with the IEEE Dielectrics and Electrical Insulation Society (DEIS) Distinguished Lecturer Programme (DLP) on 7th November 2017, a workshop was conducted by Professor Toshikatsu Tanaka at the Institute of High Voltage and High Current, Universiti Teknologi Malaysia, Johor Bahru. The workshop, attended by 31 participants from academia and industry, began with Professor Tanaka’s presentation on “Dielectric Polymer Aging Phenomena and Diagnostics in High Voltage Engineering”. The participants were introduced by Professor Tanaka on various aging phenomena of polymeric insulators and diagnostic methods used in high voltage engineering, as well as the common practice of insulation diagnostics used in Japan for high voltage.\n\nThe workshop later continued with knowledge sharing sessions with 3 participants, namely, Professor Zulkurnain Abdul Malek of the Institute of High Voltage and High Current with his topic “Recent Dielectric and Electrical Discharge Studies at Universiti Teknologi Malaysia”, Ir. Dr. Ahmad Basri Abd. Ghani of TNB Research with his topic “Being a Step Ahead in Keeping the Lights On – TNBR Innovation in Cable Diagnostic”, and Mr. Sapto Endar of Behr Bircher Cellpack Malaysia with his topic “Basic Electrical Field and Stress Control”. During the sharing sessions, the participants had the opportunity to understand various research activities relevant to dielectrics and electrical insulation, had an overview of real life diagnostic projects carried out on-site, and had an overview of the products manufactured for use in high voltage cable jointings, briefed by Professor Zulkurnain, Ir. Dr. Ahmad Basri, and Mr. Sapto, respectively.\n\nThe committee members of the DEIS Malaysia Chapter wish to extend their sincere thanks to Professor Tanaka for conducting the workshop in conjunction with the DLP event in Malaysia. Professor Zulkurnain, Ir. Dr. Ahmad Basri, and Mr. Sapto’s kindness in sharing their knowledge during the workshop was highly appreciated. Co-operation and support from the members of the Institute of High Voltage and High Current of Universiti Teknologi Malaysia and Malaysian High Voltage Network were also acknowledged.\n\n![dlpworkshop2](https://fke.utm.my/wp-content/uploads/2017/11/DLPWorkshop2.jpg)\n\nProfessor Tanaka delivering his speech\n\n![dlpworkshop6](https://fke.utm.my/wp-content/uploads/2017/11/DLPWorkshop6.jpg)\n\nProfessor Zulkurnain delivering his speech\n\n![dlpworkshop4](https://fke.utm.my/wp-content/uploads/2017/11/DLPWorkshop4.jpg)\n\nIr. Dr. Ahmad Basri sharing his knowledge\n\n![dlpworkshop5](https://fke.utm.my/wp-content/uploads/2017/11/DLPWorkshop5.jpg)\n\nMr. Sapto sharing his knowledge\n\n![dlpworkshop1](https://fke.utm.my/wp-content/uploads/2017/11/DLPWorkshop1.jpg)\n\nGroup photo. Sitting from the right are Mr. Sapto, Ir. Dr. Ahmad Basri, Professor Zulkurnain, Professor Tanaka, Ir. Dr. Lau, and Dr. Hidayat\n\nBy Ir. Dr. Lau Kwan Yiew, Universiti Teknologi Malaysia\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/ieee-deis-sponsored-distinguished-lecturer-programme-workshop-with-professor-toshikatsu-tanaka#)"
}