{
  "markdown": "Academic Office : +607-5333716 | Email : academic-fcee@utm.my | Administration Office : +607-5533499 [fcee@utm.my](mailto:fcee@utm.my)\n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n**MASTER / DOCTOR OF PHILOSOPHY IN ENVIRONMENTAL ENGINEERING**\n\n   \nThis programme aims to develop the intellectual, practical and professional skills in the critical acquisition, analysis, interpretation and understanding of environmental engineering principles and issues. The programme focused on innovative research geared towards developing new technologies and practices that ensure mitigation of pollution for the benefit of human health and the environment.  \n \n\n**Read more…**\n\n   \n**Benefits:**  \nThe programme offers you with the following attribute:\n\nAdvanced and recent knowledge  \nEnhance Research skills  \nEnhance soft skill and interpersonal skill\n\nThe candidate will be supervised by experienced supervisors  \n   \n**Areas of research**\n\n*   Water Pollution Control & Treatment\n*   Environmental Management and Sustainability\n*   Sustainable Consumption & Production\n*   Solid and Hazardous Waste Management\n*   Life Cycle Assessment (LCA)\n*   Industrial and Municipal Wastewater Treatment\n*   Water Quality Assessment and Management\n*   Environmental Quality Analysis\n*   Modelling\n\n*   [Programme Specifications](https://fkt.utm.my/m-eng-phd-gas-environmental-eng#)\n    \n*   [Programme Educational Objectives (PEO)](https://fkt.utm.my/m-eng-phd-gas-environmental-eng#)\n    \n*   [Programme Learning Outcomes (PLO)](https://fkt.utm.my/m-eng-phd-gas-environmental-eng#)\n    \n*   [Program Structure](https://fkt.utm.my/m-eng-phd-gas-environmental-eng#)\n    \n*   [Career opportunities](https://fkt.utm.my/m-eng-phd-gas-environmental-eng#)\n    \n*   [Entry requirement](https://fkt.utm.my/m-eng-phd-gas-environmental-eng#)\n    \n\n**Master of Philosophy**\n\n**PEO1** – Graduates are able to in-depth knowledge in environmental engineering related areas.  \n**PEO2** – Graduates are able to formulate and conduct problems through effective critical thinking skills.  \n**PEO3** – Graduates are able to apply a wide range of relevant knowledge through effective oral and written communications.  \n**PEO4** – Graduates able to adopt the latest relevant knowledge, balance professional and ethical responsibilities including contemporary issues and environmental awareness.  \n   \n**Doctor of Philosophy**  \n   \n**PEO1** – Graduates are able to in-depth knowledge in environmental engineering related areas.  \n**PEO2** – Graduates are able to formulate and conduct problems through effective critical thinking skills.  \n**PEO3** – Graduates are able to organize relevant knowledge and expertise through effective oral and written communications.  \n**PEO4** – Graduates able to develop relevant knowledge, promote professional and ethical responsibilities including contemporary issues and environmental awareness.\n\n**Master of Philosophy**  \nPLO 1: Apply advanced knowledge in environmental engineering related areas.  \nPLO 2: Design and manage scientific research using acceptable methodologies through effective thinking skills.  \nPLO 3: Analyze and evaluate critically problems in related areas through effective thinking skills and the application of appropriate tools and techniques.  \nPLO 4: Demonstrate technical findings in both written and oral forms effectively.  \nPLO 5: Adapt intellectual honesty and integrity in performing scientific work.  \nPLO 6: Identify available information and research evidence and apply it in the relevant context.\n\n**Doctor of Philosophy**\n\nPLO 1: Incorporate continuing and advanced knowledge in environmental engineering related areas.  \nPLO 2: Formulate hypothesis, design and reorganize experiments/research scientifically to solve and evaluate observed phenomena.  \nPLO 3: Analyze and evaluate critically problems in related areas through effective thinking skills, particularly in situations with limited information and to provide solutions through the application of appropriate tools and techniques.  \nPLO 4: Display ideas and technical findings in both written and oral forms effectively.  \nPLO 5: Plan and perform research undertakings professionally, ethically and responsibly.  \nPLO 6: Perform lifelong learning for the needs of continuing professional development.\n\n|     |     |     |\n| --- | --- | --- |\n| **Master of Philosophy** |     | **Doctor of Philosophy** |\n| 8 max semesters \\| 3 min semesters |     | 16 max semesters \\| 6 min semesters |\n|     |     |     |\n| **LIST OF COURSES** |     | **LIST OF COURSES** |\n| University elective |     | University elective |\n| Research methodology |     | Research methodology |\n| MKKS Research |     | PKKS Research |\n\nGraduates of the programme can work as process engineer, executive engineer, consultant, managers and R&D officer in various public and private institutions/industries, and as academicians at tertiary institutions.\n\na) Candidate must hold a Bachelor Degree in any field of engineering, science or technology with Cumulative Grade Point Average (CGPA) of at least 3.0/4.0 or equivalent from Universiti Teknologi Malaysia or any other Institutions of Higher Learning recognized by the Senate. In the case where CGPA is less than 3.0, a minimum of 1 year working experience in related field is needed. For CGPA is less than 2.75, a minimum of 3 years working experience in related fields is needed.\n\nb) Candidate who is not from Environmental background Degree from Institutions of Higher Learning recognized by the Senate with CGPA of 3.0/4.0 with or without working experience must take prerequisite course that will be determined by the Faculty. The course must be registered as HW\\*.\n\n\\*HW is a registration status of a course which is stipulated by the faculty and is subjected to normal assessment\n\n**For further enquiries please contact:**\n\n![](https://fkt.utm.my/wp-content/uploads/2019/02/Prof.-Madya-Dr.-Norzita-binti-Ngadi.jpg)**Dr. Norzita Ngadi  \nProgramme Coordinator**  \nOffice: +607-5535480  \nEmail: norzita@utm.my"
}