{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/three-from-the-department-of-quantity-surveying-utm-provide-input-to-future-bim-compliance-standard-method-of-measurements-smm-for-building-works#)\n    \n*   [Instagram](https://builtsurvey.utm.my/three-from-the-department-of-quantity-surveying-utm-provide-input-to-future-bim-compliance-standard-method-of-measurements-smm-for-building-works#)\n    \n*   [RSS](https://builtsurvey.utm.my/three-from-the-department-of-quantity-surveying-utm-provide-input-to-future-bim-compliance-standard-method-of-measurements-smm-for-building-works#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/three-from-the-department-of-quantity-surveying-utm-provide-input-to-future-bim-compliance-standard-method-of-measurements-smm-for-building-works#)\n    \n*   [Instagram](https://builtsurvey.utm.my/three-from-the-department-of-quantity-surveying-utm-provide-input-to-future-bim-compliance-standard-method-of-measurements-smm-for-building-works#)\n    \n*   [RSS](https://builtsurvey.utm.my/three-from-the-department-of-quantity-surveying-utm-provide-input-to-future-bim-compliance-standard-method-of-measurements-smm-for-building-works#)\n    \n\nThree from the Department of Quantity Surveying UTM Provide Input to Future BIM Compliance-Standard Method of Measurements (SMM) for Building Works\n===================================================================================================================================================\n\nby [webmaster FAB](https://builtsurvey.utm.my/author/norazreen/ \"Posts by webmaster FAB\")\n | Apr 15, 2018 | [Meeting & Workshop](https://builtsurvey.utm.my/category/meeting-workshop/)\n, [News](https://builtsurvey.utm.my/category/news/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2018/04/SMM-1.jpg)\n\nReported by: Dr. Shamsulhadi Bandi\n\nA two days workshop on the proposed revision and improvement of the Malaysian Standard Method of Measurements (SMM) for building works was held at Melia Hotel Kuala Lumpur on 13th – 14th April 2018 and was aimed to consolidate the various work sections prepared by the appointed technical committees’ members. The effort flowed from the need to update the current edition of the standard method of measurement and the current moves to leverage Building Information Modelling (BIM) as one of the key focus of the industry.  This workshop was organised by the Royal Institution of Surveyors Malaysia (RISM) and the Construction Industry Development Board (CIDB) and was attended by over 30 strong committee members from various disciplines (Architecture, Engineering, Quantity Surveying and Technologists). They represented various organisations including the Public Works Department (PWD), the Construction Industry Development Board (CIDB), universities (UTM, UiTM and UM) and the private practices. Various tasks were accomplished during the workshop which includes moderating the different work sections, aligning the revamped rules of measurement with the generated BIM model and presenting the new rules in a tabulated format. This workshop marked an important milestone in the current effort by the industry which boldly embraces the disruptive technology as the way forward.\n\nAmong the various experts appointed by RISM and CIDB to give input in this national agenda, UTM was represented by three staff from the Department of Quantity Surveying, Faculty of Built Environment. They are Assoc. Prof. Sr Dr Sarajul Fikri Mohamad (PQS, MRISM, MRICS, MIVMM), currently the head of department and the head of Construction Economics & Management Research Group; Assoc. Prof. Sr Dr Kherun Nita Ali, a BIM expert and the head of BIM Research Group and Dr Shamsulhadi Bandi, a senior lecturer and a member of BIM Research Group who is specialising in the Bills of Quantities (BQs), measurement of construction quantities and construction data analysis.\n\nIn accordance with the timeline agreed by the sponsors, the new rules of measurement (or any other name to be decided by the committee therein) is slated to replace the current Standard Method of Measurement – 2nd Edition which was published in the year 2000 by the end of 2018. It would be interesting to see further development of the measurement practices through the use of the new rules, which would be influenced heavily by adapting to the current technology. Quantities measurement, which is considered as the bread and butter of the quantity surveying profession would definitely stay relevant within the dynamic of construction as the current effort has shown. UTM staff, together with the other members of the technical committee are delighted to perform this important task and are humbled by the appointment.\n\n*   [![](https://builtsurvey.utm.my/wp-content/uploads/2018/04/SMM-3-400x284.jpg)](https://builtsurvey.utm.my/wp-content/uploads/2018/04/SMM-3.jpg \"SMM 3\")\n    \n*   [![](<Base64-Image-Removed>)](https://builtsurvey.utm.my/wp-content/uploads/2018/04/SMM-2.jpg \"SMM 2\")"
}