{
  "markdown": "Industrial Visit to Promelight Technology (M) Sdn. Bhd.\n=======================================================\n\nby [powerpic](https://fke.utm.my/author/powerpic/ \"Posts by powerpic\")\n | Oct 16, 2017 | [POWER](https://fke.utm.my/category/power/)\n\n![](https://fke.utm.my/wp-content/uploads/2017/10/Promelight-1-980x551.jpg)\n\nOn 13 October 2017, the Faculty of Electrical Engineering (FKE), Universiti Teknologi Malaysia (UTM), organised an industrial visit for students undertaking the course “Introduction to Electrical Engineering”. The visit was conducted at Promelight Technology (M) Sdn. Bhd., Nusajaya, Johor. The main objectives of the visit to Promelight Technology were to allow the students to gain exposure on solar power industries and be aware of the responsibilities of electrical/electronic engineers in solar power industries. The visit was necessary for the students to fulfill part of the requirements for completing the course “Introduction to Electrical Engineering”, where at the end of the 12-week course, the students were expected to be able to (i) analyse the responsibilities of engineers to the society; (ii) explain the importance of sustainable solutions; (iii) be accountable on assigned tasks in an ethical manner; and (iv) manage a project. The visit to Promelight Technology was fruitful for the students where the students had the chance to tour around the factory to understand various photovoltaic (PV) module assembly processes. UTM FKE wishes to thank Promelight Technology, especially Mr. Wong Lit Cheng and Ms. Hiew Su Hua, for entertaining the visit.\n\n![promelight-1](https://fke.utm.my/wp-content/uploads/2017/10/Promelight-1.jpg)\n\nMr. Wong explaining to the students about PV modules.\n\n![promelight-2](https://fke.utm.my/wp-content/uploads/2017/10/Promelight-2.jpg)\n\nGroup photo at Promelight Technology.\n\nBy Ir. Dr. Lau Kwan Yiew, Universiti Teknologi Malaysia.\n\nAbout Promelight Technology (M) Sdn Bhd.\n\nEstablished in June 2013, Promelight Technology (M) Sdn. Bhd. has been providing high-quality and high-efficiency Mono crystalline and Poly crystalline PV modules for the solar industry. The company has always been focusing on R&D, Design, Production, and Sales for these products. More details about Promelight Technology can be found [here](http://www.promelight.com.my/about.asp)\n.\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/industrial-visit-to-promelight-technology-m-sdn-bhd#)"
}