{
  "markdown": "Academic Office : +607-5333716 | Email : academic-fcee@utm.my | Administration Office : +607-5533499 [fcee@utm.my](mailto:fcee@utm.my)\n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n**MASTER / DOCTOR OF PHILOSOPHY IN BIOPROCESS ENGINEERING**\n\n   \nBioprocess engineering in general is the essential field for many food, chemical and pharmaceutical industries as well as for development of enormous range of commercial products. Hence, the in-depth knowledge in bioprocess engineering related areas, research experience and soft skill development will be acquired through this Masters and Doctor of philosophy programme.  \n \n\n**Read more…**\n\n   \n**Benefits:**\n\n*   Advanced knowledge in the field of study\n*   Enhanced Research skills\n*   Enhanced soft skill and interpersonal skill\n*   Excellent academic supervisors\n*   Total campus experience in Research University\n\n   \n**Areas of research**  \nBioprocessing, bioreactor design, fermentation technology, enzyme technology, genetic engineering, cell culture, food technology, food packaging, plant extraction, herbal technology, bioseparation process and technology, biofuel, environmental biotechnology, cosmeceutical, proteomic, nutraceutical, bioconversion process, bioproduct development, metabolomics, etc..  \n\n*   [Programme Specifications](https://fkt.utm.my/m-eng-phd-bioprocess-eng#)\n    \n*   [Programme Educational Objectives (PEO)](https://fkt.utm.my/m-eng-phd-bioprocess-eng#)\n    \n*   [Programme Learning Outcomes (PLO)](https://fkt.utm.my/m-eng-phd-bioprocess-eng#)\n    \n*   [Program Structure](https://fkt.utm.my/m-eng-phd-bioprocess-eng#)\n    \n*   [Career opportunities](https://fkt.utm.my/m-eng-phd-bioprocess-eng#)\n    \n*   [Entry requirement](https://fkt.utm.my/m-eng-phd-bioprocess-eng#)\n    \n\n**PEO1** – Enable graduates to apply in-depth knowledge in bioprocess-engineering related areas.\n\n**PEO2** – Formulate and conduct problems through effective thinking skills.\n\n**PEO3** – Enable graduates to apply a wide range of relevant knowledge through effective oral and written communications.\n\n**PEO4** – Enable graduates to adopt the latest relevant knowledge, balance professional and ethical responsibilities including contemporary issues and environmental awareness.\n\n**Master of Philosophy**\n\n|     |     |\n| --- | --- |\n| PLO1 | Graduates are able to apply advanced knowledge in bioprocess engineering related areas. |\n| PLO2 | Graduates are able to design and manage scientific research using acceptable methodologies through effective thinking skills. |\n| PLO3 | Graduates are able to analyze and evaluate critically problems in related areas through effective thinking skills and the application of appropriate tools and techniques. |\n| PLO4 | Graduates are able to demonstrate technical findings in both written and oral forms effectively. |\n| PLO 5 | Graduates are able to adapt intellectual honesty and integrity in performing scientific work. |\n\n   \n**Doctor of Philosophy**\n\n|     |     |\n| --- | --- |\n| PLO1 | Graduates are able incorporate continuing and advanced knowledge in bioprocess engineering related areas. |\n| PLO2 | Graduates are able formulate hypothesis, design and reorganize experiments/research scientifically to solve and evaluate observed phenomena. |\n| PLO3 | Graduates are able analyze and evaluate critically problems in related areas through effective thinking skills, particularly in situations with limited information and to provide solutions through the application of appropriate tools and techniques. |\n| PLO4 | Graduates are able display ideas and technical findings in both written and oral forms effectively. |\n| PLO5 | Graduates are able plan and perform research undertakings professionally, ethically and responsibly. |\n| PLO6 | Graduates are able perform lifelong learning for the needs of continuing professional development. |\n\n|     |     |     |\n| --- | --- | --- |\n| **Master of Philosophy** |     | **Doctor of Philosophy** |\n| 8 max semesters \\| 3 min semesters |     | 16 max semesters \\| 6 min semesters |\n|     |     |     |\n| **LIST OF COURSES** |     | **LIST OF COURSES** |\n| University elective |     | University elective |\n| Research methodology |     | Research methodology |\n| MKKB Research |     | PKKB Research |\n\nGraduates of the programme can work as process engineer, executive engineer, managers and R&D officer in various public and private institutions/industries, and as academicians at tertiary institutions.\n\n**Master of Philosophy:**\n\n*   Candidate must hold a Bachelor Degree in Bioprocess Engineering with CGPA at least 3.0/4.0 (or equivalent) from a Recognised Higher Learning Institution.  For those having CGPA less than 3.0, the UTM entry qualification will be followed.\n*   Candidate holding a Bachelor Degree in other engineering or science disciplines may also apply.  The requirement for taking certain courses will be determined by the Faculty after considering the suggestion by his/her supervisor (s).  Supervisor needs to propose the list of courses to be taken by a student during the process of evaluating the student’s application.\n\n**Doctor of Philosophy:**\n\nA Master’s Degree from Universiti Teknologi Malaysia or any other Institutions of higher learning recognised by the Senate; or  \nOther qualifications equivalent to a Master’s degree and experience in the relevant field recognised by the Senate; or  \nCandidates who a currently registered in a Master’s Degree programme at Universiti Teknologi Malaysia, and approved by the Graduate Studies Committee of the respective faculty and the Senate.\n\n**For further enquiries please contact:**\n\n![](https://fkt.utm.my/wp-content/uploads/2019/03/Dr.-Zanariah-binti-Hashim.jpg)**Dr. Zanariah Hashim****  \nProgramme Coordinator**  \nOffice: +07-5535538  \nEmail: zanariahhashim@utm.my"
}