{
  "markdown": "Research Laboratory Visit – Tokyo City University\n=================================================\n\nby [lcrgpic](https://fke.utm.my/author/lcrgpic/ \"Posts by lcrgpic\")\n | Jul 16, 2023 | [COMM](https://fke.utm.my/category/comm/)\n, [LCRG](https://fke.utm.my/category/lcrg/)\n\n![](https://fke.utm.my/wp-content/uploads/2023/07/LCRG-TCU_2-Visit-230302.png)\n\nThe visit to the overseas research laboratory was continued by Dr Nur Najahatul Huda Binti Saris and Dr Nurul Ashikin Binti Daud. This time on March 2, 2023, they visited the laboratory under the supervision of Prof Ai Momozawa at Tokyo City University (TCU) Setagaya Campus.\n\nThere, they saw for themselves how the latest fabrication instrument available at TCU can use plasma sintering process technology to sinter materials from powder to solid more efficiently and accurately.\n\n![](https://fke.utm.my/wp-content/uploads/2023/07/LCRG-TCU_3-Visit-230302-1024x548.png)\n\nPlasma sintering process technology is a technique that uses pulsed electric current to heat and consolidate powder materials in a short time and at a lower temperature than conventional sintering methods. It can produce dense and homogeneous materials with fine microstructures and improved properties. Some of the advantages of plasma sintering process technology are:\n\n*   It can sinter various types of materials, such as metals, ceramics, polymers, and composites.\n*   It can create novel materials, such as nanoceramics, functionally graded materials (FGMs), and ceramic matrix composite materials.\n*   It can reduce the grain growth and preserve the nanostructure of the materials.\n*   It can enhance the mechanical, electrical, thermal, optical, and magnetic properties of the materials.\n\n![](https://fke.utm.my/wp-content/uploads/2023/07/LCRG-TCU_1-Visit-230302-1024x545.png)\n\nIn addition, they also presented their research to representatives of LCRG and TCU researchers as a step to enhance collaborative research cooperation in the future.\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/research-laboratory-visit-tokyo-city-university#)"
}