{
  "markdown": "Diploma Programme\n\n[HOME](https://space.utm.my/)\n / **UTM Diploma**\n\nStep Into Your Future at **SPACE UTM!**\n\n[e-Brochure](https://space.utm.my/wp-content/uploads/2024/07/flyers-diploma-FT-2024-edit-24jun.pdf)\n\n[Book a Consultation](https://space.utm.my/consultation/)\n\n### Malaysian Applicants\n\n### Programmes\n\n##### Diploma in Sport and Fitness\n\n**Programmes Objectives**\n\n1.  Competent, creative, and innovative in solving various problems in the field of Sport and Fitness.\n2.  Communicate confidently and display leadership qualities in conveying information through various mediums for career development through lifelong learning.\n3.  Adhere to ethical values and contribute to the needs of the organization and society by participating in various related activities\n\n**Curriculum Structure**\n\n1.  **Year 1 :** \n    \n    Appreciation of Ethics and Civilisation / Philosophy & Current Issues , Introductory Academic English, Human Anatomy and Physiology, Psychology for Sport and Fitness, Recreation and Outdoor Education, Elective Computer & math 1, Health, Fitness and Sport, Intermediate Academic English, Mechanics of Sport Movement, Motor Development & Skill Acquisition, Elective Management 1, Elective Sport & Fitness 1\n    \n2.  **Year 2 :** \n    \n    Value and Identity, Coaching for Sport and Fitness, Sport and Fitness for Special Population, Basic Sport and Fitness Performance Analysis, Elective Comp & Math 2, Elective Sport & Fitness 2, Training Methodology in Sport and Fitness, Sport and Fitness Management, First Aid and Injuries in Sport and Fitness, Elective Management 2, Elective Sport & Fitness 3, Industrial Training.\n    \n3.  **Year 3 :** \n    \n    Ethics and Current Issues in Sport and Fitness, Sport and Fitness Measure,ment, Sport and Fitness Facilities Safety, Nutrition for Sport and Fitness, Sport and Fitness Prescription, Elective Sport & Fitness 4.\n    \n\n**Career Prospects:**\n\nGraduates for this program can\n\n1.  Work as Sports Instructor/ Psychologist/ Manager/ Administrator/ Strength and Conditioning Coach / Exercise / Rehab Fitness Trainer/Coordinator, Sports Facilities Manager/ Sports Marketer.\n2.  Continue for degree and professional courses\n\n##### Diploma in Land Surveying\n\n**Programme Objectives**  \nGraduate of Diploma in Land Survey, will achieve the followings objectives:\n\n1.  Competent, creative, critical and innovative in problem solving related in the field of land surveying.\n2.  Communicate effectively with leadership skill and self-confidence while striving for career development through life-long learning.\n3.  Uphold ethical values and contribute to the needs of the organization and society by participating in various related activities.\n\n**Curriculum Structure**\n\n**Year 1**  \nScience, Technology and Human, Introductory Academic English, Mathematic for Surveyor 1, Physics for Surveyors, Basic Surveying, Introduction to Geomatics, Computer Aided Design for Surveyors, Appreciation for Ethics and Civilization / Malay Language for Communication 1, Intermediate Academic English, Mathematic for Surveyor 2, Geodesy, Engineering Survey, Field Astronomy\n\n**Year 2**  \nCo-Curriculum and Service Learning, Mathematic for Surveyor 3, Engineering Survey Technology, Cadastral Survey, Computer Programming, Graduate Success Attributes, Geographical Information System, Survey Adjustment, Satellite Positioning, Land Administration, Photogrammetry\n\n**Year 3**  \nCadastral Practice, Hydrographic Surveying, Cartography, Underground Utility Surveying, Remote Sensing, Survey Camp, Industrial Training, Industrial Training Report\n\n**Career Prospects**  \nGraduates of the program can work as:  \na) Technical assistant for both government sector and private sector.  \nb) Continue for degree and professional courses to qualify as a Land Licensed Surveyor.\n\n##### Diploma in Computer Science\n\n**Programme Objectives**  \nGraduates of this program should be able to:\n\n1.  Competent, creative and innovative in solving various problems in the field of Computer Science.\n2.  Communicate effectively with leadership skills and self-confidence while striving for career development through life-long learning.\n3.  Uphold ethical values and contribute to the needs of the organization and society by participating in various related activities.\n\n**Curriculum Structure**\n\n**Year 1**  \nScience Technology and Human, Introductory Academic English, Digital Logic, Introduction to Computer Science, Programming Fundamental, Mathematics for Computer Science, Appreciation for Ethics and Civilization / Malay Language for Communication 1, Graduate Success Attribute, Intermediate Academic English, Computer Organization and Assembly Language, Discrete Mathematics, C++ Programming\n\n**Year 2**  \nCo-Curriculum Service Learning, Database, Object- Oriented Programming Using Java, Data Structures and Algorithms, Elective I, Data Communication and Networking, Operating System, System Analysis and Design Methods, Web Programming, Mobile Programming, Elective II\n\n**Year 3**  \nData Analytics, Computer Security, VB.NET Programming, Special Issues in Computer Science, Elective III, Industrial Training, Industrial Training Report\n\n**Career Prospects**  \nGraduates of the program can work as a programmer, software developer, IT officer, web developer, technical support staff, computing entrepreneur and any related jobs in the computing industry. The graduates may also further their studies in Bachelor of Computer Science or a bachelor degree in any related field at local or foreign\n\n##### Diploma in Civil Engineering\n\n**Programme Objectives**\n\nProgramme Educational Objectives Graduates of Diploma in Civil Engineering, will achieve the followings objectives:\n\n1.  Competent, creative and innovative in solving various problems in the field of Civil Engineering\n2.  Communicate effectively with leadership skill and self-confidence while striving for career advancement through life-long learning\n3.  Uphold ethical values and contribute to the needs of the organization and society by participating in various related activities\n\n**Curriculum Structure**\n\n**Year 1**\n\nAppreciation for Ethics and Civilization, Introductory Academic English, Engineering Mathematics I, Physics, Chemistry, Civil Engineering Drawing, Civil Engineering Materials, Introduction to Civil Engineering, Intermediate Academic English, Science, Technology and Humankind, Engineering Mathematics II, Engineering Surveying, Engineering Mechanics, Contract & Estimation, Mechanical & Electrical Systems\n\n**Year 2**\n\nGraduate Success Attributes, Civil Engineering Laboratory I, Mechanics of Materials & Structures, Fluid Mechanics, Soil Mechanics, Environmental Engineering, Civil Engineering Construction, Co-Curriculums Service Learning, Project Management & Construction Practice, Hydraulics, Structural Steel Design, Theory of Structure, Highway and Traffic Engineering\n\n**Year 3**\n\nFinal Year Project, Civil Engineering Laboratory II, Reinforced Concrete Design, Hydrology, Geotechnical Engineering 3, Industrial Training, Industrial Training Report\n\n**Career Prospects**\n\nDiploma Civil Engineering holder can work as an assistant engineer or technical assistant in civil related engineering industry or any engineering industry or further studies for a Bachelor degree at local or foreign universities.\n\n##### Diploma in Architecture\n\n**Programme Objectives**  \nA graduate of this programme should be able to:\n\n1.  Competent, creative, critical and innovative in problem solving in the field of architectural fields.\n2.  Communicate effectively with leadership skills and self-confidence while striving for career development through life-long leaning related to architecture field.\n3.  Uphold ethical values and contribute to the needs of the organization and society by participating in various related activities in architecture field.\n\n**Curriculum Structure**\n\n**Year 1**  \nIntroductory Academic English, Appreciation for Ethic Civilization / Malay Language for Communication 1, Fundamental Design 1, Structure & Construction 1, Theory of Design, Architectural Communication, Intermediate Academic English, Science, Technology and Mankind, Fundamental Design 2, Construction Practice, Architectural History & Theory, Graphic & Digital Communication\n\n**Year 2**  \nGraduate Success Attributes, Design 1, Architectural Heritage of Malaysia, Environmental Science & Sustainability, Basic Architectural Computing, Co-Curriculum Service and Learning, Design 2, Structure & Construction 2, Building Services 1, Architectural Computing 2\n\n**Year 3**  \nDesign 3, Working Drawing, Building Services 2, Architectural Leadership & Entrepreneurship, Design Competition, Design Portfolio\n\n**Career Prospects**  \nGraduates of the programme:  \na. Are eligible to work as Assistant Architect, Architectural Technician and Designer in public and private sectors, **or**\n\nb. May further their studies to degree and professional courses to qualify as an architect locally and abroad.\n\n##### Diploma in Urban and Regional Planning\n\n**Programme Objectives**  \nA graduate of this programme should be able to:\n\n1.  Competent, creative and innovative in solving problems in urban and regional planning area field.\n2.  Communicate effectively with leadership skills and self-confidence while striving for career advancement through life-long learning.\n3.  Uphold ethical values and contribute to the needs of the organization and society by participating in various related activities.\n\n**Curriculum Structure**\n\n**Year 1**  \nAppreciation for Ethnics and Civilization / Malay Language for Communication, Introductory Academic English, Introduction to Planning, Site Planning, Studio 1: Basic Design Planning, Science, Technology and Mankind, Intermediate Academic English, Planning and Environment, Planning Survey Techniques, Information and Communications Technology in Planning, Studio 2: Layout 1 (Housing)\n\n**Year 2**  \nCo-Curriculum Service Learning, Land Use Planning, Community Planning and House, Urban Design, Studio 3: Layout 2 (Town Centre), Graduate Success Attributes, Urban Engineering, Rural Planning and Development, Geo Information in Planning, Studio 4: Layout 3 (Mixed-Development and Development Proposal Report)\n\n**Year 3**  \nIndustrial Training, Industrial Training Report and Seminar, Urban Economics, Planning Law and Practice, Traffic Engineering, Studio 5: Urban Area Improvement Study\n\n**Career Prospects**  \nGraduates of the program can work as an Assistant Town Planner in movement and private sector and in any related jobs in the urban and regional planning industry. The graduates may also further their studies for a Bachelor of Urban and Regional Planning or in the related field at local or foreign universities\n\n##### Diploma in Quantity Surveying\n\n**Programme Objectives**  \nEducational Objectives for Diploma in Quantity Surveying programme are designed to ensure graduates are:\n\n1.  Competent, creative and innovative in solving various problems in quantity surveying fields\n2.  Communicate effectively with leadership skills and self-confidence while striving for career advancement through lifelong learning\n3.  Uphold ethical values and contribute to the needs of organization and society by participating in various related activities\n\n**Curriculum Structure**\n\n**Year 1**  \nIntroductory Academic English, Appreciation for Ethnics and Civilization / Malay Language for Communication 1, Construction Technology 1, Draughtsmanship, Introduction to Construction Measurement, Information Communication Technology, Intermediate Academic English, Science, Technology and Mankind, Building Services 1, Construction Technology 2, Construction Measurement 1, Principles of Economics, Principles of Law, Contract and Torts\n\n**Year 2**  \nGraduate Success Attributes, Construction Materials and Specifications, Construction Technology 3, Construction Measurement 2, Building Economics 1, Professional Practice 1, Engineering Survey, Building Services 2, Principles of Structure, Construction Measurement 3, Building Economics 2, Professional Practice 2\n\n**Year 3**  \nIndustrial Training, Industrial Training and Topical Study, Co-Curriculum Service Learning, Measurement Project, Cost Estimating, Construction Law and Contract, Principles of Management in Construction\n\n**Career Prospects**  \nGraduates of the program:\n\n1.  Can work as Technical Assistant / Assistant Quantity / Surveyor both government sector and private sector.\n2.  May also continue to further their study in various disciplines related to Quantity Surveying such as Bachelor of Quantity Surveying, Bachelor of Construction, Bachelor of Building Surveying, Bachelor of Project Management etc in both local and overseas.\n\n##### Diploma in Property Management\n\n**Programme Objectives**\n\n1.  Competent, creative and innovative in solving various problems in the field of property management, property valuation and real estate agency.\n2.  Communicate effectively with leadership skills and self-confidence while striving for career advancement through lifelong learning.\n3.  Uphold ethical values and contribute to the needs of organizations and communities by participating in various related activities.\n\n**Curriculum Structure**\n\n**Year 1**  \nIntroductory Academic English, Science, Technology Mankind, Principles of Valuation, Building Technology, Malaysian Legal System, Valuation Mathematic, Intermediate Academic English, Appreciation for Ethics and Civilization / Malay Language for Communication 1, Building Services, Law of Contract, Agency and Torts, Principles of Economics, Valuation Methodology\n\n**Year 2**  \nCo-curriculum and Service Learning, Surveying and Computation, Building Maintenance, Investment Valuation, Real Estate Law, Real Estate Management, Graduate Success Attributes, Urban Planning & Development Control, Real Estate Development Law, Introduction to Accounting and Finance, Real Estate Agency and Marketing Practice, Applied Valuation\n\n**Year 3**  \nEconomic in Real Estate, Computer Application in Real Estate, Statutory Valuation, Introduction to Land Development, Statistics for Real Estate, Industrial Training, Industrial Training Report\n\n**Career Prospects**  \nGraduates of the program:\n\n1.  Can work as assistant property managers, valuation executives, probationary real estate agents, and management executives in property development and property market research.\n\nMay also further their study in various disciplines related to property such as Bachelor of Property/Estate Management and Bachelor of Land Administration and Development, both local and overseas.\n\n##### Diploma in Accounting\n\n**Programme Objectives**\n\n1.  Competent and innovative in applying accounting knowledge towards assisting superiors in accounting and accounting-related field.\n2.  Communicate effectively with leadership skill and self-confidence while striving for career advancement through life-long learning.\n3.  Uphold ethical values and contribute to the needs of the organization and society by participating in various related activities.\n\n**Curriculum Structure**\n\n**Year 1**  \nAppreciation for Ethics and Civilization / Malay Language for Communication 1, Introductory Academic English, Principles of Management, Principles of Marketing, Principles of Microeconomics, Financial Accounting 1, Science, Technology and Mankind, Intermediate Academic English, Business Mathematics, Principles of Macroeconomics, Financial Accounting 2, Computer Application in Accounting.\n\n**Year 2**  \nGraduate Success Attributes, Co-curriculum Service Learning, Business Statistics, Management Accounting, Financial Management, Accounting Information Systems, Interpersonal Communication, Intermediate Accounting, Business Law, Taxation 1, Audit 1\n\n**Year 3**  \nAdvanced Financial Accounting, Islamic Financial System, Partnership and Company Law, Taxation 2, Audit 2, Industrial Training, Industrial Training Report\n\n**Career Prospects**  \nDiploma in Accounting holders can work as an account, audit or tax assistant and management trainees. The candidates may also continue to further their study in various disciplines such as Bachelor of Accounting, Bachelor of Accounting Information System, Bachelor of Education (Accounting), Bachelor of Management (Technology), Bachelor of Business Administration, Bachelor of Finance, Bachelor of Economics\n\n##### Diploma in Islamic Studies Education\n\n**Programme Objectives**  \nDiploma in Islamic Studies Education shall produce graduates who are:\n\n1.  Competent, creative and innovative in solving various problems in the field of Islamic Studies.\n2.  Communicate effectively with leadership skills and self-confidence while striving for career advancement through life-long learning.\n3.  Uphold ethical values and contributes to the needs of the organization and society by participating in various related activities.\n\n**Curriculum Structure**\n\n**Year 1**  \nScience, Technology and Mankind, Introductory Academic English, Educational Philosophy, Principles of Islamic Jurisprudence I, Arabic Grammar I, Jawi and Islamic Calligraphy, Al-Quran Memorization, Computer System and Applications, Appreciation For Ethics and Civilisation / Malay Language for Communication 1, Intermediate Academic English, Graduate Success Attributes, Educational Psychology, Fundamental of Pedagogy, Principles of Islamic Jurisprudence II, Fiqh Ibadah, Information Technologist and Communication Application.\n\n**Year 2**  \nCo-curriculum and Service Learning, Measurement and Evaluation in Education, Islamic Faith, Fiqh Muamalat, Arabic Grammar II, Arabic Language Teaching Methods, Methods of Teaching Islamic Education, Teaching and Learning Technology, Educational Sociology, Introduction to Ulum Quran, Introduction to Ulum Hadis, Fiqh Sirah, Fiqh Jinayat, Islamic Morals, Maharat Al-Qur’an, Introduction to Multimedia.\n\n**Year 3**  \nGuidance & Counselling, Arabic Grammar III, Introduction to Islamic Da’wah, Verses and Hadith Related to Legislation, Fiqh Mirath, Islamic Civilisational Heritage in the Malay World, Micro Teaching, Information Management System in Education, Practicum.\n\n  \n**Career Prospects**  \nDiploma in Islamic Studies Education holders’ can work as an Teaching assistant in Primary/Islamic School and assistant executive (Islamic administration and finance).\n\nThe candidates may also continue to further their study in various disciplines such as Bachelor of Islamic Studies / Education, Bachelor of Business Administration, and  \nBachelor of Muamalat Management at local or foreign universities.\n\n##### Diploma in Electrical Engineering\n\n**Programme Objectives**  \nGraduates of this program should be able to:\n\n1.  Competent, creative and innovative in solving various problems in Electrical Engineering field.\n2.  Communicate effectively with leadership skill and self-confidence while striving for career advancement through lifelong\n3.  Uphold ethical values and contribute to the needs of the organization and society by participating in various related activities.\n\n**Curriculum Structure**\n\n**Year 1**  \nAppreciation for Ethics and Civilization, Introductory Academic English, Engineering Mathematics 1, Introduction to Electrical Engineering, Circuit and System 1, Digital Electronics, Electrical and Electronics Workshop, Science, Technology and Mankind, Intermediate Academic English, Engineering Mathematics 2, Physics, Circuit and System 2, Instrumentation and Measurement, Electrical Engineering Laboratory 1\n\n**Year 2**  \nGraduate Success Attributes, Differential Equations, Professional Engineering Ethics Code, Programmable Logic Controller, Electronics Devices and Circuit 1, Electrical Engineering System, Engineering Management, Co-curriculum & Service Learning, Electronics Devices and Circuit 2, Industrial Automation, Microprocessor, Network and System, Electrical Engineering Laboratory 2, Electrical installation work\n\n**Year 3**  \nProgramming, Project, Electrical machine, Electrical power system, Electrical engineering laboratory 3, Control System, Industrial training, Industrial training report\n\n**Career Prospects**  \nDiploma in Electrical Engineering holder can work as an assistant engineer or technical assistant in electrical or electronics engineering industry or any engineering industry or further studies for a Bachelor degree at local or foreign universities.\n\n##### Diploma in Mechanical Engineering\n\n**Programme Objectives**  \nGraduates of this program will be able to;\n\n1.  Competent, creative and innovative in solving various problems in the field of Mechanical Engineering\n2.  Communicate effectively with leadership skill and self-confidence while striving for career advancement through life-long learning\n3.  Uphold ethical values and contribute to the needs of the organization and society by participating in various related activities\n\n**Curriculum Structure**\n\n**Year 1**  \nScience, Technology and Mankind, Introductory Academic English, Physics, Engineering Mathematics 1, Workshop Technology 1, Basic Electrical Engineering, Engineering Drawing, Experimental Method, Appreciation for Ethics and Civilisation / Malay Communication 1, Intermediate Academic English, Engineering Mathematics 2, Chemistry, Electronics, Statics, Industrial Engineering, Workshop Technology 2.\n\n**Year 2**  \nCo Curriculum and Service Learning, Solid Mechanics 1, Thermodynamics 1, Introduction to Design, Dynamics, Programming, Graduate Success Attributes, Thermodynamics 2, Solid Mechanics 2, Fluid Mechanics 1, Material Science, Engineering Laboratory 1.\n\n**Year 3**  \nManufacturing Process, Mechanics of Machine, Fluid Mechanics 2, Final Year Project, Engineering Laboratory 2, Industrial Training, Industrial Training Report.\n\n**Career Prospects**  \nGraduates of the program can work as assistant mechanical engineer or technical assistant, engineering entrepreneur and any related jobs in mechanical engineering. They also continue to further study in various disciplines related to mechanical engineering in local or abroad.\n\n##### Diploma in Electronic Engineering\n\n**Programme Objectives**  \nGraduates of this program should be able to:\n\n1.  Competent, creative and innovative in solving various problems in the field of Electronics Engineering.\n2.  Communicate effectively with leadership skill and self-confidence while striving for career advancement through lifelong learning.\n3.  Uphold ethical values and contribute to the needs of the organization and society by participating in various related activities\n\n**Curriculum Structure**\n\n**Year 1**  \nIntroduction to Electrical Engineering, Science, Technology and Mankind, Introductory Academic English, Engineering Mathematics 1, Circuit and System 1, Digital Electronics, Electrical and Electronics Workshop, Appreciation for Ethics and Civilization, Intermediate Academic English, Engineering Mathematics 2, Physics, Circuit and System 2, Instrumentation and measurement, Electrical Engineering Laboratory 1\n\n**Year 2**  \nCo-curriculum Service Learning, Differential Equations, Programmable Logic Controller, Professional Engineering Ethics Code, Electronic Devices and Circuit 1, Electrical Engineering System, Graduate Success Attributes, Electronics Devices and Circuit 2, Industrial Automation, Microprocessor, Digital Interfacing, Network and System, Electrical Engineering Laboratory 2\n\n**Year 3**  \nProject, Electronics Manufacturing Process, Programming, Industrial Electronics, Engineering Management, Electronic Engineering laboratory, Industrial Training, Industrial Training Report\n\n**Career Prospects**  \nDiploma in Electronic Engineering holder can work as an assistant engineer or technical assistant in electronics or electrical engineering industry or any engineering industry or further studies for a Bachelor degree at local or foreign universities.\n\n##### Diploma in Chemical Engineering\n\n**Programme Objectives**  \nThis program will produce graduates that can work as assistant engineer or technical assistant in chemical engineering industry or any engineering industry. The graduates may also further their studies for a Bachelor of Chemical Engineering or bachelor in any related field at local or foreign universities.\n\n**Curriculum Structure**\n\n**Year 1**  \nEngineering Mathematics 1, Chemistry, Physics, Engineering Drawing, Statics, Workshop Technology 1, Malaysia Dynamics, Introductory Academic English, Engineering Mathematics 2, Electrical Principle, Mass Balance, Thermodynamics, Workshop Technology 2, Science, Technology and Mankind, Intermediate Academic English\n\n**Year 2**  \nAnalytical Chemistry, Energy Balance, Fluid Mechanics, Fluid Mechanics and Thermodynamics Laboratory, Computer Engineering, Communication Skills, Japanese Language 1, Transport Processes, Chemical Reaction Engineering, Refinery and Petrochemical Technology, Environmental Engineering, Chemical Reaction and Environmental Engineering Laboratory, STEM Literature\n\n**Year 3**  \nSeparation Processes, Instrumentation, Plant Operation and Maintenance, Occupational Safety and Health, Unit Operation Laboratory, Final Year Project, Industrial Training, Industrial Training Report\n\n**Career Prospects**  \nGraduates of the program  \na) Can work as assistant engineer or technical assistant in chemical engineering industry or any engineering industry.  \nb) May continue to further their study in various disciplines related to chemical engineering at local or foreign universities.\n\n##### Diploma in Technology Management\n\n**Programme Objectives**  \nThis program will produce graduates that can work as assistant administrative officer, line supervisor and assistant executive (administrative and finance). The graduate may also further their studies for a Bachelor of Technology Management or bachelor in any related field at local or foreign universities.  \nTo fulfill the objective of this programme, the graduate should be able to:\n\n1.  Solve managerial problems in management and technology and to work in multidisciplinary teams in proposing alterative solutions.\n2.  Demonstrate skills in management theories and technique logically, creatively and analytically based on sound facts and ideas.\n3.  Involve in community and/or professional organizations and/or make contributions towards society.\n4.  Continue studies at higher level and self-development as a professional.\n\n**Curriculum Structure**\n\n**Year 1**  \nAppreciation for Ethics and Civilization / Malay Language for Communication 1, Introductory Academic English, Principles of Management, Principles of Microeconomics, Business Accounting, Microcomputer Application, Science, Technology Mankind, Intermediate Academic English, Principles of Marketing, Principles of Macroeconomics, Technology Management, Business Mathematics\n\n**Year 2**  \nGraduate Success Attributes, Co-curriculum and Service Learning, Introduction to Operation Management, Business Statistics, Introduction to Finance, Organizational Behavior, Quality Management, Interpersonal Communication, Technology Entrepreneurship, Management Information Systems, Manufacturing Process\n\n**Year 3**  \nProduction and Planning Control, Human Resource Management, Commercial Law, Technology Commercialization, Research Development and Innovation, Industrial Training, Industrial Training Report\n\n**Career Prospects**  \nGraduates of the program can work as:\n\n1.  Diploma holders can work as assistant administrative officer, line supervisor and assistant executive (administration and finance).\n2.  The candidates may also continue to further their study in various disciplines such as Bachelor of Management Technology, Bachelor of Business Administration (Human Resources, Marketing and Operation Management), Bachelor of Economics, Bachelor of Information Technology and Education (Management) at local or foreign universities.\n\n![](https://space.utm.my/wp-content/uploads/2024/07/Foundation-or-Diploma.jpg)\n\nCalon lepasan Sijil Pelajaran Malaysia (SPM), semakan kelayakan untuk melanjutkan pengajian ke peringkat Asasi UTM dan Diploma UTM boleh dilakukan dengan pantas menerusi Sistem UTM My Dream di pautan **[https://mydream.utmspace.edu.my/spm](https://mydream.utmspace.edu.my/spm)\n**\n\n#### Entry Requirements\n\n#### Fee Structure\n\n#### Community\n\n#### Education Pathways\n\n[Download Entry Requirements](https://drive.google.com/file/d/12-6OTbSEvx8uOvkOe45JtnITHuuHPpcW/view?usp=sharing)\n\n[![](https://space.utm.my/wp-content/uploads/2024/07/new-STUDY-DURATION-AND-FEES-Copy1.jpg)](https://space.utm.my/wp-content/uploads/2024/07/new-STUDY-DURATION-AND-FEES-Copy1.jpg)\n\n1.  [Student portal](https://studentdiploma.utmspace.edu.my/)\n    \n2.  Lecturer Portal > [https://space.utm.my/diploma/lecturer-portal-ppd/](https://space.utm.my/diploma/lecturer-portal-ppd/)\n    \n\n[![](https://space.utm.my/wp-content/uploads/2024/08/PPD-SPACE-EDUCATION-PATHWAYS.jpg)](https://space.utm.my/wp-content/uploads/2024/08/PPD-SPACE-EDUCATION-PATHWAYS.jpg)\n\n### International Applicants\n\n### Programmes\n\n##### Diploma in Sport and Fitness\n\n**Programmes Objectives**\n\n1.  Competent, creative, and innovative in solving various problems in the field of Sport and Fitness.\n2.  Communicate confidently and display leadership qualities in conveying information through various mediums for career development through lifelong learning.\n3.  Adhere to ethical values and contribute to the needs of the organization and society by participating in various related activities\n\n**Curriculum Structure**\n\n1.  **Year 1 :** \n    \n    Appreciation of Ethics and Civilisation / Philosophy & Current Issues , Introductory Academic English, Human Anatomy and Physiology, Psychology for Sport and Fitness, Recreation and Outdoor Education, Elective Computer & math 1, Health, Fitness and Sport, Intermediate Academic English, Mechanics of Sport Movement, Motor Development & Skill Acquisition, Elective Management 1, Elective Sport & Fitness 1\n    \n2.  **Year 2 :** \n    \n    Value and Identity, Coaching for Sport and Fitness, Sport and Fitness for Special Population, Basic Sport and Fitness Performance Analysis, Elective Comp & Math 2, Elective Sport & Fitness 2, Training Methodology in Sport and Fitness, Sport and Fitness Management, First Aid and Injuries in Sport and Fitness, Elective Management 2, Elective Sport & Fitness 3, Industrial Training.\n    \n3.  **Year 3 :** \n    \n    Ethics and Current Issues in Sport and Fitness, Sport and Fitness Measure,ment, Sport and Fitness Facilities Safety, Nutrition for Sport and Fitness, Sport and Fitness Prescription, Elective Sport & Fitness 4.\n    \n\n**Career Prospects:**\n\nGraduates for this program can\n\n1.  Work as Sports Instructor/ Psychologist/ Manager/ Administrator/ Strength and Conditioning Coach / Exercise / Rehab Fitness Trainer/Coordinator, Sports Facilities Manager/ Sports Marketer.\n2.  Continue for degree and professional courses\n\n##### Diploma in Civil Engineering\n\n**Programme Objectives**\n\nProgramme Educational Objectives Graduates of Diploma in Civil Engineering, will achieve the followings objectives:\n\n1.  Competent, creative and innovative in solving various problems in the field of Civil Engineering\n2.  Communicate effectively with leadership skill and self-confidence while striving for career advancement through life-long learning\n3.  Uphold ethical values and contribute to the needs of the organization and society by participating in various related activities\n\n**Curriculum Structure**\n\n**Year 1**\n\nAppreciation for Ethics and Civilization, Introductory Academic English, Engineering Mathematics I, Physics, Chemistry, Civil Engineering Drawing, Civil Engineering Materials, Introduction to Civil Engineering, Intermediate Academic English, Science, Technology and Humankind, Engineering Mathematics II, Engineering Surveying, Engineering Mechanics, Contract & Estimation, Mechanical & Electrical Systems\n\n**Year 2**\n\nGraduate Success Attributes, Civil Engineering Laboratory I, Mechanics of Materials & Structures, Fluid Mechanics, Soil Mechanics, Environmental Engineering, Civil Engineering Construction, Co-Curriculums Service Learning, Project Management & Construction Practice, Hydraulics, Structural Steel Design, Theory of Structure, Highway and Traffic Engineering\n\n**Year 3**\n\nFinal Year Project, Civil Engineering Laboratory II, Reinforced Concrete Design, Hydrology, Geotechnical Engineering 3, Industrial Training, Industrial Training Report\n\n**Career Prospects**\n\nDiploma Civil Engineering holder can work as an assistant engineer or technical assistant in civil related engineering industry or any engineering industry or further studies for a Bachelor degree at local or foreign universities.\n\n##### Diploma in Chemical Engineering\n\n**Programme Objectives**  \nThis program will produce graduates that can work as assistant engineer or technical assistant in chemical engineering industry or any engineering industry. The graduates may also further their studies for a Bachelor of Chemical Engineering or bachelor in any related field at local or foreign universities.\n\n**Curriculum Structure**\n\n**Year 1**  \nEngineering Mathematics 1, Chemistry, Physics, Engineering Drawing, Statics, Workshop Technology 1, Malaysia Dynamics, Introductory Academic English, Engineering Mathematics 2, Electrical Principle, Mass Balance, Thermodynamics, Workshop Technology 2, Science, Technology and Mankind, Intermediate Academic English\n\n**Year 2**  \nAnalytical Chemistry, Energy Balance, Fluid Mechanics, Fluid Mechanics and Thermodynamics Laboratory, Computer Engineering, Communication Skills, Japanese Language 1, Transport Processes, Chemical Reaction Engineering, Refinery and Petrochemical Technology, Environmental Engineering, Chemical Reaction and Environmental Engineering Laboratory, STEM Literature\n\n**Year 3**  \nSeparation Processes, Instrumentation, Plant Operation and Maintenance, Occupational Safety and Health, Unit Operation Laboratory, Final Year Project, Industrial Training, Industrial Training Report\n\n**Career Prospects**  \nGraduates of the program  \na) Can work as assistant engineer or technical assistant in chemical engineering industry or any engineering industry.  \nb) May continue to further their study in various disciplines related to chemical engineering at local or foreign universities.\n\n##### Diploma in Electronic Engineering\n\n**Programme Objectives**  \nGraduates of this program should be able to:\n\n1.  Competent, creative and innovative in solving various problems in the field of Electronics Engineering.\n2.  Communicate effectively with leadership skill and self-confidence while striving for career advancement through lifelong learning.\n3.  Uphold ethical values and contribute to the needs of the organization and society by participating in various related activities\n\n**Curriculum Structure**\n\n**Year 1**  \nIntroduction to Electrical Engineering, Science, Technology and Mankind, Introductory Academic English, Engineering Mathematics 1, Circuit and System 1, Digital Electronics, Electrical and Electronics Workshop, Appreciation for Ethics and Civilization, Intermediate Academic English, Engineering Mathematics 2, Physics, Circuit and System 2, Instrumentation and measurement, Electrical Engineering Laboratory 1\n\n**Year 2**  \nCo-curriculum Service Learning, Differential Equations, Programmable Logic Controller, Professional Engineering Ethics Code, Electronic Devices and Circuit 1, Electrical Engineering System, Graduate Success Attributes, Electronics Devices and Circuit 2, Industrial Automation, Microprocessor, Digital Interfacing, Network and System, Electrical Engineering Laboratory 2\n\n**Year 3**  \nProject, Electronics Manufacturing Process, Programming, Industrial Electronics, Engineering Management, Electronic Engineering laboratory, Industrial Training, Industrial Training Report\n\n**Career Prospects**  \nDiploma in Electronic Engineering holder can work as an assistant engineer or technical assistant in electronics or electrical engineering industry or any engineering industry or further studies for a Bachelor degree at local or foreign universities.\n\n##### Diploma in Electrical Engineering\n\n**Programme Objectives**  \nGraduates of this program should be able to:\n\n1.  Competent, creative and innovative in solving various problems in Electrical Engineering field.\n2.  Communicate effectively with leadership skill and self-confidence while striving for career advancement through lifelong\n3.  Uphold ethical values and contribute to the needs of the organization and society by participating in various related activities.\n\n**Curriculum Structure**\n\n**Year 1**  \nAppreciation for Ethics and Civilization, Introductory Academic English, Engineering Mathematics 1, Introduction to Electrical Engineering, Circuit and System 1, Digital Electronics, Electrical and Electronics Workshop, Science, Technology and Mankind, Intermediate Academic English, Engineering Mathematics 2, Physics, Circuit and System 2, Instrumentation and Measurement, Electrical Engineering Laboratory 1\n\n**Year 2**  \nGraduate Success Attributes, Differential Equations, Professional Engineering Ethics Code, Programmable Logic Controller, Electronics Devices and Circuit 1, Electrical Engineering System, Engineering Management, Co-curriculum & Service Learning, Electronics Devices and Circuit 2, Industrial Automation, Microprocessor, Network and System, Electrical Engineering Laboratory 2, Electrical installation work\n\n**Year 3**  \nProgramming, Project, Electrical machine, Electrical power system, Electrical engineering laboratory 3, Control System, Industrial training, Industrial training report\n\n**Career Prospects**  \nDiploma in Electrical Engineering holder can work as an assistant engineer or technical assistant in electrical or electronics engineering industry or any engineering industry or further studies for a Bachelor degree at local or foreign universities.\n\n##### Diploma in Mechanical Engineering\n\n**Programme Objectives**  \nGraduates of this program will be able to;\n\n1.  Competent, creative and innovative in solving various problems in the field of Mechanical Engineering\n2.  Communicate effectively with leadership skill and self-confidence while striving for career advancement through life-long learning\n3.  Uphold ethical values and contribute to the needs of the organization and society by participating in various related activities\n\n**Curriculum Structure**\n\n**Year 1**  \nScience, Technology and Mankind, Introductory Academic English, Physics, Engineering Mathematics 1, Workshop Technology 1, Basic Electrical Engineering, Engineering Drawing, Experimental Method, Appreciation for Ethics and Civilisation / Malay Communication 1, Intermediate Academic English, Engineering Mathematics 2, Chemistry, Electronics, Statics, Industrial Engineering, Workshop Technology 2.\n\n**Year 2**  \nCo Curriculum and Service Learning, Solid Mechanics 1, Thermodynamics 1, Introduction to Design, Dynamics, Programming, Graduate Success Attributes, Thermodynamics 2, Solid Mechanics 2, Fluid Mechanics 1, Material Science, Engineering Laboratory 1.\n\n**Year 3**  \nManufacturing Process, Mechanics of Machine, Fluid Mechanics 2, Final Year Project, Engineering Laboratory 2, Industrial Training, Industrial Training Report.\n\n**Career Prospects**  \nGraduates of the program can work as assistant mechanical engineer or technical assistant, engineering entrepreneur and any related jobs in mechanical engineering. They also continue to further study in various disciplines related to mechanical engineering in local or abroad.\n\n##### Diploma in Islamic Studies Education\n\n**Programme Objectives**  \nDiploma in Islamic Studies Education shall produce graduates who are:\n\n1.  Competent, creative and innovative in solving various problems in the field of Islamic Studies.\n2.  Communicate effectively with leadership skills and self-confidence while striving for career advancement through life-long learning.\n3.  Uphold ethical values and contributes to the needs of the organization and society by participating in various related activities.\n\n**Curriculum Structure**\n\n**Year 1**  \nScience, Technology and Mankind, Introductory Academic English, Educational Philosophy, Principles of Islamic Jurisprudence I, Arabic Grammar I, Jawi and Islamic Calligraphy, Al-Quran Memorization, Computer System and Applications, Appreciation For Ethics and Civilisation / Malay Language for Communication 1, Intermediate Academic English, Graduate Success Attributes, Educational Psychology, Fundamental of Pedagogy, Principles of Islamic Jurisprudence II, Fiqh Ibadah, Information Technologist and Communication Application.\n\n**Year 2**  \nCo-curriculum and Service Learning, Measurement and Evaluation in Education, Islamic Faith, Fiqh Muamalat, Arabic Grammar II, Arabic Language Teaching Methods, Methods of Teaching Islamic Education, Teaching and Learning Technology, Educational Sociology, Introduction to Ulum Quran, Introduction to Ulum Hadis, Fiqh Sirah, Fiqh Jinayat, Islamic Morals, Maharat Al-Qur’an, Introduction to Multimedia.\n\n**Year 3**  \nGuidance & Counselling, Arabic Grammar III, Introduction to Islamic Da’wah, Verses and Hadith Related to Legislation, Fiqh Mirath, Islamic Civilisational Heritage in the Malay World, Micro Teaching, Information Management System in Education, Practicum.\n\n  \n**Career Prospects**  \nDiploma in Islamic Studies Education holders’ can work as an Teaching assistant in Primary/Islamic School and assistant executive (Islamic administration and finance).\n\nThe candidates may also continue to further their study in various disciplines such as Bachelor of Islamic Studies / Education, Bachelor of Business Administration, and  \nBachelor of Muamalat Management at local or foreign universities.\n\n##### Diploma in Property Management\n\n**Programme Objectives**\n\n1.  Competent, creative and innovative in solving various problems in the field of property management, property valuation and real estate agency.\n2.  Communicate effectively with leadership skills and self-confidence while striving for career advancement through lifelong learning.\n3.  Uphold ethical values and contribute to the needs of organizations and communities by participating in various related activities.\n\n**Curriculum Structure**\n\n**Year 1**  \nIntroductory Academic English, Science, Technology Mankind, Principles of Valuation, Building Technology, Malaysian Legal System, Valuation Mathematic, Intermediate Academic English, Appreciation for Ethics and Civilization / Malay Language for Communication 1, Building Services, Law of Contract, Agency and Torts, Principles of Economics, Valuation Methodology\n\n**Year 2**  \nCo-curriculum and Service Learning, Surveying and Computation, Building Maintenance, Investment Valuation, Real Estate Law, Real Estate Management, Graduate Success Attributes, Urban Planning & Development Control, Real Estate Development Law, Introduction to Accounting and Finance, Real Estate Agency and Marketing Practice, Applied Valuation\n\n**Year 3**  \nEconomic in Real Estate, Computer Application in Real Estate, Statutory Valuation, Introduction to Land Development, Statistics for Real Estate, Industrial Training, Industrial Training Report\n\n**Career Prospects**  \nGraduates of the program:\n\n1.  Can work as assistant property managers, valuation executives, probationary real estate agents, and management executives in property development and property market research.\n\nMay also further their study in various disciplines related to property such as Bachelor of Property/Estate Management and Bachelor of Land Administration and Development, both local and overseas.\n\n##### Diploma in Accounting\n\n**Programme Objectives**\n\n1.  Competent and innovative in applying accounting knowledge towards assisting superiors in accounting and accounting-related field.\n2.  Communicate effectively with leadership skill and self-confidence while striving for career advancement through life-long learning.\n3.  Uphold ethical values and contribute to the needs of the organization and society by participating in various related activities.\n\n**Curriculum Structure**\n\n**Year 1**  \nAppreciation for Ethics and Civilization / Malay Language for Communication 1, Introductory Academic English, Principles of Management, Principles of Marketing, Principles of Microeconomics, Financial Accounting 1, Science, Technology and Mankind, Intermediate Academic English, Business Mathematics, Principles of Macroeconomics, Financial Accounting 2, Computer Application in Accounting.\n\n**Year 2**  \nGraduate Success Attributes, Co-curriculum Service Learning, Business Statistics, Management Accounting, Financial Management, Accounting Information Systems, Interpersonal Communication, Intermediate Accounting, Business Law, Taxation 1, Audit 1\n\n**Year 3**  \nAdvanced Financial Accounting, Islamic Financial System, Partnership and Company Law, Taxation 2, Audit 2, Industrial Training, Industrial Training Report\n\n**Career Prospects**  \nDiploma in Accounting holders can work as an account, audit or tax assistant and management trainees. The candidates may also continue to further their study in various disciplines such as Bachelor of Accounting, Bachelor of Accounting Information System, Bachelor of Education (Accounting), Bachelor of Management (Technology), Bachelor of Business Administration, Bachelor of Finance, Bachelor of Economics\n\n##### Diploma in Technology Management\n\n**Programme Objectives**  \nThis program will produce graduates that can work as assistant administrative officer, line supervisor and assistant executive (administrative and finance). The graduate may also further their studies for a Bachelor of Technology Management or bachelor in any related field at local or foreign universities.  \nTo fulfill the objective of this programme, the graduate should be able to:\n\n1.  Solve managerial problems in management and technology and to work in multidisciplinary teams in proposing alterative solutions.\n2.  Demonstrate skills in management theories and technique logically, creatively and analytically based on sound facts and ideas.\n3.  Involve in community and/or professional organizations and/or make contributions towards society.\n4.  Continue studies at higher level and self-development as a professional.\n\n**Curriculum Structure**\n\n**Year 1**  \nAppreciation for Ethics and Civilization / Malay Language for Communication 1, Introductory Academic English, Principles of Management, Principles of Microeconomics, Business Accounting, Microcomputer Application, Science, Technology Mankind, Intermediate Academic English, Principles of Marketing, Principles of Macroeconomics, Technology Management, Business Mathematics\n\n**Year 2**  \nGraduate Success Attributes, Co-curriculum and Service Learning, Introduction to Operation Management, Business Statistics, Introduction to Finance, Organizational Behavior, Quality Management, Interpersonal Communication, Technology Entrepreneurship, Management Information Systems, Manufacturing Process\n\n**Year 3**  \nProduction and Planning Control, Human Resource Management, Commercial Law, Technology Commercialization, Research Development and Innovation, Industrial Training, Industrial Training Report\n\n**Career Prospects**  \nGraduates of the program can work as:\n\n1.  Diploma holders can work as assistant administrative officer, line supervisor and assistant executive (administration and finance).\n2.  The candidates may also continue to further their study in various disciplines such as Bachelor of Management Technology, Bachelor of Business Administration (Human Resources, Marketing and Operation Management), Bachelor of Economics, Bachelor of Information Technology and Education (Management) at local or foreign universities.\n\n##### Diploma in Quantity Surveying\n\n**Programme Objectives**  \nEducational Objectives for Diploma in Quantity Surveying programme are designed to ensure graduates are:\n\n1.  Competent, creative and innovative in solving various problems in quantity surveying fields\n2.  Communicate effectively with leadership skills and self-confidence while striving for career advancement through lifelong learning\n3.  Uphold ethical values and contribute to the needs of organization and society by participating in various related activities\n\n**Curriculum Structure**\n\n**Year 1**  \nIntroductory Academic English, Appreciation for Ethnics and Civilization / Malay Language for Communication 1, Construction Technology 1, Draughtsmanship, Introduction to Construction Measurement, Information Communication Technology, Intermediate Academic English, Science, Technology and Mankind, Building Services 1, Construction Technology 2, Construction Measurement 1, Principles of Economics, Principles of Law, Contract and Torts\n\n**Year 2**  \nGraduate Success Attributes, Construction Materials and Specifications, Construction Technology 3, Construction Measurement 2, Building Economics 1, Professional Practice 1, Engineering Survey, Building Services 2, Principles of Structure, Construction Measurement 3, Building Economics 2, Professional Practice 2\n\n**Year 3**  \nIndustrial Training, Industrial Training and Topical Study, Co-Curriculum Service Learning, Measurement Project, Cost Estimating, Construction Law and Contract, Principles of Management in Construction\n\n**Career Prospects**  \nGraduates of the program:\n\n1.  Can work as Technical Assistant / Assistant Quantity / Surveyor both government sector and private sector.\n2.  May also continue to further their study in various disciplines related to Quantity Surveying such as Bachelor of Quantity Surveying, Bachelor of Construction, Bachelor of Building Surveying, Bachelor of Project Management etc in both local and overseas.\n\n##### Diploma in Urban and Regional Planning\n\n**Programme Objectives**  \nA graduate of this programme should be able to:\n\n1.  Competent, creative and innovative in solving problems in urban and regional planning area field.\n2.  Communicate effectively with leadership skills and self-confidence while striving for career advancement through life-long learning.\n3.  Uphold ethical values and contribute to the needs of the organization and society by participating in various related activities.\n\n**Curriculum Structure**\n\n**Year 1**  \nAppreciation for Ethnics and Civilization / Malay Language for Communication, Introductory Academic English, Introduction to Planning, Site Planning, Studio 1: Basic Design Planning, Science, Technology and Mankind, Intermediate Academic English, Planning and Environment, Planning Survey Techniques, Information and Communications Technology in Planning, Studio 2: Layout 1 (Housing)\n\n**Year 2**  \nCo-Curriculum Service Learning, Land Use Planning, Community Planning and House, Urban Design, Studio 3: Layout 2 (Town Centre), Graduate Success Attributes, Urban Engineering, Rural Planning and Development, Geo Information in Planning, Studio 4: Layout 3 (Mixed-Development and Development Proposal Report)\n\n**Year 3**  \nIndustrial Training, Industrial Training Report and Seminar, Urban Economics, Planning Law and Practice, Traffic Engineering, Studio 5: Urban Area Improvement Study\n\n**Career Prospects**  \nGraduates of the program can work as an Assistant Town Planner in movement and private sector and in any related jobs in the urban and regional planning industry. The graduates may also further their studies for a Bachelor of Urban and Regional Planning or in the related field at local or foreign universities\n\n##### Diploma in Architecture\n\n**Programme Objectives**  \nA graduate of this programme should be able to:\n\n1.  Competent, creative, critical and innovative in problem solving in the field of architectural fields.\n2.  Communicate effectively with leadership skills and self-confidence while striving for career development through life-long leaning related to architecture field.\n3.  Uphold ethical values and contribute to the needs of the organization and society by participating in various related activities in architecture field.\n\n**Curriculum Structure**\n\n**Year 1**  \nIntroductory Academic English, Appreciation for Ethic Civilization / Malay Language for Communication 1, Fundamental Design 1, Structure & Construction 1, Theory of Design, Architectural Communication, Intermediate Academic English, Science, Technology and Mankind, Fundamental Design 2, Construction Practice, Architectural History & Theory, Graphic & Digital Communication\n\n**Year 2**  \nGraduate Success Attributes, Design 1, Architectural Heritage of Malaysia, Environmental Science & Sustainability, Basic Architectural Computing, Co-Curriculum Service and Learning, Design 2, Structure & Construction 2, Building Services 1, Architectural Computing 2\n\n**Year 3**  \nDesign 3, Working Drawing, Building Services 2, Architectural Leadership & Entrepreneurship, Design Competition, Design Portfolio\n\n**Career Prospects**  \nGraduates of the programme:  \na. Are eligible to work as Assistant Architect, Architectural Technician and Designer in public and private sectors, **or**\n\nb. May further their studies to degree and professional courses to qualify as an architect locally and abroad.\n\n##### Diploma in Land Surveying\n\n**Programme Objectives**  \nGraduate of Diploma in Land Survey, will achieve the followings objectives:\n\n1.  Competent, creative, critical and innovative in problem solving related in the field of land surveying.\n2.  Communicate effectively with leadership skill and self-confidence while striving for career development through life-long learning.\n3.  Uphold ethical values and contribute to the needs of the organization and society by participating in various related activities.\n\n**Curriculum Structure**\n\n**Year 1**  \nScience, Technology and Human, Introductory Academic English, Mathematic for Surveyor 1, Physics for Surveyors, Basic Surveying, Introduction to Geomatics, Computer Aided Design for Surveyors, Appreciation for Ethics and Civilization / Malay Language for Communication 1, Intermediate Academic English, Mathematic for Surveyor 2, Geodesy, Engineering Survey, Field Astronomy\n\n**Year 2**  \nCo-Curriculum and Service Learning, Mathematic for Surveyor 3, Engineering Survey Technology, Cadastral Survey, Computer Programming, Graduate Success Attributes, Geographical Information System, Survey Adjustment, Satellite Positioning, Land Administration, Photogrammetry\n\n**Year 3**  \nCadastral Practice, Hydrographic Surveying, Cartography, Underground Utility Surveying, Remote Sensing, Survey Camp, Industrial Training, Industrial Training Report\n\n**Career Prospects**  \nGraduates of the program can work as:  \na) Technical assistant for both government sector and private sector.  \nb) Continue for degree and professional courses to qualify as a Land Licensed Surveyor.\n\n##### Diploma in Computer Science\n\n**Programme Objectives**  \nGraduates of this program should be able to:\n\n1.  Competent, creative and innovative in solving various problems in the field of Computer Science.\n2.  Communicate effectively with leadership skills and self-confidence while striving for career development through life-long learning.\n3.  Uphold ethical values and contribute to the needs of the organization and society by participating in various related activities.\n\n**Curriculum Structure**\n\n**Year 1**  \nScience Technology and Human, Introductory Academic English, Digital Logic, Introduction to Computer Science, Programming Fundamental, Mathematics for Computer Science, Appreciation for Ethics and Civilization / Malay Language for Communication 1, Graduate Success Attribute, Intermediate Academic English, Computer Organization and Assembly Language, Discrete Mathematics, C++ Programming\n\n**Year 2**  \nCo-Curriculum Service Learning, Database, Object- Oriented Programming Using Java, Data Structures and Algorithms, Elective I, Data Communication and Networking, Operating System, System Analysis and Design Methods, Web Programming, Mobile Programming, Elective II\n\n**Year 3**  \nData Analytics, Computer Security, VB.NET Programming, Special Issues in Computer Science, Elective III, Industrial Training, Industrial Training Report\n\n**Career Prospects**  \nGraduates of the program can work as a programmer, software developer, IT officer, web developer, technical support staff, computing entrepreneur and any related jobs in the computing industry. The graduates may also further their studies in Bachelor of Computer Science or a bachelor degree in any related field at local or foreign\n\n#### Entry Requirements\n\n#### Fee Structure\n\n[Download Entry Requirements](https://drive.google.com/file/d/12-6OTbSEvx8uOvkOe45JtnITHuuHPpcW/view?usp=sharing)\n\nINTERNATIONAL STUDENTS FEES\n---------------------------\n\n| FIELD | UTM SERVICES FEES (MYR)  <br>Every Semester | TUITION FEES (MYR)  <br>Every Semester |\n| --- | --- | --- |\n| ENGINEERING | RM 1,000.00 | RM 6,000.00 |\n| NON – ENGINEERING | RM 1,000.00 | RM 5,500.00 |\n| DIPLOMA IN ARCHITECTURE | RM 1,000.00 | RM 6,600.00 |\n\nDURATION OF STUDY\n-----------------\n\n| LIST OF PROGRAMME | DURATION OF STUDY |\n| --- | --- |\n| ◻ Diploma in Technology Management  <br>◻ Diploma in Accounting | 2 YEARS |\n| ◻ Diploma in Computer Science  <br>◻ Diploma in Urban and Regional Planning  <br>◻ Diploma in Quantity Surveying  <br>◻ Diploma in Property Management  <br>◻ Diploma in Architecture  <br>◻ Diploma in Sport and Fitness | 2.5 YEARS |\n| ◻ Diploma in Land Surveying  <br>◻ Diploma in Islamic Studies Education  <br>◻ Diploma in Civil Engineering  <br>◻ Diploma in Electronic Engineering  <br>◻ Diploma in Electrical Engineering  <br>◻ Diploma in Mechanical Engineering  <br>◻ Diploma in Chemical Engineering | 3 YEARS |\n\n#### Follow academic regulation of\n\n![](https://space.utm.my/wp-content/uploads/2024/05/utmppd.fw_.png \"utmppd.fw_\")\n\n#### Accredited following standards of\n\n![](https://space.utm.my/wp-content/uploads/2024/05/mqa.fw_.png \"mqa.fw_\")\n\n#### Professional programmes are recognised by\n\n![](https://space.utm.my/wp-content/uploads/2024/05/Lembaga-Juruukur-Bahan-Malaysia.fw_.png \"Lembaga-Juruukur-Bahan-Malaysia.fw_\")\n\n#### Professional programmes are recognised by\n\n![](https://space.utm.my/wp-content/uploads/2024/05/Lembaga-Juruukur-Tanah.fw_.fw_.png \"Lembaga-Juruukur-Tanah.fw_.fw_\")"
}