{
  "markdown": "About Razak Faculty\n===================\n\n![](https://razak.utm.my/wp-content/uploads/2022/11/menara-razak-1.png \"menara razak\")\n\nOn 1st July 2018, the UTM Razak School of Engineering and Advanced Technology (UTM Razak School), Advanced Informatics School (UTM AIS) and Perdana School of Science, Technology and Innovation Policy (UTM Perdana School) are being merged to form a new faculty that is known as Razak Faculty of Technology and Informatics (RFTI). The merger was part of the UTM Synergy 4.0 transformation.\n\nThe UTM Razak School of Engineering and Advanced Technology (UTM Razak School) was established in 1992 which started out as one of UTM Centre of Excellence known as Business and Advanced Technology Centre (BATC) under an initiative conceived from the then prime minister, Tun Dr. Mahathir Mohamed. In May 2010, in line with the transformation of UTM Kuala Lumpur Campus, BATC was upgraded to faculty level and changed its name to UTM Razak School of Engineering and Advanced Technology (UTM Razak School).\n\n![](https://razak.utm.my/wp-content/uploads/2022/11/menara-razak.png \"menara razak\")\n\n![](https://razak.utm.my/wp-content/uploads/2022/11/bangunan-menara-razak.png \"bangunan menara razak\")\n\nAdvanced Informatics School (UTM AIS) was formerly known as the Centre for Advanced Software Engineering (CASE). The centre was conceptualised in 1995 out of an idea suggested to UTM by the then Minister of Defence YB Datuk Seri Mohd Najib bin Tun Razak for UTM to develop capacity in world-class software engineering. The intention then was to provide opportunities for advanced studies and professional development for current and future needs of software-based industries in Malaysia. In 2010, CASE was renamed as the Advanced Informatics School (UTM AIS). Launching of Advanced Informatics School was inaugurated by the then Yang Dipertuan Agong, Tuanku Mizan Zainal Abidin Ibni Almarhum Sultan Mahmud Al-Muktafi Billah Shah.\n\nUTM Perdana School of Science, Technology and Innovation Policy was established in 1995 and was formerly known as the Technology Policy Research Centre of UTM. In synchronization with UTM’s world-class university aspiration and thus the drive for a more involvement in the international issues related to science, engineering and technology, this historical progression is punctuated with the rebranding of the Technology Policy Research Centre to the Centre for Technology Policy & International Studies (CENTEPIS) in July 1998. The need to ensure a more holistic approach towards the science, technology and innovation policy culminated with the inception of the UTM Perdana School of Science, Technology and Innovation Policy in 2010 where the name was proposed by Tun Dr. Mahathir Mohamed, the Honorary President of Perdana Leadership Foundation and our current prime minister of Malaysia.\n\n![](https://razak.utm.my/wp-content/uploads/2022/11/bangunan-menara-razak-v2.jpg \"bangunan menara razak v2\")\n\n![](https://razak.utm.my/wp-content/uploads/2022/11/luar-menara-razak.jpg \"luar menara razak\")\n\nOver the years these three separate entities have developed strong linkages with a large number of industries and organizations, both locally and internationally, engaging in executive programmes, short courses, professional discourses, community services and innovative research. This community-linked and industry-driven focus are also reflected in the content which are injected into all their undergraduate and postgraduate programmes.\n\nWith the merger, as one new faculty, Razak Faculty of Technology and Informatics (RFTI) will continue to strive to be the forerunner in both academic and research endeavors. Its solid team of academic staff comprising of more than 90% PhD holders from various disciplines are its strongest asset. Backed by its dedicated support staff, RFTI will work towards excellence and distinction.\n\n![](https://razak.utm.my/wp-content/uploads/2022/11/luar-menara-razak-2.jpg \"luar menara razak 2\")\n\n![](https://razak.utm.my/wp-content/uploads/2022/04/WhatsApp-Image-2022-04-08-at-11.40.18-AM.jpeg)"
}