{
  "markdown": "#### ENDOWMEN UTM\n\nSupport UTM Today\n=================\n\nYour donation helps provide essential resources and opportunities for students in need. Join us in making a difference.\n\n[Donate Now](https://dvcdev.utm.my/endowmen/endowmen-utm-account)\n\n\n\n#### Make a Lasting Impact\n\nChoose how you want to contribute: one-time donations, recurring support, or targeted donations for specific causes. Every contribution counts.\n\n[Explore Donation Options](https://dvcdev.utm.my/endowmen/donation-options/)\n\nInspiring Stories from ENDOWMEN UTM Scholarship Recipients\n==========================================================\n\nMeet Dr. Muhammad Syakir Shukor, an exemplar of perseverance and success in life. As the second of five siblings and the son of two police officers, Dr. Syakir aspired to fund his own education at UTM since his other siblings were also studying. Thanks to the ENDOWMEN UTM Scholarship, he not only achieved his dream of graduating from UTM but exceeded his own expectations. He graduated with a Bachelor’s degree in Management with First Class Honors and received the prestigious Chancellor’s Award at UTM. He later earned his Doctor of Philosophy degree at UTM. Today, Dr. Syakir continues his efforts to help others as a Certified Ability Coach at Pengasih Melaka. Watch his inspirational story and how the UTM Endowment Scholarship was a catalyst for his success.\n\n_Temui Dr. Muhammad Syakir Shukor, contoh ketekunan dan kejayaan dalam kehidupan. Sebagai anak kedua daripada lima beradik dan anak kepada dua anggota polis, Dr. Syakir bercita-cita untuk membiayai pendidikannya sendiri di UTM kerana adik-beradiknya yang lain juga sedang belajar. Terima kasih kepada biasiswa Endowmen UTM, beliau tidak hanya mencapai impian sebagai graduan UTM, tetapi melampaui jangkaannya. Beliau adalah graduan Sarjana Muda Pengurusan dengan Kepujian Kelas Pertama dan penerima Anugerah Canselor yang berprestij di UTM. Beliau kemudiannya memperoleh Ijazah Kedoktoran Falsafah di UTM. Hari ini, Dr. Syakir meneruskan usaha untuk membantu orang lain dengan menjadi Jurulatih Kebolehan Bertauliah di Pengasih Melaka._  \n_Saksikan kisah inspirasinya dan bagaimana biasiswa Endowmen UTM menjadi salah satu pencetus kejayaan beliau._\n\nENDOWMEN UTM COMMUNITY SERVICE PROGRAMS\n=======================================\n\nKonvoi Merdeka UTM 2024: Semarak patriotisme dan tanggungjawab sosial\n=====================================================================\n\n**JOHOR BAHRU, 15 Sept. –**  Konvoi Merdeka UTM 2024, yang berlangsung pada 12 September 2024, berjaya menarik penyertaan seramai 400 peserta yang mengambil bahagian dalam perarakan dari Universiti Teknologi Malaysia (UTM) Johor Bahru menuju ke Pantai Teluk Mahkota (Jason Bay), Sedili. Acara ini dianggap sebagai program terbesar sejak ia diperkenalkan pada tahun 2020.\n\nProgram yang dirasmikan oleh Naib Canselor UTM, Prof. Datuk Ir. Ts. Dr. Ahmad Fauzi Ismail, melibatkan pelbagai jenis kenderaan termasuk 53 motosikal, 43 kereta, 2 lori, 2 bas, serta 35 motosikal milik penduduk kampung. Turut menyertai acara pelepasan Konvoi Merdeka UTM 2024 bersama Datuk Ahmad Fauzi ialah Pengerusi Bahagian Pemajuan Universiti, Prof. Dr. Yusof Boon; Timbalan Naib Canselor (Akademik dan Antarabangsa), Prof. Dr. Mohd Shafry Mohd Rahim; serta Pengarah Seksyen Dana Endowmen UTM, Prof. Madya Ts. Gs. Dr. Robiah Suratman. Konvoi ini bukan sahaja menyemarakkan semangat kemerdekaan, tetapi turut berjaya menyatukan pelbagai lapisan masyarakat dalam menyambut Hari Kemerdekaan Malaysia yang ke-67. \n\n[https://news.utm.my/ms/2024/09/konvoi-merdeka-utm-2024-semarak-patriotisme-dan-tanggungjawab-sosial/](https://news.utm.my/ms/2024/09/konvoi-merdeka-utm-2024-semarak-patriotisme-dan-tanggungjawab-sosial/)"
}