{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/lawatan-mahasiswa-universitas-bung-hatta-perkukuh-hubungan-dengan-utm#)\n    \n*   [Instagram](https://builtsurvey.utm.my/lawatan-mahasiswa-universitas-bung-hatta-perkukuh-hubungan-dengan-utm#)\n    \n*   [RSS](https://builtsurvey.utm.my/lawatan-mahasiswa-universitas-bung-hatta-perkukuh-hubungan-dengan-utm#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/lawatan-mahasiswa-universitas-bung-hatta-perkukuh-hubungan-dengan-utm#)\n    \n*   [Instagram](https://builtsurvey.utm.my/lawatan-mahasiswa-universitas-bung-hatta-perkukuh-hubungan-dengan-utm#)\n    \n*   [RSS](https://builtsurvey.utm.my/lawatan-mahasiswa-universitas-bung-hatta-perkukuh-hubungan-dengan-utm#)\n    \n\nLawatan Mahasiswa Universitas Bung Hatta Perkukuh Hubungan Dengan UTM\n=====================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Dec 23, 2019 | [event](https://builtsurvey.utm.my/category/event/)\n, [Global Outreach Program](https://builtsurvey.utm.my/category/global-outreach-program/)\n, [News](https://builtsurvey.utm.my/category/news/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2019/12/bung-hatta.png)\n\nPada 17-21 November 2019 yang lalu, seramai 56 mahasiswa dan mahasiswi Universitas Bung Hatta, Indonesia (UBH) telah menyertai program Delegasi Universitas Bung Hatta-Universiti Teknologi Malaysia (UBH-UTM) anjuran Persatuan Ukur Bahan dan Pembinaan (QS-Bina) UTM dan Jurusan Ukur Bahan UBH.\n\nPenganjuran program ini telah diketuai oleh Saudara  Tan Chi Khiong dan dibimbing oleh PM Sr. Dr. Mohd Saidin bin Misnan.\n\nProgram ini secara umumnya telah memberi pendedahan kepada mahasiswa tentang hubungan antarabangsa dan memberi pengalaman belajar di Universiti Teknologi Malaysia, Johor kepada mahasiswa dari negara luar. Mahasiswa UBH juga berkesempatan untuk menjalankan lawatan industri dan lawatan ke tapak pembinaan tempatan, demi meningkatkan kefahaman terhadap industri pembinaan di Malaysia.\n\nFirma-firma seperti Kas Juruukur Bahan Sdn Bhd, Total QS Services, ARH Juruukur Bahan Sdn Bhd, JB Bergabung Sdn Bhd dan Kelisa Murni Sdn Bhd telah memberi bantuan dan kerjasama dengan pemberian maklumat terkini dan penerangan tentang latihan dan teknik-teknik yang lazim digunakan oleh firma ukru bahan di Malaysia. Mahasiswa juga dapat mempelajari produk-produk konkrit yang digunakaan dalam pembinaan daripada pihak pentadbir Industrial Concrete Product Sdn Bhd.\n\nSelain itu, mahasiswa juga berpeluang untuk melawat projek-projek pembinaan yang sedang berjalan, iaitu pembinaan Arena Emas yang seluas 18.31 ekar di Taman Impian Emas dan Stadium Olahraga@Sportcity di Mount Austin yang dibangunkan oleh Kumpulan Prasarana Rakyat Johor Sdn Bhd (KPRJ). Projek Arena Emas dalam proses penyediaan kemudahan sukan serta gelanggang bagi sukan memanah, pentanque, lawn boling dan skuasy.\n\nProjek stadium olahraga pula direkabentuk mengikut sistem modular yang boleh menampung kapasiti sebanyak 5000 penonton, dilengkapi dengan _“full colour LED video mobile scoreboard”_ untuk digunakan semasa temasya SUKMA XX akan datang.\n\nTPr. Chau Loon Wei dari UTM Low Carbon Research Centre juga berkongsi kepakaran beliau mengenai konsep pembangunan rendah karbon, terutamanya inisiatif dan aplikasinya dalam bidang pembinaan. Menurut beliau, pendekatan rendah karbon adalah penting dalam pembangunan bandar yang mampan, memandangkan perubahan iklim sebagai ancaman paling besar terhadap alam sekitar dan manusia pada abad ke-21 ini.\n\nPameran adademik dan sesi pengalaman penyelidikan turut diadakan. Poster-poster karya penyelidikan mahasiswa Fakulti Alam Bina dan Ukur yang dipamerkan merangkumi topik-topik seperti analisis bangunan pencakar langit dunia, bahan pembinaan yang inovatif serta teknik-teknik terkini yang diterapkan dalam projek pembinaan. Selain itu, maklumat terperinci Program Bangsa Johor Bahagia yang telah dijalankan pada September – Oktober 2018 dan Mac- April 2019 turut dipamerkan.\n\nBukan itu sahaja, mahasiswa UBH juga dibawa untuk melawat tempat-tempat menarik di sekitar Johor Bahru seperti Forest City, Legoland, Yayasan Warisan Johor, Masjid Sultan Abu Bakar dan Johor Bahru Chinese Heritage Museum. Malam Kebudayaan bersama UBH juga mencorakkan pengalaman mahasiswa Indonesia dengan pelbagai persembahan dan pertunjukkan seni tradisional dari Malaysia dan Indonesia.\n\nSambutan meriah yang diterima menyakinkan ahli jawatankuasa Program Delegasi UBH-UTM 2019 untuk menjadikan program ini sebagai program tahunan dan diharapkan ia dapat menarik lebih ramai mahasiswa-mahasiswi antarabangsa demi menjalinkan silaturahim yang lebih kukuh pada masa akan datang."
}