{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/international-colloquium-on-cultural-heritage-and-challenge-of-sustainability-between-utm-architecture-program-malaysian-heritage-trust-department-of-national-heritage-unesco-icomos#)\n    \n*   [Instagram](https://builtsurvey.utm.my/international-colloquium-on-cultural-heritage-and-challenge-of-sustainability-between-utm-architecture-program-malaysian-heritage-trust-department-of-national-heritage-unesco-icomos#)\n    \n*   [RSS](https://builtsurvey.utm.my/international-colloquium-on-cultural-heritage-and-challenge-of-sustainability-between-utm-architecture-program-malaysian-heritage-trust-department-of-national-heritage-unesco-icomos#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/international-colloquium-on-cultural-heritage-and-challenge-of-sustainability-between-utm-architecture-program-malaysian-heritage-trust-department-of-national-heritage-unesco-icomos#)\n    \n*   [Instagram](https://builtsurvey.utm.my/international-colloquium-on-cultural-heritage-and-challenge-of-sustainability-between-utm-architecture-program-malaysian-heritage-trust-department-of-national-heritage-unesco-icomos#)\n    \n*   [RSS](https://builtsurvey.utm.my/international-colloquium-on-cultural-heritage-and-challenge-of-sustainability-between-utm-architecture-program-malaysian-heritage-trust-department-of-national-heritage-unesco-icomos#)\n    \n\nInternational Colloquium on Cultural Heritage and Challenge of Sustainability between UTM Architecture Program, Malaysian Heritage Trust, Department of National Heritage, UNESCO & ICOMOS\n==========================================================================================================================================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Mar 31, 2022 | [Conference & Seminar](https://builtsurvey.utm.my/category/conference-seminar/)\n, [News](https://builtsurvey.utm.my/category/news/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2022/04/unnamed-4-969x675.png)\n\nPrepared by: The Director of Architecture Program, Assoc. Prof. Dr. Alice Sabrina Ismail\n\nCultural heritage is a valuable factor that provides time-tested solutions for conflict prevention and reconciliation for establishing a sense of appreciation, unity and belonging in society.\n\nIn addition, it also provides a clear understanding of the past to inspire the future.\n\nRealizing this, the UTM Architecture program, in collaboration with Institut Sultan Iskandar (ISI), supported by the Malaysian Heritage Trust, Department of National Heritage, United Nations Educational, Scientific and Cultural Organization (UNESCO) and International Council on Monuments and Sites (ICOMOS), had conducted an online colloquium.\n\nThis colloquium aimed to promote and propagate awareness among the public on the role and the needs to preserve the value of cultural heritage namely in the current context.\n\nThis event was officiated by the Director of Architecture Program, Assoc. Prof. Dr. Alice Sabrina Ismail and moderated by Prof. Dr. Syed Ahmad Iskandar Syed Ariffin and Dr. Shahariah Norain Shaharuddin.\n\n![](https://ci4.googleusercontent.com/proxy/5GSIADZS_BKbgRrL9zm83sA-jGY1dJZSJweL8P4o237W9le-x_LLMbMXw45MhrRUiFLfdvt28TvuvC3auj2z0lbMBhBOefnGw6Z_ktwo3BhhgQ=s0-d-e1-ft#https://news.utm.my/wp-content/uploads/2022/01/2-1-1024x474.png)\n\nThe occasion was successfully held with four prominent guest speakers in heritage.\n\nThey are the Director-General of Department of National Heritage, Mr. Azmi Mohd Yusof, the President of ICOMOS, Ar. Tiong Kian Boon, and the council members of Malaysian Heritage Trust, Ar. Lim Take Bane and Ar. Anand Krishnan.\n\nThis event received positive feedback and managed to attract a large spectrum of local and international participants from various agencies and institutions.\n\nThe 4-hour dialogue session highlighted the legal instruments that support the development of national policies for heritage protection, emphasizing the preservation and delved into the aspects of methods and approaches to conserve the intangible and tangible cultural heritage in Malaysia and abroad.\n\nThis online colloquium promotes and heightens the sense of awareness among the public and propagates a feeling of responsibility in inculcating heritage values towards enhancing the quality of life and increasing overall well-being for both individuals and communities.\n\n![](<Base64-Image-Removed>)\n\nDue to overwhelmed response from many parties, the UTM Architecture program will organize more heritage platforms for international and local dialogue.\n\nThis is to foster mutual respect, appreciation and understanding in the future so that the wealth of heritage knowledge and skills can be transmitted from one generation to the next."
}