{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/pakar-fabu-utm-terbitkan-terjemahan-bahasa-melayu-bagi-istilah-geospatial-dalam-piawaian-antarabangsa-iso-tc211#)\n    \n*   [Instagram](https://builtsurvey.utm.my/pakar-fabu-utm-terbitkan-terjemahan-bahasa-melayu-bagi-istilah-geospatial-dalam-piawaian-antarabangsa-iso-tc211#)\n    \n*   [RSS](https://builtsurvey.utm.my/pakar-fabu-utm-terbitkan-terjemahan-bahasa-melayu-bagi-istilah-geospatial-dalam-piawaian-antarabangsa-iso-tc211#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/pakar-fabu-utm-terbitkan-terjemahan-bahasa-melayu-bagi-istilah-geospatial-dalam-piawaian-antarabangsa-iso-tc211#)\n    \n*   [Instagram](https://builtsurvey.utm.my/pakar-fabu-utm-terbitkan-terjemahan-bahasa-melayu-bagi-istilah-geospatial-dalam-piawaian-antarabangsa-iso-tc211#)\n    \n*   [RSS](https://builtsurvey.utm.my/pakar-fabu-utm-terbitkan-terjemahan-bahasa-melayu-bagi-istilah-geospatial-dalam-piawaian-antarabangsa-iso-tc211#)\n    \n\nPakar FABU UTM Terbitkan Terjemahan Bahasa Melayu bagi Istilah Geospatial dalam Piawaian Antarabangsa ISO/TC211\n===============================================================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Oct 13, 2021 | [News](https://builtsurvey.utm.my/category/news/)\n, [photo](https://builtsurvey.utm.my/category/photo/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2021/10/unnamed-1.jpg)\n\nOleh: Sr. Gs. Dr Zakri Tarmidi dan Sr. Siti Zuraida binti Kadir\n\nBidang Sains Maklumat Geografi (GIS) telah digunakan oleh pelbagai bidang, termasuk perancangan, ukur tanah, pertanian, geologi dan lain-lain.\n\nSetiap bidang mempunyai pelaksanaan yang berbeza dalam melaksanakan GIS, dan ini menyebabkan perbezaan dari pelbagai segi, terutama bentuk data, model data, kaedah penyimpanan data, pemprosesan data, seterusnya kepada hasil akhir data geospatial.\n\nUntuk memastikan pelaksanaan GIS dan perkara berkaitan data geospatial ini selaras, pihak Organisasi bagi Piawaian Antarabangsa (ISO) telah mewujudkan satu jawatankuasa khas, iaitu Jawatankuasa Teknikal ISO/TC211, _Geographic Information/Geomatics_. ISO/TC211 bertanggungjawab untuk merekabentuk, dan membangunkan piawaian berkaitan data geospatial, proses pembangunan data geospatial, pengumpulan data geospatial, pemprosesan, analisis, capaian, dan pemindahan serta perkongsian data geospatial secara atas talian.\n\nMalaysia juga mempunyai wakil di ISO/TC211, malah terdapat jawatankuasa khas di peringkat kebangsaan, iaitu dikenali sebagai Jawatankuasa Teknikal 2 (TC2) yang juga mempunyai fokus yang sama, akan tetapi memfokuskan kepada piawaian berkaitan geospatial di Malaysia.\n\nTC2 sering bekerjasama dengan Jabatan Standard Malaysia (JSM), dan Pusat Geospatial Negara (PGN) dalam membangunkan piawaian-piawaian berkaitan geospatial di Malaysia.\n\nMalah, untuk memartabatkan Bahasa Melayu di peringkat antarabangsa, pihak PGN dengan kerjasama JSM dan TC2 telah membangunkan Glosari Istilah Pelbagai Bahasa (_Multi-Lingual Glossary of Terms_, MLGT) dalam Bahasa Melayu.\n\nIanya dilaksanakan dengan menubuhkan satu kumpulan kerja khusus, iaitu Kumpulan Kerja Standardisasi MLGT (KK MLGT), yang bertujuan untuk meningkatkan konsistensi dalam menggunakan dan penafsiran istilah-istilah berkaitan geospatial.\n\nKK MLGT ini ditubuhkan pada tahun 2017 dan dipengerusikan oleh pensyarah dari Jabatan Geoinformasi, Fakulti Alam Bina dan Ukur UTM, Sr. Gs. Dr Zakri Tarmidi.\n\nSehingga kini, KK MLGT telah berjaya menterjemahkan sebanyak 360 istilah daripada istilah berbahasa Inggeris kepada istilah dalam Bahasa Melayu.\n\nMalah, pihak KK MLGT juga telah bekerjasama dengan Dewan Bahasa dan Pustaka (DBP) untuk memastikan kesahihan istilah-istilah yang diterjemahkan, dan seterusnya memasukkan istilah-istilah bagi bidang geospatial ini ke dalam laman sesawang Pusat Rujukan Persuratan Melayu (PRPM) di masa akan datang. Ianya akan lengkap dengan istilah-istilah, terjemahan Bahasa Melayu, dan definisi bagi setiap istilah ini.\n\nMenuju ke depan, KK MLGT dengan kerjasama PGN dan DBP akan terus menterjemahkan lebih banyak istilah berkaitan geospatial ini ke dalam Bahasa Melayu, dan seterusnya menerbitkan istilah-istilah glosari ini ke dalam kamus khusus untuk bidang geospatial.\n\nSemoga usaha ini berterusan dan berjaya di masa akan datang.\n\n\\*Dr Zakri Tarmidi merupakan pensyarah kanan di FABU, UTM, dan Pengerusi kepada Kumpulan Kerja MLGT bermula tahun 2020\n\n\\*Sr Siti Zuraida binti Kadir merupakan Penolong Pengarah Ukur, Jabatan Ukur dan Pemetaan Malaysia (JUPEM) Selangor, dan Sekretariat Kumpulan Kerja MLGT.\n\n![](https://ci5.googleusercontent.com/proxy/o9pGERm0xHyzVwEozttnyj3gnpXzMKEsP33kQleCabc4pr-z1qsLxw0M73N6mjPuDzffzdCQ2_qbIxdDfFn_m8O3xuU2wLnlXEWkXW9l9-C0_9hirKQL3FTvD1faGYkPbukOOOnDuLhVlcmj9vqj4-kss4t2ha0=s0-d-e1-ft#https://news.utm.my/wp-content/uploads/2021/08/WhatsApp-Image-2021-08-25-at-3.15.39-PM-1024x676.jpeg)![](<Base64-Image-Removed>)"
}