{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/utm-tku-uorm-first-collaborative-webinar-series-on-delay-disruption-protocol-in-building-industry#)\n    \n*   [Instagram](https://builtsurvey.utm.my/utm-tku-uorm-first-collaborative-webinar-series-on-delay-disruption-protocol-in-building-industry#)\n    \n*   [RSS](https://builtsurvey.utm.my/utm-tku-uorm-first-collaborative-webinar-series-on-delay-disruption-protocol-in-building-industry#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/utm-tku-uorm-first-collaborative-webinar-series-on-delay-disruption-protocol-in-building-industry#)\n    \n*   [Instagram](https://builtsurvey.utm.my/utm-tku-uorm-first-collaborative-webinar-series-on-delay-disruption-protocol-in-building-industry#)\n    \n*   [RSS](https://builtsurvey.utm.my/utm-tku-uorm-first-collaborative-webinar-series-on-delay-disruption-protocol-in-building-industry#)\n    \n\nUTM-TkU-UoRM First Collaborative Webinar Series on Delay & Disruption Protocol in Building Industry\n===================================================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Mar 24, 2021 | [Meeting & Workshop](https://builtsurvey.utm.my/category/meeting-workshop/)\n, [News](https://builtsurvey.utm.my/category/news/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2021/03/unnamed-752x675.jpg)\n\nThe first collaborative webinar series by three collaboration universities namely Universiti Teknologi Malaysia (UTM), Tamkang University (TkU), and University of Reading Malaysia (UoRM), was successfully held on 9 March 2021. The collaborative webinar series is rotated among the universities, whereby the first series was initiated by TkU, followed by UoRM and ended by UTM from early of March until end of April 2021.\n\nThe collaborative webinar series has been established to promote the knowledge exchange and transfer between the universities to staff and students, enhance the interactions between collaborated parties, as well as to ensure the collaborations of the research projects will be delivered in the best possible ways to achieve the optimized success, benefit and value.\n\nThe involved team from UTM is lead by Prof. Ts. Dr. Mohd Hamdan Ahmad (Deputy Vice-Chancellor of Development UTM) and the members of the team consist of Dr. Leng Pau Chung, Dr. Gabriel Ling Hoh Teck (Faculty of Built Environment and Surveying), Dr. Eeydzah Aminudin (School of Civil Engineering), and Dr. Chan Weng Howe (School of Computing).\n\nIn the other hand, the team from UoRM is lead by Dr. Bruno Lot Tanko, MRICS (Head of Built Environment) and Dr. Celine Lee Cen Ying (Henley Business School) while the team from TkU is lead by Assoc. Prof. Dr. Fan-Su Ling. The collaboration program was initiated from the mid of year 2020 to work hand-in-hand among the three universities in international collaboration fund research project.\n\nThe first collaborative webinar was run concurrently with the Construction Management Lecture managed by Prof. Fan- Su Ling from TkU, Taiwan with Dr. Leng Pau Chung, UTM senior lecturer as the session moderator. Prof. Fan-Su Ling is Assoc. Prof. from Department of Civil Engineering, the Director of Taiwan-Malaysia Digital Technology International Center (DiCTIC), the Director of Research Development Center of Construction Law (CLC), TkU as well as International Advisory board, Journal of Surveying, Contraction and Property (JSCP).\n\nThe shared topic which titled “Delay and Disruption Protocol” was mainly about the impact of the project delay as well as the selected case studies happened in Taiwan building industry. Through the webinar, the participants from Malaysia had the opportunity to understand the scenario in construction flow and solutions applied in Taiwan building industry. The webinar had wrapped up with the Q&A session followed by the speaker’s conclusion.\n\n![](https://ci5.googleusercontent.com/proxy/NistX9OnbIaYXJuANiiAqB2-EIWtn2F-AtxylsdoXvUQTGbNNm0NGDLIb53LvkobTogCyMeEza8wwsEmvOJRjqTQYGJqhsvlA_7FFuDH3RHzhg=s0-d-e1-ft#https://news.utm.my/wp-content/uploads/2021/03/2-1-1024x490.png)\n\n![](<Base64-Image-Removed>)\n\n![](<Base64-Image-Removed>)\n\n_The collaborative webinar series no.1 delivered by Prof. Fan-Su Ling from Tamkang University, Taiwan and moderated by Dr. Leng Pau Chung, senior lecturer from Architecture Programme, Faculty of Built Environment and Surveying, UTM_\n\nPrepared by:\n\nDr. Leng Pau Chung"
}