{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/international-design-colloquium-series-2-between-architecture-schools-from-universitas-tanjungpura-and-universiti-teknologi-malaysia#)\n    \n*   [Instagram](https://builtsurvey.utm.my/international-design-colloquium-series-2-between-architecture-schools-from-universitas-tanjungpura-and-universiti-teknologi-malaysia#)\n    \n*   [RSS](https://builtsurvey.utm.my/international-design-colloquium-series-2-between-architecture-schools-from-universitas-tanjungpura-and-universiti-teknologi-malaysia#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/international-design-colloquium-series-2-between-architecture-schools-from-universitas-tanjungpura-and-universiti-teknologi-malaysia#)\n    \n*   [Instagram](https://builtsurvey.utm.my/international-design-colloquium-series-2-between-architecture-schools-from-universitas-tanjungpura-and-universiti-teknologi-malaysia#)\n    \n*   [RSS](https://builtsurvey.utm.my/international-design-colloquium-series-2-between-architecture-schools-from-universitas-tanjungpura-and-universiti-teknologi-malaysia#)\n    \n\nInternational Design Colloquium Series 2 Between Architecture Schools from Universitas Tanjungpura and Universiti Teknologi Malaysia\n====================================================================================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Aug 2, 2021 | [Conference & Seminar](https://builtsurvey.utm.my/category/conference-seminar/)\n, [News](https://builtsurvey.utm.my/category/news/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2021/08/unnamed.jpg)\n\n_Prepared by: Dr. Muhammad Faizal bin Abdul Rani (UTM Senior Lecturer)_\n\nOn 1st July 2021, Universiti Teknologi Malaysia (UTM) Architecture Programme had conducted International Design Colloquium Series 2 between Universitas Tanjungpura (UNTAN) and UTM. This event was a continuity from the previous Series 1, a version for architecture master students.\n\nDuring this event, the selected undergraduate students have to showcase their work based on their studio project brief. There were more than 100 participants from Malaysia, Indonesia and China architecture schools.\n\nThis event was chaired by Dr. Muhammad Faizal Abdul Rani and started with a welcoming speech from Prof. Dr. Syed Ahmad Iskandar Syed Ariffin, the Director of Institute Sultan Iskandar. The event was then followed by a speech from Dr. Ing. Ir. Slamet Widodo, the Vice-Dean for Academic Affairs, Faculty of Engineering & Architecture, UNTAN.\n\nThere were four panellists from UTM Architecture school who had participated in this event such as Dr. Iziq Eafifi Ismail, Dr. Leng Pau Chung, Ar. Chan Wai Lai and Dr. Izura Tukiman. Meanwhile, UNTAN Architecture school was also represented by four panellists which were Dr. Uray Fery Andi, Bapak Affrilyno, Dr. Syaiful Muazir and Ibu Lestari.\n\nIn addition, six students from UTM Architecture school had also take part in this event. They were Alya Mohd Noor (Playlab), Ani Nadirah Anuar (Kempas Wellness Centre), Amirul Danial Othman Amin Nordin (ICIPD Research Center), Lee Zhi Kang (Sou Fijumoto Architect Office – Explore the in Between), Ahmad Januar Akbar Mubarok (A Marine Activist Training Centre) and Kristine Low Sze Min (Palace of Equity: Johor Bahru Inclusive Learning Centre).\n\nMeanwhile, the student representatives from UNTAN were Surya Priva Jaya (Wasaloka – Science Techno Park & Innovation Center Universitas Tanjungpura), Yasmin Alifia Amanda (Lakuna – Hotel, Convention and Training Center), Grace Novika (Universitas Tanjungpura Science Techno Park – Unify Green and Sustainable), Muhammad Adji Maulana (Green Canyon Hotel, Convention and Training Center), Norita (Green Science Techno Park – Universitas Tanjungpura) and Anandea Maharani Azzahra (Arunika Hotel, Convention, & Training Center Universitas Tanjungpura).\n\nTwo parallel sessions were held at Room 1 which was moderated by Dr. Muhammad Faizal Abdul Rani from UTM and Room 2 by Dr. Azalillah Ramdani Musa from UTM. For each session, the panels had provided various comments and inputs based on the project presented.\n\nOverall, this online event was extremely beneficial to both institutions because it had provided the platform and opportunity to share expertise and relate it with the current situation. This event also showed that more collaboration are possible to be done in the future to help strengthen bilateral networking between the two universities.\n\n*   ![](https://ci3.googleusercontent.com/proxy/ZVqKCXYmbtMBAHXEZWaQ5oQ40LEly_zDJlPaHuIBVIy_BwUUCWPiRIxLcEm5IWyhpmUowIjY8A6DquId1c1S0YeBUoltaIGNjgi0JU4QSsYI_3kKdYATIYzm=s0-d-e1-ft#https://news.utm.my/wp-content/uploads/2021/07/Picture3-3-1024x1006.png)"
}