{
  "markdown": "[Skip to content](https://fai.utm.my/master-of-science-engineering-business-management#content \"Skip to content\")\n\n### ****Master of Science** (Engineering Business Management)**\n\n*   [**Overview**](https://fai.utm.my/master-of-science-engineering-business-management#uagb-tabs__tab0)\n    \n*   [**Programme Educational Objectives**](https://fai.utm.my/master-of-science-engineering-business-management#uagb-tabs__tab1)\n    \n*   [****Learning Outcomes****](https://fai.utm.my/master-of-science-engineering-business-management#uagb-tabs__tab2)\n    \n*   [**Programme Structure**](https://fai.utm.my/master-of-science-engineering-business-management#uagb-tabs__tab3)\n    \n*   [**Study Plan**](https://fai.utm.my/master-of-science-engineering-business-management#uagb-tabs__tab4)\n    \n*   [**Admission Criteria**](https://fai.utm.my/master-of-science-engineering-business-management#uagb-tabs__tab5)\n    \n*   [**Career Prospect**](https://fai.utm.my/master-of-science-engineering-business-management#uagb-tabs__tab6)\n    \n*   [**Programme Fees**](https://fai.utm.my/master-of-science-engineering-business-management#uagb-tabs__tab7)\n    \n*   [**Double Master Programme**](https://fai.utm.my/master-of-science-engineering-business-management#uagb-tabs__tab8)\n    \n*   [**Quick Facts**](https://fai.utm.my/master-of-science-engineering-business-management#uagb-tabs__tab9)\n    \n\n###### **Overview**\n\nThe Master of Science (Engineering Business Management) is an integrated programme that offers essential management and business skills as well as in technology and operations, and opportunities for further updating and enhancing knowledge in engineering. This programme focuses on the application of knowledge, hence participants may directly contribute in adding values to their employers specifically, and to the industry generally.\n\nThe MEBM program is implemented in modular mode, whereby modules are taken sequentially instead of concurrently as in the traditional master programme implementation. A total of 46 credits are required for graduation, comprising 12 taught modules of 3 credits each and a master project worth 10 credits. The duration of study is 1½ years for full-time and 2 years for part-time study. This programme aims to prepare working professionals in the engineering and other professions in engineering or technology based organizations working for transition into senior executive positions or engineering (or other professional) management roles and to prepare for life-long learning.\n\n[MQA](https://www2.mqa.gov.my/mqr/english/epapariptaAA.cfm?IDAkrKP=16275)\n\n###### **Programme Educational Objectives**\n\nProduce graduates who are able to:\n\n![](https://fai.utm.my/wp-content/uploads/2024/05/fast-forward_4662135.png)Proficient in the contemporary knowledge and in developing new knowledge in the field of engineering business management.\n\n![](https://fai.utm.my/wp-content/uploads/2024/05/fast-forward_4662135.png)Prominent and resilient leaders in organizations with effective professional skills.\n\n![](https://fai.utm.my/wp-content/uploads/2024/05/fast-forward_4662135.png)Uphold ethical values in carrying out responsibilities towards organization and society.\n\n###### **Learning Outcomes**\n\nAt the end of the programmed students are able to:\n\n![](https://fai.utm.my/wp-content/uploads/2024/05/fast-forward_4662135.png)Synthesize advanced information, specialized concepts, theories, and methods in the field of engineering business management.\n\n![](https://fai.utm.my/wp-content/uploads/2024/05/fast-forward_4662135.png)Construct solutions to complex problems in engineering business management.\n\n![](https://fai.utm.my/wp-content/uploads/2024/05/fast-forward_4662135.png)Apply practical skills and tools that are based on the latest development in the field of engineering business management.\n\n![](https://fai.utm.my/wp-content/uploads/2024/05/fast-forward_4662135.png)Collaborate with different people in learning and working communities, and network with other groups ethically and professionally.\n\n![](https://fai.utm.my/wp-content/uploads/2024/05/fast-forward_4662135.png)Communicate effectively the knowledge, concepts and ideas to diverse audience using the appropriate methods).\n\n![](https://fai.utm.my/wp-content/uploads/2024/05/fast-forward_4662135.png)Use appropriate digital technologies and software to enhance work or practice in engineering business management.\n\n![](https://fai.utm.my/wp-content/uploads/2024/05/fast-forward_4662135.png)Evaluate numerical and graphical data in engineering business management by applying mathematical, quantitative and qualitative tools/methods.\n\n![](https://fai.utm.my/wp-content/uploads/2024/05/fast-forward_4662135.png)Demonstrate autonomy, leadership, and responsibility in managing work within own team and with other teams in various situations.\n\n![](https://fai.utm.my/wp-content/uploads/2024/05/fast-forward_4662135.png)Demonstrate self-advancement through continuous academic or professional development.\n\n![](https://fai.utm.my/wp-content/uploads/2024/05/fast-forward_4662135.png)Initiate or lead entrepreneurial ventures or projects.\n\n![](https://fai.utm.my/wp-content/uploads/2024/05/fast-forward_4662135.png)Demonstrate adherence to ethical and professional codes of practice in executing work.\n\nDetailed requirements of Master of Science (Engineering Business Management) programme.\n\n[View](https://fai.utm.my/wp-content/uploads/2024/05/PS-MSc-Engineering-Business-Management-1.pdf)\n[Download](https://fai.utm.my/wp-content/uploads/2024/05/PS-MSc-Engineering-Business-Management-1.pdf)\n\nTailor your studies to suit your goals.\n\n###### **Entry Requirements**\n\nThe normal requirement for admission to the programme is a four-year bachelor degree recognized by the university in either engineering or sciences.\n\n[All Information](https://admission.utm.my/)\n\n[Local Student](https://admission.utm.my/malaysian-postgraduate-study/)\n\n[International Student](https://admission.utm.my/international-postgraduate-study/)\n\nAI is permeating every industry. Recent job opportunities:-\n\n![](https://fai.utm.my/wp-content/uploads/2024/05/fast-forward_4662135.png)Managers\n\n![](https://fai.utm.my/wp-content/uploads/2024/05/fast-forward_4662135.png)Engineers\n\n![](https://fai.utm.my/wp-content/uploads/2024/05/fast-forward_4662135.png)Educators\n\n![](https://fai.utm.my/wp-content/uploads/2024/05/fast-forward_4662135.png)Consultants\n\n![](https://fai.utm.my/wp-content/uploads/2024/05/fast-forward_4662135.png)Senior Executives\n\n###### **Programmes Fees**\n\nThe mainstream programme fees for a bachelor’s degree in engineering or sciences offered by the university.\n\n[Local Student](https://admission.utm.my/fees-pg-malaysian/)\n\n[International Student](https://admission.utm.my/fees-pg-inter/)\n\n##### ******OPPORTUNITY FOR DOUBLE MASTERS PROGRAM******\n\n###### ****INTERNATIONAL DOUBLE MASTERS PROGRAM IN ENGINEERING BUSINESS MANAGEMENT (UTM) AND MASTER IN BUSINESS ADMINISTRATION (MEIJI UNIVERSITY****\n\nThe Double Masters Program with Meiji University, Japan, represents a groundbreaking collaboration between the Faculty of Artificial Intelligence at UTM and a prestigious Japanese institution. Exclusively available to Malaysian students registered for MSc (EBM), this program offers a unique opportunity for students to pursue simultaneous degrees in Engineering Business Management (EBM) and Master in Business Administration (MBA).\n\nUnder this program, students can register for the EBM program at UTM, with the credits earned being transferable to the Meiji MBA program. Upon successful completion, UTM will confer a Master’s in Engineering Business Management, while Meiji University will award a Master’s in Business Administration.\n\nStudents are required to attend courses at Meiji University for a minimum of two weeks during their study period, primarily for project/thesis supervision. Additionally, students must enroll in at least one MBA elective at Meiji University. The remaining electives can be completed either at Meiji University or at UTM, taught by staff from Meiji University. Furthermore, students from Meiji University will also have the opportunity to enroll in EBM modules in Malaysia alongside other participants.\n\nThe UTM-Meiji Double Masters Program offers a unique cross-cultural learning experience for students from both countries. As premier institutions in their respective nations, this program equips students with specialized skills to navigate the complexities of business and engineering. It enhances decision-making capabilities and strategic planning skills, preparing students for leadership roles in diverse professional settings.\n\nAdmission to the double Masters program is contingent upon passing an interview and receiving approval from Meiji University. It’s important to note that Meiji University reserves the right to limit the number of EBM students enrolling in its MBA program for administrative reasons.\n\nFor those interested in enrolling in the double Masters program, an additional RM10,000 registration fee will be imposed on top of the normal MEBM registration fee. This fee does not cover accommodation, travel, food, class materials, and other expenses while in Japan. The estimated minimum cost is RM6,000, though this may vary depending on the exchange rate.\n\nThis program presents an unparalleled opportunity for personal and professional growth, bridging the gap between academic excellence and real-world application in the dynamic fields of business and engineering.\n\n### Quick Facts!\n\n##### **Industry-Focused**\n\n##### **AI-Infused**\n\n##### **Package 1 : 1.5 Years**\n\n##### **Package 2 : 2 Years**\n\n##### **Credit Hours : 46**\n\n[](https://www.instagram.com/utmfai/)\n[](https://www.facebook.com/utmfai)\n[](https://www.youtube.com/@utmfai)\n[](https://www.tiktok.com/@utm_fai)\n\n[](javascript:void(0);)"
}