{
  "markdown": "Academic Office : +607-5333716 | Email : academic-fcee@utm.my | Administration Office : +607-5533499 [fcee@utm.my](mailto:fcee@utm.my)\n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n**BACHELOR OF NUCLEAR ENGINEERING WITH HONOURS**\n\nDepletion of the country’s petroleum and gas reserves has prompted the country to look for alternative sources of energy. Nuclear energy is one of the best alternative sources of energy. Rapid developments in the application of nuclear engineering in other sectors such as defence, medical and agriculture are demanding for more nuclear engineers. It has been shown that one of the critical conditions for the successful introduction of a nuclear power programme and other nuclear related industries is the availability of trained manpower that meets the desired quality and quantity. These reasons have called for the establishment of education/training infrastructures as well as national education and training capabilities in the field of engineering and science in order to develop qualified personnel for the nuclear power programme. \n\n**Read more…**\n\nNuclear engineering deals with the practical applications of nuclear processes. The main objective of this programme is to train and prepare students to become nuclear engineers with the capability in designing, producing and constructing in the aspects of research and development (R&D), maintenance, sales, consultancy, education, and training. Nuclear engineering is based upon the extensive use of mathematics and physical principles. These principles are applied to radioactivity, nuclear interactions and the interaction of radiation with materials. Further applications require the knowledge of energy removal and conversion, materials science, instrumentation and control, and chemistry. The programme is designed such that the graduates are be able to perform tasks and functions for nuclear power related fields which primarily require nuclear-related qualifications in both design and construction in the operation of a nuclear power plant and in other nuclear related industries.\n\nApart from the technical competencies, this program is also designed to improve students’ generic skills. These include critical thinking, communication, leadership, team working, life-long learning, ethics, and entrepreneurship.\n\n*   [Programme Specifications](https://fkt.utm.my/bachelor-of-nuclear-engineering-2#)\n    \n*   [Programme Educational Objectives (PEO)](https://fkt.utm.my/bachelor-of-nuclear-engineering-2#)\n    \n*   [Programme Learning Outcomes (PLO)](https://fkt.utm.my/bachelor-of-nuclear-engineering-2#)\n    \n*   [Engineering Programme Accreditation](https://fkt.utm.my/bachelor-of-nuclear-engineering-2#)\n    \n*   [Program Structure](https://fkt.utm.my/bachelor-of-nuclear-engineering-2#)\n    \n*   [Career opportunities](https://fkt.utm.my/bachelor-of-nuclear-engineering-2#)\n    \n*   [Entry requirement](https://fkt.utm.my/bachelor-of-nuclear-engineering-2#)\n    \n*   [Graduation Checklist](https://fkt.utm.my/bachelor-of-nuclear-engineering-2#)\n    \n\n|     |     |     |\n| --- | --- | --- |\n| 1.   Programme Name | Bachelor in Nuclear Engineering with Honours |     |\n| 2.   Final Award | Bachelor in Nuclear Engineering with Honours |     |\n| 3.   Awarding Institution | Universiti Teknologi Malaysia |     |\n| 4.   Teaching Institution | Universiti Teknologi Malaysia |     |\n| 5.   Professional or Statutory Body of Accreditation | Engineering Accreditation Council (EAC) Board of Engineers Malaysia (BEM) |     |\n| 6.   Language(s) of Instruction | English and Bahasa Melayu |     |\n| 7.   Mode of Study (Conventional, distance learning, etc) | Conventional |     |\n| 8.   Mode of operation (Franchise, self-govern, etc) | Self-governing |     |\n| 9.   Study Scheme (Full Time/Part Time) | Full Time |     |\n| 10\\. Study Duration | Minimum   : 4 yrs<br><br>Maximum  : 6 yrs |     |\n| Type of Semester | No. of Semesters | No. of weeks per semester |\n| Normal | 8   | 14  |\n| Short | 4   | 8   |\n\nAfter having exposed to 3 to 5 years working experience, our graduates should become professionals who demonstrate the following competencies:\n\n**PEO1** – Perform competently in chemical/ petroleum/ bioprocess/ gas/ nuclear Industries and become important contributors to national development.\n\n**PEO2** – Become creative, innovative and adaptable engineers as leaders or team members in their organizations and society.\n\n**PEO3** – Contribute professionally towards the environmental well-being and sustainable development\n\nAfter having completed the programme, graduates should be able to demonstrate the following competencies\n\n|     |     |\n| --- | --- |\n| **Code** | **Intended Learning Outcomes** |\n| PLO1 (KW) | Ability to apply knowledge of mathematics, natural science, engineering fundamentals, chemical/petroleum/bio-process/ gas/nuclear engineering principles to the solution of complex engineering problems. |\n| PLO2 | Ability to identify, formulate, conduct research literature, and |\n| (THPA) | analyze   complex   chemical/   petroleum/ bio-process/ gas/ nuclear   engineering   problems   using first principles of mathematics and engineering sciences. |\n| PLO3 (THDS) | Ability to design solution for complex chemical/ petroleum/ bio-process/gas/nuclear engineering problems and design system or process to meet specified needs with appropriate consideration for public health and safety, cultural, societal, and environmental considerations. |\n| PLO4 (THI) | Ability to conduct investigation of complex chemical/ petroleum/ bioprocess/ gas/ nuclear engineering problems using research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of information to provide valid conclusions. |\n| PLO5 (SCMT) | Ability to inculcate modern computational techniques and tools complex chemical/ petroleum/ bio-process/ gas/ nuclear which include prediction and modeling to solve complex engineering problem with an understanding of the limitations. |\n| PLO6 (AD) | Ability to responsibly act as well as respond to the societal health, safety, environment, legal and cultural issues that are relevant to the professional engineering practice. |\n| PLO7 (GCS) | Ability to explain and evaluate the sustainability and impact of professional engineering work in the solution of complex chemical/ petroleum/ bio-process/ gas/ nuclear engineering problems in societal and environmental contexts. |\n| PLO8 (GCE) | Ability to apply ethical principles and commit to professional ethics and responsibilities and norms  of engineering practice. |\n| PLO9 (CS) | Ability to communicate effectively through written and oral modes to all levels of society |\n| PLO10 (TW) | Ability to work independently, and as a member or a leader in a team to manage project in multi-disciplinary environment. |\n| PLO11 (SC) | Ability to acquire knowledge and engage in independent and life-long learning. |\n| PLO12 (ES) | Ability demonstrate knowledge of engineering management principles and entrepreneurial mindset to manage projects in multi-disciplinary environments. |\n\nNote: KW = Engineering Knowledge; THPA = Thinking Skills-Problem Analysis; THDS= Thinking Sills Design/Development of Solution; THI =Thinking Skills-Investigation; SCMT= Scholarship Modern Tool Usage; AD = Global Citizen Adaptability; GCS = Global Citizen Sustainability; GCE = Global Citizen Ethics; CS = Communicating  Skills; TW = Leadership and Team Working; SC = Life Long Learning; ES = Enterprising Skills\n\n[MALAYSIAN QUALIFICATION REGISTER](https://www2.mqa.gov.my/mqr/english/epapariptaAA.cfm?IDAkrKP=16393)\n\n[ENGINEERING PROGRAMME ACCREDITATION (CPS CEA Knowledge Profile)](https://fkt.utm.my/wp-content/uploads/2020/04/ENGINEERING-PROGRAMME-ACCREDITATION-CPS-CEA-Knowledge-Profile.pdf)\n\n[Undergraduate Guidebook 2024/2025](https://fkt.utm.my/wp-content/uploads/2024/09/GUIDEBOOK-UG-FKT-1-2024-2025.pdf)\n\nNuclear engineering fields cover a wide area of career opportunities in energy, medicine, security, environment, and satellites.  Nuclear engineering program offered by UTM does not only focuses on producing holistic graduates in nuclear engineering but also allows them to be universal, versatile, and flexible in both nuclear and non-nuclear sectors.\n\nMost of the Nuclear Engineering UTM graduates find employment in the public sectors such as government agencies, universities, hospitals and in the private sectors such as Semiconductor, Oil and Gas Maintenance, Non-Destructive Testing (NDT), Radiation Protection Officers, Manufacturing, and Application Engineering. The rest of them further their studies in nuclear engineering and also in other disciplines such as chemical engineering, mechanical engineering, gas engineering, bioprocess, and energy management.\n\n**Malaysian**\n\n[https://admission.utm.my/undergraduate-malaysian/](https://admission.utm.my/undergraduate-malaysian/ \"Malaysian\")\n\n**International**\n\n[https://admission.utm.my/undergraduate-international/](https://admission.utm.my/undergraduate-international/ \"International\")\n\n**For further enquiries please contact:**\n\n![Mohsin bin Mohd Sies](https://fkt.utm.my/wp-content/uploads/2019/03/Mr.-Mohsin-bin-Mohd-Sies.jpg)   **Dr. Mohsin bin Mohd Sies  \n   Programme Director (Nuclear)**  \n   Office: +607-5535478  \n   Email: mohsin@utm.my"
}