{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/perkongsian-pensyarah-fabu-bersama-institut-teknologi-sepuluh-nopember-berkaitan-kemampanan#)\n    \n*   [Instagram](https://builtsurvey.utm.my/perkongsian-pensyarah-fabu-bersama-institut-teknologi-sepuluh-nopember-berkaitan-kemampanan#)\n    \n*   [RSS](https://builtsurvey.utm.my/perkongsian-pensyarah-fabu-bersama-institut-teknologi-sepuluh-nopember-berkaitan-kemampanan#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/perkongsian-pensyarah-fabu-bersama-institut-teknologi-sepuluh-nopember-berkaitan-kemampanan#)\n    \n*   [Instagram](https://builtsurvey.utm.my/perkongsian-pensyarah-fabu-bersama-institut-teknologi-sepuluh-nopember-berkaitan-kemampanan#)\n    \n*   [RSS](https://builtsurvey.utm.my/perkongsian-pensyarah-fabu-bersama-institut-teknologi-sepuluh-nopember-berkaitan-kemampanan#)\n    \n\nPerkongsian Pensyarah FABU bersama Institut Teknologi Sepuluh Nopember berkaitan Kemampanan\n===========================================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Nov 28, 2021 | [Conference & Seminar](https://builtsurvey.utm.my/category/conference-seminar/)\n, [News](https://builtsurvey.utm.my/category/news/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2021/11/unnamed-1-554x675.png)\n\nOleh: Dr. Zakri Tarmidi, Jabatan Geoinformasi, Fakulti Alam Bina dan Ukur, Universiti Teknologi Malaysia\n\nPensyarah FABU berkongsi Penilaian Kemampanan Kawasan Perumahan bersama Institut Teknologi Sepuluh Nopember (ITS)\n\nInstitut Teknologi Sepuluh Nopember Global Engagement (ITS Global Engagement) telah menganjurkan webinar antarabangsa yang dikenali sebagai Siri Syarahan Jemputan (Guest Lecture Series, GLS) berkaitan “_Sustainable Development Goals_, SDG”.\n\nProgram ini telah dilaksanakan pada 2 November 2021, dengan menjemput dua pensyarah jemputan, iaitu  Prof. Madya Dr. Bram Entrop daripada Saxion University of Applied Sciences, dan juga Dr. Zakri Tarmidi daripada Fakulti Alam Bina dan Ukur (FABU), Universiti Teknologi Malaysia (UTM). Moderator bagi program kali ini ialah Dr. Sarah Cahyadini, pensyarah Jabatan Arkitek, ITS.\n\nDr. Zakri Tarmidi telah dijemput bagi menyampaikan syarahan berkaitan tajuk “_Social Sustainability Based on Location Based Indicators for Residential Area: Affordable Housing_”. Dr. Zakri telah mengupas berkenaan kajiannya yang bertajuk kaedah bagi menilai tahap kemampanan dari aspek sosial bagi kawasan perumahan Malaysia, khususnya bagi Perumahan Mampu Milik. Manakala Prof. Madya Dr. Bram Entrop telah menyampaikan syarahan bertajuk “_The Adoption of Energy Techniques and Measures in Residential Buildings: a Multidisciplinary Perspective_”.\n\nSiri Syarahan Jemputan ini berlangsung sekitar 2 jam, dan dihadiri lebih daripada 150 peserta antarabangsa, terutama pelajar dan pensyarah daripada ITS Surabaya. Selain itu terdapat juga penyertaan dari Malaysia, dan lain-lain negara.\n\nIni bukanlah kali pertama pihak ITS bekerjasama dengan UTM dalam siri syarahan jemputan ini. Diharapkan kerjasama antara pihak ITS dan UTM dapat dikembangkan lagi pada masa akan datang.\n\n![](https://ci3.googleusercontent.com/proxy/9WNHSJY0ZzbDEYGX3inOKwRNvbLQapK6zCezpP25WhuIJMj5we_xuUVNVx8MCthT_lHyX9mGVuZeWbLy7tOtQ3Qh--7srbamM40R4IE=s0-d-e1-ft#https://news.utm.my/wp-content/uploads/2021/11/image-4.png)_Sesi perkongsian bersama pihak ITS_\n\n![](<Base64-Image-Removed>)_Moderator daripada ITS, Dr Sarah Cahyadini_\n\n![](<Base64-Image-Removed>)_Latar belakang speaker pertama, Prof Madya Dr Bram Entrop_\n\n![](<Base64-Image-Removed>)_Latar belakang speaker kedua_\n\n![](<Base64-Image-Removed>)_Tajuk yang dikongsikan oleh Prof Madya Dr Bram Entrop_\n\n![](<Base64-Image-Removed>)_Sesi bergambar bersama peserta dan speaker di akhir sesi_"
}