{
  "markdown": "Industrial Visit to Universal Cable\n===================================\n\nby [powerpic](https://fke.utm.my/author/powerpic/ \"Posts by powerpic\")\n | Nov 30, 2015 | [POWER](https://fke.utm.my/category/power/)\n\n![universal-cable](https://fke.utm.my/wp-content/uploads/2016/12/Universal-Cable.png)\n\nAn industrial visit to Universal Cable (M) Sdn. Bhd. was organised for undergraduate students of the Faculty of Electrical Engineering, Universiti Teknologi Malaysia on 29 November 2015. The company is located about 20 km from Universiti Teknologi Malaysia in the industrial area of Tebrau, Johor Bahru. The trip, coordinated by Dr. Noor Azlinda Ahmad, was organised to fulfil one of the requirements of the faculty’s undergraduate subject – Introduction to Electrical Engineering. The main objectives of the visit were to expose students to the real working environment as electrical engineers, to give exposure and knowledge to students on the manufacturing of high voltage cables and to increase students’ awareness on challenges that they are likely to face in real working lives.\n\nAt the very beginning of the visit, the students were greeted by the General Manager of the company, Mr. Fadzil Ahmad. The students were then provided a brief introduction about the company. After the briefing, the students were divided into two groups, where each group was taken to the production area to witness the production of a cable. Generally, there are several steps involved in the production of a cable. The first step is called the stranding process, followed by the insulation process for filling a compound to the cable. The next step involves the jacketing process where a cable core is protected by a metal sheathing of either aluminium or aluminium and steel combinations. The final step is called the detection process, where the cable is wound onto metal or wooden reels prior to transporting to the final testing facility.\n\nThe trip was beneficial for all the students as it exposed the students to the manufacturing process of high voltage cables and the working lives of engineers there. The visit ended with Dr. Noor Azlinda presenting gifts to the company representative as a token of appreciation. Dr. Noor Azlinda would also like to take this opportunity to thank the company for entertaining the visit and the light refreshments served during the visit.\n\n\\# Dr. Noor Azlinda Ahmad, Institute of High Voltage and High Current, Universiti Teknologi Malaysia.\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/industrial-visit-to-universal-cable#)"
}