{
  "markdown": "Technical Talk on Protection Devices Successfully Held\n======================================================\n\nby [website](https://fke.utm.my/author/website/ \"Posts by website\")\n | Sep 11, 2019 | [POWER](https://fke.utm.my/category/power/)\n\n![](https://fke.utm.my/wp-content/uploads/2020/02/power1.jpg)\n\n<img class=”alignnone wp-image-11315″ src=”http://ee.utm.my/wp-content/uploads/2019/09/Tachnical-Talk-Sep19.jpg” alt=”” width=”569″ height=”355″ />\n\nMr. Quek delivering his talk\n\n&nbsp;\n\nThe Institute of High Voltage and High Current (IVAT), Universiti Teknologi Malaysia (UTM), successfully organised a technical talk on “Protection Devices: Miniature Circuit Breakers and Residual Current Circuit Breakers” on 21 August 2019 at IVAT, UTM Johor Bahru.\n\nDuring the talk, Mr. Geoffrey Quek, from Hager Engineering (M) Sdn. Bhd., shared his experience on the importance of protection devices and different categories of protection devices. In addition, the principles behind the operation of miniature circuit breakers and residual current circuit breakers were explained to the audience. Appropriate selections of protection devices, especially for residential buildings, were also highlighted. The talk later ended with a question-and-answer session between Mr. Quek and the audience, which allowed the audience to obtain further clarification regarding the topic.\n\nIVAT sincerely thanks Mr. Quek for his kindness to share his expertise in the field of protection devices and hopes to have more events like this in the future.\n\n&nbsp;\n\n<img class=”alignnone wp-image-11316″ src=”http://ee.utm.my/wp-content/uploads/2019/09/Tachnical-Talk2-Sep19.jpg” alt=”” width=”696″ height=”336″ />\n\nGroup photo\n\n&nbsp;\n\nBy Ir. Dr. Lau Kwan Yiew, Universiti Teknologi Malaysia\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/technical-talk-on-protection-devices-successfully-held#)"
}