{
  "markdown": "Scholarships\n============\n\nAt UTM, We Appreciate Outstanding Achievements By Our Students with Scholarship. Universiti Teknologi Malaysia (UTM) relies on a variety of financial aid sources to cover the entire Cost of Attendance and increase the school’s affordability. The major sources of financial aid are listed below.\n\n[Send us a Message](mailto:admission@utm.my)\n\n### UTM Serambi Al-Quds 2022 Program (PhD Scholarship for Palestinian only)\n\n**UTM Serambi Al-Quds Program** is an initiative by the Universiti Teknologi Malaysia (UTM) Board to sponsor 10 highly talented **Palestinian** **students** to pursue their doctoral degree at UTM.   \n\n**UTM Serambi Al-Quds Requirements**\n\n*   Fullfil the UTM PhD Admission Requirements: A Masters’s degree from UTM or Other institutions of higher learning recognised by the Senate  \n*   Fulfil the English Language Requirements : [https://admission.utm.my/english-language-requirements-3/](https://admission.utm.my/english-language-requirements-3/)\n    \n\n![](https://admission.utm.my/wp-content/uploads/sites/461/2023/07/Al-Quds.png \"Al-Quds\")\n\n[MORE INFORMATION](https://admission.utm.my/wp-content/uploads/sites/461/2022/12/UTM-SERAMBI-AL-QUDS-2022-SCHOLARSHIP-PROGRAMME.pdf)\n\n[Apply Now](http://smart.utm.my/)\n\n### UTM Young Scholars Grant\n\n**Award Description**\n\nThis grant support doctoral and research masters candidates to present their research findings in well-established and high impact international/national conferences by funding the conference fees.\n\n**UTM Young Scholars Grant Requirements**\n\n*   Open to students (both local & international) registered in PhD and Master by Research programs in UTM. However, for international students only those enrolled in doctoral programme are eligible.\n*   Priority is given to an applicant in semester 1-6 for PhD and semester 1-3 for Master by Research candidate.\n*   Application should be filed in advance at least two (2) months priorthe date of the conference. These documents are required for the application:\n\na) Details of the conference with your name as presenter (e.g: proceeding, concurrent schedule);\n\nb) Offer/Invitation letter from organizer;\n\nc) Abstract of paper presentation;\n\nd) Quotation of the registration fees;\n\n*   Only approved applications, will qualify to claim for the grant.\n*   Applicant must be invited as an oral presenter and present at the conference. Applicant must be the first student author of the paper, which must cover original, ongoing research and directly related to the applicant thesis topic.\n*   Applicant must not receiveany full scholarship (tuition fees and monthly allowance) during the application submission.\n*   Applicant can only be awarded with this financial assistance ONCE throughout the study.\n*   Please take note that an applicant’s funding will be cancelled upon submission of thesis for viva voce.\n*   Only attendance to conference organized by registered association/university/research institute/academic organization/government agency (preferably indexed conference) will be considered for financial support. Supervisors are responsible to check and ensure that the conference is not organized by commercial organizer.\n*   The rates for this funding are as below:       a) PhD – maximum amount of RM700 b) Master by Research – maximum amount of RM500.\n\n[Download Form](https://sps.utm.my/wp-content/uploads/2020/05/UTM-Young-Scholars-Grant-Application-Form-Final.pdf)\n\n### UTM Zamalah Scholarship\n\n**Award Description**\n\nUTM Zamalah is offered to outstanding Malaysian students who are registered in any Doctoral programme at Universiti Teknologi Malaysia. The scholarship is awarded on yearly basis where each student will be assessed based on his/her academic performance before an extension to the subsequent year is granted.\n\nUTM Zamalah covers tuition fees  and monthly allowance ranging from RM1,500.\n\n**UTM Zamalah Scholarships Requirements**\n\n*   Open to student in 1st until 3rd Semester\n*   Applicants must be of Malaysian nationality\n*   Open to full-time PhD student\n*   Not under any employment or receiving any form of financial aid from other sources.\n*   35 years old and below\n\n[Learn More](https://my.utm.my/)\n\n### International Doctoral Fellowship\n\n**Award Description**\n\nThis Fund provides partial tuition waivers of RM2,000 in the sponsored semester for International Doctoral student.\n\n**UTM International Doctoral Fellowship Requirements**\n\n*   Application is open to International full time PhD student at Universiti Teknologi Malaysia who are currently in 1st Semester until 6th Semester only.\n*   Applicant in 5th and 6th Semester, priority given for those who submit notification of thesis submission.\n*   Applicant is currently not working or receiving any form of financial aids from other sources.\n*   Applicant is required to be in Malaysia within 2 months during the application period.\n*   Publications without the name of Main Supervisor and UTM affiliation will not be considered.\n*   Applicant who has received the IDF in the previous semesters, must submit papers published within one (1) previous year and current only.\n*   Papers will be evaluated based on the contribution of the writers.\n*   Publication MUST be verified by Main Supervisor on the first page of the article.\n*   The decision in relation to the IDF award is FINAL and no appeal will be entertained.\n*   University has the right to reject the application in the event of False information provided.\n\n[Learn More](https://my.utm.my/)\n\n### UTM National Postgraduate Fund\n\n**Award Description**\n\nThis Fund provides tuition waivers in the sponsored semester for Malaysian Doctoral or Master by Research, Mixed-mode, and Taught Course students (excluding Pesisir & Special Programme).\n\n**UTM National Postgraduate Fund Requirements**\n\n*   Currently in ‘Active’ status.\n*   The fund amount RM1,000.00 exemption fee.\n*   Applications are open to PhD students in semesters 1 to 6 and to Master’s students in semesters 1 to 4.\n*   Applicant is not currently receiving any form of financial aid from other sources.\n*   Students with good publications record will be given priority.\n*   Obtained a grade of MM – Satisfactory in the Progress Report for Research or minimum 3.50 for Mixed Mode & Course Work student.\n*   35 years old and below for Master Level and 45 years old and below for PhD Level.\n*   Priority will be given to applicant with minimum RM5,000.00 and below household income.\n\n[Learn More](https://my.utm.my/)\n\n### UTM Endowmen Scholarships\n\n*   Universiti Teknologi Malaysia (UTM) invites eligible Malaysian citizen to apply for UTM Endowmen Scholarship to pursue full time study at Universiti Teknologi Malaysia (UTM) scholarships and whoever success will receive the scholarships until they graduated depending on their performance.\n*   The receiver of the scholarships awards would not be bond by UTM  and they are free to work with other organizations after their graduation\n*   Endowmen Scholarship is offered to an outstanding and Bottom 40(B40) students with scholarship value from RM9,000 up to RM12,000 per year.\n\n[Learn More](http://biasiswaendowmen.utm.my/Endowmen/homeDefault.aspx)\n\n### UTM Zakat Aid\n\n*   Zakat for Tuition Fee (Eligible to students who do not receive any sponsorship or loan & the maximum amount given is RM1000/sem.)\n*   Zakat for Living Expenses (RM300 – RM600)\n*   Zakat for Temporary Financial Assistance (Sponsorship money or late loan enters & total given maximum RM150/month.)\n*   Zakat for final year project (RM100).\n*   Zakat for undergoing industry training (RM100 – RM300).\n*   Zakat for bus fare (One-off assistance /semester & the maximum amount given is RM50 ‐ RM150 or subject to the consideration of Pusat Islam UTM.)\n*   Zakat for Special Cases such as thefts, accidents, health issues, Disability (OKU) and/or other cases deemed necessary (RM50 – RM200 or subject to the consideration of Pusat Islam UTM.)\n\n[Learn More](https://my.utm.my/)\n\n### Publication Incentive Claim\n\n**Claim Purpose**\n\nStudents may apply the Publication Incentive Claim as a endorsements from the university for the research publications that they have produced.\n\n**Claim Payments**\n\nBelow are the maximum value in claims that a student can apply for the Publication Incentive:\n\n*   **Q1 : RM250.00**\n*   **Q2: RM250.00**\n\nBelow are the criteria required in making Publication Incentive Claims:\n\n*   The applicant must be the First Student Author and UTM Graduate student;\n*   Published paper must have volume no. and page no.;\n*   Affiliation must be Universiti Teknologi Malaysia;\n*   Applicant must be the First Student Author and supervisor(s) must be one of the authors;\n*   All claims made in the current year are only valid for paper published in the CURRENT YEAR and in ONE PREVIOUS YEAR.\n\n[Download Form](https://sps.utm.my/wp-content/uploads/2020/05/PUBLICATION-INCENTIVE-CLAIM-FORM-01.06.2020.pdf)\n\nFinancial Aid\n-------------\n\n**MY BRAIN 2.0**\n================\n\nThe MyBrain 2.0 program is specifically for studies at the Bachelor’s and Doctor of Philosophy (PhD) levels at public universities and selected private higher education institutions (IPTS) in the country, with priority given to students in the following fields:\n\n*   Science\n*   Technology\n*   Engineering\n*   Mathematics\n\n**ELIGIBILITY**\n\nThe MyBrain 2.0 is opened to:\n\n*   Malaysian who is not working\n*   Malaysian with no fixed income\n*   Private higher Education Institution (IPTS) Lecturers\n\nShorlisted candidates will be called for an interview.\n\n[![](https://admission.utm.my/wp-content/uploads/sites/461/2024/08/WhatsApp-Image-2024-08-05-at-09.00.05.jpeg \"WhatsApp Image 2024-08-05 at 09.00.05\")](https://biasiswa.mohe.gov.my/MyBrain2/)\n\n**Any inquiries for Financial Aids and Scholarship, please kindly contact :**\n-----------------------------------------------------------------------------\n\n**Postgraduate**\n----------------\n\nSchool of Graduate Studies (SPS)\n\n(U/P : Postgraduate Scholarship Unit)\n\nTel : 07-553 7876   \n\nEmail : [sps.scholarship@utm.my](mailto:sps.scholarship@utm.my)\n\nWebsite : [https://sps.utm.my/](https://sps.utm.my/)\n\n**Undergraduate**\n-----------------\n\nUnit Bantuan Kewangan, Pejabat Hal Ehwal Mahasiswa dan Alumni\n\nTel : 07-55 30513 / 07-55 30185\n\nEmail : [biasiswaendowmen@utm.my](mailto:biasiswaendowmen@utm.my)\n / [juliah@utm.my](mailto:juliah@utm.my)\n / [norsita@utm.my](mailto:norsita@utm.my)\n\nWebsite : [https://studentaffairs.utm.my/](https://studentaffairs.utm.my/)"
}