{
  "markdown": "Photonics Lecture Series in Conjunction with International Day of Light\n=======================================================================\n\nby [lcrgpic](https://fke.utm.my/author/lcrgpic/ \"Posts by lcrgpic\")\n | Jul 16, 2023 | [COMM](https://fke.utm.my/category/comm/)\n, [LCRG](https://fke.utm.my/category/lcrg/)\n\n![](https://fke.utm.my/wp-content/uploads/2023/07/LCRG-PLS_3-230516-980x750.png)\n\nOn May 16, 2023, MyIPS together with LCRG organized a Photonics Lecture Series in a hybrid (online and physical) mode in conjunction with the International Day of Light. In this lecture series, we had the opportunity to hear from two experts in the field of photonics, namely Prof Yeon Ho Chung and Dr Mohd Rashidi Bin Salim.\n\n![](https://fke.utm.my/wp-content/uploads/2023/07/LCRG-PLS_2-230516-1024x657.png)\n\nProf Yeon Ho Chung is a professor at the Department of Information and Communication Engineering, Pukyong National University, Busan, South Korea. He has extensive experience in research and development of wireless optical communication (OWC) systems that use ultraviolet (UV) light and orbital angular momentum (OAM). In his lecture, he explained in depth the basic principles, challenges and potential applications of UV and OAM OWC. He also showed some interesting and amazing experimental results that demonstrate the advantages of this technique over conventional techniques.\n\n![](https://fke.utm.my/wp-content/uploads/2023/07/LCRG-PLS_1-230516-980x582.png)\n\nDr Mohd Rashidi Bin Salim is a lecturer at Universiti Teknologi Malaysia (UTM). He has an interest in absorption spectroscopy that can be used for gas sensing. In his lecture, he shared his knowledge on the theory and basic formulas behind the absorption characterization technique. He also gave examples of practical applications of this technique in the fields of medicine, industry and environment. He also gave some tips and guidance on how to conduct absorption spectroscopy experiments more easily and accurately.\n\nWe would like to thank both speakers for their very useful and interesting knowledge sharing. We would also like to thank all participants who joined this Photonics Lecture Series online or physically. We hope that this lecture series can benefit all parties who are interested in the field of photonics.\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/photonics-lecture-series-in-conjunction-with-international-day-of-light#)"
}