{
  "markdown": "About Faculty\n=============\n\n![](https://mech.utm.my/wp-content/uploads/2022/10/12.jpg \"12\")\n\n![](https://mech.utm.my/wp-content/uploads/2019/08/IMG-20150125-WA0008.jpg \"UTM_lst\")\n\n![](https://mech.utm.my/wp-content/uploads/2020/01/ssskm.jpg \"ssskm\")\n\n![](https://mech.utm.my/wp-content/uploads/2019/08/UAV-lab.jpg \"UAV lab\")\n\n![](https://mech.utm.my/wp-content/uploads/2019/04/termo.jpg \"termo\")\n\n### ABOUT Faculty\n\nFACULTY OF MECHANICAL ENGINEERING\n---------------------------------\n\nThe Faculty of Mechanical Engineering (FME),Universiti Teknologi Malaysia, was formerly known as the Fakulti Kejuruteraan Jentera (FKJ). It was set up in 1975 at Universiti Teknologi Malaysia Kuala Lumpur campus. FKJ initially had two departments, namely, the Department of Mechanical Engineering and the Department of Petroleum Engineering. A Dean managed the Faculty with the assistance of a Deputy Dean and two Heads of Departments. On 15th of March 1983, the Department of Petroleum Engineering has been expanded to form a new faculty known as the Faculty of Chemical and Natural Resources Engineering. FKJ moved to a new campus in Skudai in June 1989. To make the Faculty more marketable internationally, the University has agreed to rename FKJ to Fakulti Kejuruteraan Mekanikal (FKM) or Faculty of Mechanical Engineering (FME) on 20th of December 1995. In July 2018, under the UTM Synergy 4.0, FKM was placed under new management named Faculty of Engineering (FE) together with the other five Faculties. FKM was renamed to the School of Mechanical Engineering (SME).\n\nFME now offers a four-year academic programme in various fields of Mechanical Engineering, which upon completion, the University awards the Degree of Bachelor of Mechanical Engineering with Honours. The complete list of undergraduate programmes offered by the faculty is as follows:\n\n*   Bachelor of Mechanical Engineering with Honours\n*   Bachelor of Mechanical Engineering (Manufacturing) with Honours\n*   Bachelor of Mechanical Engineering Naval Architecture and Offshore Engineering with Honours\n\nApart from the undergraduate programme, the faculty also offers postgraduate programmes which include a Master of Engineering by research and Doctor of Philosophy in Mechanical Engineering. Several Master programmes by course work in Mechanical Engineering, Marine Technology, Mechanical-Advanced Manufacturing Technology, Industrial Engineering, Mechanical-Materials Engineering, Aeronautical Engineering, and Automotive Engineering are also offered.\n\nThe faculty’s state-of-the-art facilities and instrumentation provide the support tools for comprehensive educational and research activities. These are supplemented by specialized university research facilities, which include Automotive Development Centre (ADC), Marine Laboratory, Composite Centre, Institute of Noise and Vibration, and Aeronautics Laboratory. In addition to these, FME also houses several research laboratories, including Systems and Control Laboratory, Material Science Laboratory, Applied Mechanics and Materials Testing Laboratory, Production EngineeringLaboratory, Industrial Engineering Laboratory, and CAD/CAE Laboratory. In line with the Research University status, several research alliances (RA) have emerged. The staff of FME is also associated with at least one of the research groups in the RAs. FME has received numerous national awards for both research and teaching. Our graduates have been very successful and have risen to distinguished positions in industries, government sectors, and academia."
}