{
  "markdown": "Politeknik Ibrahim Sultan’s Students Thrilled by the Knowledge Sharing Session on Optical Communication Field\n=============================================================================================================\n\nby [commpic](https://fke.utm.my/author/commpic/ \"Posts by commpic\")\n | Apr 20, 2017 | [COMM](https://fke.utm.my/category/comm/)\n\n27th March 2017 – Forty students of Politeknik Ibrahim Sultan, Johor Bahru participated in a knowledge sharing session with lecturers, specializing in relevant field, from the Department of Communication Engineering (COMM), Faculty of Electrical Engineering UTM Johor Bahru. The knowledge sharing session that was organized by the Lightwave Communication Research Group (LCRG) focused on imparting the participants with some knowledge on the optical communications, particularly regarding the use of the Optical Time Domain Reflectometer (OTDR). The session was held at a laboratory in Politeknik Ibrahim Sultan for about two hours beginning at 2 in the evening. Among lecturers from the COMM Department who had participated in the program as facilitators were Dr. Asrul Azam Azmi, Dr. Muhammad Yusof Mohd Noor, Dr. Muhammad Al Farabi Muhammad Iqbal, Dr. Nadiatulhuda Zulkifli and Dr. Nor Hafizah Ngajikin. The sharing session exposed the participants to the current knowledge within the area of optical communications. They had also been given the opportunity to acquire some experience in handling the OTDR. OTDR is an important instrument used among others, for the optical fiber cable integrity testing. As a whole, participants were very excited with the experience they have had and they appreciated the prospects derived from the session very well. They had acknowledged that handling the OTDR practically had strengthened their understanding of what they had learned in class theoretically.\n\n![](https://fke.utm.my/wp-content/uploads/sites/9/2017/04/art31-1.png)\n\n* * *\n\n**Dr. Muhammad Yusof Mohd Noor talks on the current technology in the optical communication field.**\n\n* * *\n\n![](https://fke.utm.my/wp-content/uploads/sites/9/2017/04/art31-2.png)\n\n![](https://fke.utm.my/wp-content/uploads/sites/9/2017/04/art31-3.png)\n\n* * *\n\n**Dr. Muhammad Yusof Mohd Noor (Left) and Dr. Asrul Izam Azmi (Right) provide hands-on demonstration on optical fiber cable splicing technique.**\n\n* * *\n\n![](https://fke.utm.my/wp-content/uploads/sites/9/2017/04/art31-4.png)\n\n* * *\n\n**The photograph session of all participants from Politeknik Ibrahim Sultan with representatives from UTM.**\n\n* * *\n\n[HOME](https://fke.utm.my/comm/)\n\n* * *\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/politeknik-ibrahim-sultans-students-thrilled-by-the-knowledge-sharing-session-on-optical-communication-field#)"
}