{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/perkongsian-berkenaan-transformasi-gis-untuk-utiliti-air-dalam-ranhill-saj-kepada-pelajar-fabu#)\n    \n*   [Instagram](https://builtsurvey.utm.my/perkongsian-berkenaan-transformasi-gis-untuk-utiliti-air-dalam-ranhill-saj-kepada-pelajar-fabu#)\n    \n*   [RSS](https://builtsurvey.utm.my/perkongsian-berkenaan-transformasi-gis-untuk-utiliti-air-dalam-ranhill-saj-kepada-pelajar-fabu#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/perkongsian-berkenaan-transformasi-gis-untuk-utiliti-air-dalam-ranhill-saj-kepada-pelajar-fabu#)\n    \n*   [Instagram](https://builtsurvey.utm.my/perkongsian-berkenaan-transformasi-gis-untuk-utiliti-air-dalam-ranhill-saj-kepada-pelajar-fabu#)\n    \n*   [RSS](https://builtsurvey.utm.my/perkongsian-berkenaan-transformasi-gis-untuk-utiliti-air-dalam-ranhill-saj-kepada-pelajar-fabu#)\n    \n\nPerkongsian berkenaan Transformasi GIS untuk Utiliti Air dalam Ranhill SAJ kepada pelajar FABU\n==============================================================================================\n\nby [norainismail](https://builtsurvey.utm.my/author/norainismail/ \"Posts by norainismail\")\n | Apr 20, 2022 | [News](https://builtsurvey.utm.my/category/news/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2022/04/unnamed-6-1-722x675.jpg)\n\n[Fakulti Alam Bina & Ukur](https://news.utm.my/ms/category/fakulti-sekolah/fakulti-alam-bina-ukur/)\n, [Kolaborasi dan Jaringan Industri/Institusi](https://news.utm.my/ms/category/kolaborasi-dan-jaringan-industri-institusi/)\n, [Sorotan Upacara UTM](https://news.utm.my/ms/category/sorotan-upacara-utm/)\n / By [HANIS AMIRAH ROSLIN](https://news.utm.my/ms/author/hanisamirah/ \"View all posts by HANIS AMIRAH ROSLIN\")\n / April 20, 2022 / 2 minutes of reading\n\nOleh: Dr Zakri Tarmidi, Dr Nurul Hawani Idris\n\nRanhill SAJ Sdn Bhd (Ranhill SAJ) dengan kerjasama Fakulti Alam Bina dan Ukur (FABU), Universiti Teknologi Malaysia (UTM) telah menjayakan program forum “Transformasi Pengurusan Utiliti Air Menerusi Sistem Maklumat Geografi (GIS) kepada Teknologi Era Baharu di Ranhill SAJ” yang berlangsung secara dalam talian pada 28 Februari 2022.\n\nProgram ini bertujuan untuk melihat proses transformasi yang telah berlaku di Ranhill SAJ dalam menguruskan maklumat berkaitan utiliti air dengan menggunakan sains dan teknologi GIS. Forum ini dipengerusikan oleh Sr Gs Dr Nurul Hawani Idris daripada FABU, bersama dengan panel jemputan daripada Ranhill SAJ, iaitu Tuan Haji Ir Md Fuad Bakri, selaku Ketua Pengurusan Aset, Ranhill SAJ.\n\nProgram ini telah dihadiri lebih 100 orang peserta, terutama daripada pelajar daripada Program Sarjana Muda Sains (Geoinformatik) yang sedang menjalani kursus Khemah Latihan GIS, FABU, selain peserta daripada agensi kerajaan dan swasta yang lain. Program ini juga dipancarkan secara langsung di Facebook Ranhill SAJ, yang mana peserta boleh berinteraksi secara langsung di laman Facebook itu.\n\nTuan Haji Ir Md Fuad telah berkongsi kepada peserta bagaimana pihak Ranhill SAJ telah menggunapakai teknologi GIS dalam membantu pengumpulan data, merekabentuk pangkalan data GIS yang bersesuaian, memaparkan maklumat GIS berkaitan utiliti air, dan membuat analisis menggunakan aplikasi GIS mereka.\n\nBeliau juga berkongsi maklumat utiliti air sangat mudah dicapai dengan adanya GIS, antaranya adalah terdapat 23,739 kilometer paip, 1.24 juta NOS yang sedang diuruskan oleh Ranhill SAJ pada tahun 2022 ini. Tanpa GIS, maklumat ini memerlukan masa untuk dicari dan dicapai.\n\nMenggunakan GIS juga, pihak Ranhill SAJ mampu melihat jumpa meter paip yang sedang aktif di dalam Negeri Johor, dan paparan kawasan taburan paip air, meter air dan lain-lain maklumat utiliti berkaitan.\n\nPihak Ranhill SAJ juga berkongsi berkenaan maklumat sedikit analisis GIS yang dilaksanakan, sebagai contoh, sekiranya terdapat paip air pecah, dan pihak Ranhill SAJ dapat terus mencari valve yang berkaitan, dan sekiranya terpaksa menutup valve, manakah rumah yang akan terkesan dan tidak akan ada air buat sementara waktu.\n\nSelain itu, pihak Ranhill SAJ juga berbesar hati memberi tajaan untuk hadiah bagi kuiz yang dilakukan dalam program ini. Diharapkan perkongsian daripada pihak Ranhill SAJ ini dapat memberikan manfaat dan kebaikan kepada peserta yang hadir, terutamanya kepada pelajar Program Sarjana Muda Sains (Geoinformatik).\n\n[![](https://builtsurvey.utm.my/wp-content/uploads/2022/04/unnamed-7-300x169.jpg)](https://builtsurvey.utm.my/wp-content/uploads/2022/04/unnamed-7.jpg)\n\n_berkaitan yang dikongsikan oleh pihak Ranhill SAJ_\n\n[![](<Base64-Image-Removed>)](https://builtsurvey.utm.my/wp-content/uploads/2022/04/unnamed-8.jpg)\n\n_forum ini sedang berlangsung_\n\n[![](<Base64-Image-Removed>)](https://builtsurvey.utm.my/wp-content/uploads/2022/04/unnamed-9-1.jpg)\n\n_Tuan Haji Ir Md Fuad memberikan penerangan_"
}