{
  "markdown": "Academic Office : +607-5333716 | Email : academic-fcee@utm.my | Administration Office : +607-5533499 [fcee@utm.my](mailto:fcee@utm.my)\n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n[![](https://fkt.utm.my/wp-content/uploads/2023/03/METE-724x1024.jpg \"METE\")](https://fkt.utm.my/wp-content/uploads/2023/03/METE.jpg)\n\n###### _Updated : 09 December 2024_\n\n**MASTER OF SCIENCE (M.Sc) IN ENERGY MANAGEMENT**\n\n**The Award-Winning Program has just got even better with carefully refined NEW SYLABBUS.**\n\nThis award-winning MSc programme has been designed by leading energy management and technology experts, certified energy managers and practitioners in collaboration with key energy stakeholders to empower organisations to practice and sustain an effective energy management program to achieve a global competitive edge.\n\n**Highlight**\n\nThe qualified graduates of this programme will also get a professional certification as a REGISTERED ELECTRICAL ENERGY MANAGER (REEM) from the Energy Commission of Malaysia. Current REEMs can also gain CPD hours by attending the modules.\n\n**Achievement:**\n\n*   Winner of Ministry of Higher Education Innovative Curriculum Award 2018\n*   Ranked Top 18th Best Master Program in Energy and Natural Resource in Regional by Eduniversal 2021\n\n**Four key features set UTM MSc Energy Management apart from other programmes:**\n\n|     |     |\n| --- | --- |\n| 1.  | Holistic and balanced in its emphasis on elements of policy and market instruments, socio­economy as well as technology and tools, for the utilization of renewable energy (RE) as well as energy efficiency (EE) towards enabling governments and organisations to achieve energy security, efficiency and environmental sustainability. |\n| 2.  | Multidisciplinary and practical in its consideration of aspects of excellence in organizational management and business practice; cross­cutting technical, professional and non­technical disciplines. |\n| 3.  | Comprehensive in its coverage on electrical and thermal energy management across sectors including industrial, transport, commercial/domestic and power/energy generation. |\n| 4.  | Contemporary in its emphasis on the application and development of novel tools, algorithms and innovative in­house and state­of­the­art technologies such as process integration for thermal energy and power optimisation via pinch analysis; smart decentralized hybrid energy generation (DEG), renewable energy as well as biorefinery systems modeling, planning and optimization; smart energy data acquisition, monitoring and verification; life cycle analysis. |\n\n*   [Program Structure](https://fkt.utm.my/msc-energy-management-2#)\n    \n*   [Programme Specifications](https://fkt.utm.my/msc-energy-management-2#)\n    \n*   [Programme Educational Objectives (PEO)](https://fkt.utm.my/msc-energy-management-2#)\n    \n*   [Programme Learning Outcomes (PLO)](https://fkt.utm.my/msc-energy-management-2#)\n    \n*   [Career opportunities](https://fkt.utm.my/msc-energy-management-2#)\n    \n*   [General Entry Requirement](https://fkt.utm.my/msc-energy-management-2#)\n    \n*   [Entry requirement](https://fkt.utm.my/msc-energy-management-2#)\n    \n*   [How to apply](https://fkt.utm.my/msc-energy-management-2#)\n    \n\n**![](https://fkt.utm.my/wp-content/uploads/2024/08/Program-Structure-and-Fees-for-METE-Program.jpg)**\n\n**Starting from the 2024/2025 Semester 2 intake (March 2025), students in the ODL program may no longer be eligible for REEM (or REM) certification, as it requires live teaching to meet the qualification criteria.**\n\n**Example Study Plan for October Intake (Full time class)**\n\n**![](https://fkt.utm.my/wp-content/uploads/2021/05/Example-Study-Plan-for-October-Intake-Full-time-class-M.Sc-in-Energy-Management.jpg)**\n\n**Example Study Plan for October Intake (Weekend class)**\n\n![](https://fkt.utm.my/wp-content/uploads/2021/05/Example-Study-Plan-for-October-Intake-Weekend-class-M.Sc-in-Energy-Management.jpg)\n\nThe UTM Master of Science (Energy Management) programme is offered on a full-time basis at the UTM main campus in Johor Bahru and also on a part-time basis (weekend classes) in Kuala Lumpur. The duration of study is one to three years for full-time and two to four years for parttime. This programme is open for any graduates with a degree in science, technology and engineering. Graduates from other disciplines but with relevant experiences are also encouraged to apply.\n\n**Programme Educational Objectives (PEO)**\n\n|     |     |\n| --- | --- |\n| PEO 1 | Mastery of knowledge and competency in advanced areas of Energy Management. |\n| PEO 2 | Practice professionalism and high standards of ethical conducts within organization and society. |\n| PEO 3 | Responsive to changing situations by continuously acquiring new knowledge and skills. |\n\n**Programme Learning Outcomes (PLO)**\n\n|     |     |\n| --- | --- |\n| PLO 1 | Attain new frontiers of knowledge in the field of Energy Management. |\n| PLO 2 | Solve complex problems critically and integratively using systematic approaches. |\n| PLO 3 | Apply practical skills to solve problems in the field of Energy Management. |\n| PLO 4 | Demonstrate effective collaboration with stakeholders professionally. |\n| PLO 5 | Communicate effectively the knowledge, skills and ideas using appropriate methods to peers, experts and communities. |\n| PLO 6 | Use digital technologies and appropriate softwares competently to enhance study and practice. |\n| PLO 7 | Evaluate numerical and graphical data critically using quantitative or qualitative tools in solving problems. |\n| PLO 8 | Demonstrate leadership, autonomy and responsibility in managing resources. |\n| PLO 9 | Engage self-advancement through continuous learning or professional development. |\n| PLO 10 | Demonstrate entrepreneurial skills with relevant knowledge and expertise. |\n| PLO 11 | Demonstrate respectable ethical conducts and professionalism skills in an organization and society. |\n\nOur graduates are being employed for these positions.\n\n*   Energy manager\n*   Energy auditor\n*   Energy measurement and verification engineer\n*   Maintenance engineer\n*   Project engineer\n*   Process engineer\n\nThese are some of the testimonials:\n\n![](https://fkt.utm.my/wp-content/uploads/2021/05/Career-opportunities-1-M.Sc-in-Energy-Management.png)\n\n![](https://fkt.utm.my/wp-content/uploads/2021/05/Career-opportunities-2-M.Sc-in-Energy-Management.png)\n\n*   A Bachelor’s Degree with good honours from Universiti Teknologi Malaysia or any other institution of higher learning recognised by the Senate; or\n*   A qualification equivalent to a Bachelor’s Degree and experience in the relevant field recognised by the Senate.\n\n![](https://fkt.utm.my/wp-content/uploads/2021/05/ger1.png)\n\n![](https://fkt.utm.my/wp-content/uploads/2021/05/ger2.png)\n\n*   Bachelor of Science with a minimum CGPA of 2.50 or equivalent, or\n*   Bachelor of Engineering with a minimum CGPA of 2.50 or equivalent, or\n*   Bachelor of Technology with a minimum CGPA of 2.50 or equivalent, or\n*   Other Bachelor’s Degree with at least CGPA 2.50 or equivalent and approved and recognized by the UTM Senate along with 3 years experience in the process and energy efficiency industry.\n*   Candidate without any Degree but with relevant and equivalent industry experience can apply this program under Accreditation of Prior Experiential Learning (APEL) T7.\n\nAPEL T7: [https://apel.utm.my/kemasukan-master/penilaian-apel-sarjana-t7/](https://apel.utm.my/kemasukan-master/penilaian-apel-sarjana-t7/)\n\n**English Requirement for International Students:**\n\n*   minimum English Test of English as a Foreign Language (TOEFL) score 550 or International English Language Test System (IELTS) band 6.0.\n*   Exceptions can be given to foreign candidates who are from a country whose native language is English or have a degree from that country.\n*   Candidates who do not have one of these qualifications are required to take the University English Test before registering for the program of study.\n*   If they fail, candidates are required to follow the Intensive English Program and pass before being allowed to continue their respective programs of study.\n\nFollow these 4 simple steps\n\n1.  Read above information to decide whether you prefer a full time or part time program\n2.  Register for interest and indicate your preferred mode of study via: [https://forms.gle/96fv6o4TBfj7FZ2r6](https://forms.gle/96fv6o4TBfj7FZ2r6)\n    \n3.  Contact Ir Dr Lim using Whatsapp at +6012 7800 221 for more program information to ensure you have selected the right program code.\n4.  Apply for the program at: [https://qrgo.page.link/NnvdG](https://qrgo.page.link/NnvdG)\n    \n\nFor other useful information, please visit: [https://sps.utm.my/](https://sps.utm.my/)"
}