{
  "markdown": "Industrial Visit to VS Industry Berhad\n======================================\n\nby [powerpic](https://fke.utm.my/author/powerpic/ \"Posts by powerpic\")\n | Nov 21, 2016 | [POWER](https://fke.utm.my/category/power/)\n\n![](https://fke.utm.my/wp-content/uploads/2016/12/VS-Industry-A-980x392.jpg)\n\nOn 15 November 2016, the Faculty of Electrical Engineering (FKE), Universiti Teknologi Malaysia (UTM), organised an industrial visit for students undertaking the subject “Introduction to Electrical Engineering”. The visit was conducted at VS Industry Berhad, Senai, Johor. The main objectives of the visit to VS Industry Berhad were to allow the students to gain exposure on electrical/electronic industries and be aware of the responsibilities as electrical/electronic engineers. The visit was necessary for the students to fulfill part of the requirements for completing the subject “Introduction to Electrical Engineering”, where at the end of the 12-week course, the students were expected to be able to (i) analyse and describe the responsibilities of engineers to the society; (ii) explain the importance of sustainable solutions; (iii) be accountable on assigned tasks in an ethical manner; and (iv) manage a project. The visit to VS Industry Berhad was fruitful for the students where the students had the chance to visit injection moulding processes involving the use of various electrical and electronic equipment such as electronic software tools, robotic arms, precision control tools, and maintenance kits. UTM FKE wishes to thank VS Industry Berhad, especially Mr. Lee Chun Ong and his colleagues, for entertaining the visit.\n\n\\# Dr. Lau Kwan Yiew, Institute of High Voltage and High Current, Universiti Teknologi Malaysia.\n\n![vs-industry-a](https://fke.utm.my/wp-content/uploads/2016/12/VS-Industry-a.png)\n\n_Group photo of UTM FKE’s students with Mr. Lee (wearing a tag) at the main entrance of VS Industry Berhad._\n\nAbout VS Industry\n\nVS Industry Berhad was founded in 1982 and listed on the Main Market of Bursa Malaysia Securities Berhad in 1998. VS is a leading integrated Electronics Manufacturing Services (EMS) provider in the region, with proven capabilities to undertake the manufacturing needs of global brand names for office and household electrical and electronic products. VS Industry is now ranked alongside the world’s top 50 global EMS providers for 9 consecutive years from 2007 to 2015. More details about VS Industry can be found [here](http://www.vs-i.com/)\n.\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/industrial-visit-to-vs-industry-berhad#)"
}