{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/indonesia-malaysia-research-consortium-imrc-led-by-utm-um-to-enhance-research-innovations-for-societal-development-in-two-nations#)\n    \n*   [Instagram](https://builtsurvey.utm.my/indonesia-malaysia-research-consortium-imrc-led-by-utm-um-to-enhance-research-innovations-for-societal-development-in-two-nations#)\n    \n*   [RSS](https://builtsurvey.utm.my/indonesia-malaysia-research-consortium-imrc-led-by-utm-um-to-enhance-research-innovations-for-societal-development-in-two-nations#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/indonesia-malaysia-research-consortium-imrc-led-by-utm-um-to-enhance-research-innovations-for-societal-development-in-two-nations#)\n    \n*   [Instagram](https://builtsurvey.utm.my/indonesia-malaysia-research-consortium-imrc-led-by-utm-um-to-enhance-research-innovations-for-societal-development-in-two-nations#)\n    \n*   [RSS](https://builtsurvey.utm.my/indonesia-malaysia-research-consortium-imrc-led-by-utm-um-to-enhance-research-innovations-for-societal-development-in-two-nations#)\n    \n\nIndonesia – Malaysia Research Consortium (IMRC) Led by UTM – UM to Enhance Research Innovations for Societal Development in Two Nations\n=======================================================================================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Mar 31, 2022 | [News](https://builtsurvey.utm.my/category/news/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2022/04/unnamed-5.png)\n\nPrepared by: Director of Architecture Program, Universiti Teknologi Malaysia, Assoc. Prof. Dr. Alice Sabrina Ismail\n\nA virtual Memorandum of Agreement (MoA) exchange ceremony between Universiti Teknologi Malaysia (UTM) with Universitas Negeri Malang (UM), Indonesia, was held on 30th December 2021.\n\nThe exchange of MoA was held for these two universities to collaborate and have a joint funding in research and publication.\n\nThis MoA aims for excellence in research and constitutes to legally expand the research and publication outreach between UTM and UM networking.\n\nIt is pertinent in fulfilling the demands of both countries involving the industry and the community.\n\n![](https://ci6.googleusercontent.com/proxy/wtielTIqo8QJRvP7yf_UzLQYDwEiK2O_DtobWffr6Tmrt-GAgeRtz5w-JOoxdkvk4OcCkhpTSkrvBifYlAwyPwHeOtkPxNU=s0-d-e1-ft#https://news.utm.my/wp-content/uploads/2022/01/2.png)\n\nThe Deputy Vice-Chancellors from UTM and UM officiated this historic event\n\nThe Deputy Vice-Chancellor (Research & Innovation) from UTM, Prof. Dr. Rosli Md Illias, gave the welcoming speech while the welcoming remark from UM counterpart was presented by the Vice-Rector of Academic Affairs, Prof. Dr. Budi Eko Sucipto, M. Pd.\n\nThe ceremony was attended by the Vice Academic Dean of Faculty of Built Environment & Surveying (FBES), UTM, Assoc. Prof. Sr. Dr. Kherun Nita Ali, Head of Institute for Research and Community Engagement, UM, Prof. Dr. Markus Diantoro, M.Pd., Director of International Affairs, UM, Dr. Evi Eliyanah, MoA committee members and academic staff, Indonesia – Malaysia Research Consortium (IMRC) Management, Senior Officers, Faculty’s Deans, and Head of Departments.\n\nSpeaking on occasion, the Deputy Vice-Chancellors from both universities agreed to strengthen the collaboration, namely in research activities.\n\nThey want these two institutions to become leadership champions to contribute to the built environment development for both countries.\n\nThe collaboration agreement between UTM and UM began in October 2017 under the consortium known as IMRC. It is the Indonesia-Malaysia network of research-intensive universities and institutions.\n\nThis IMRC consortium aims to foster institutional innovation through research-inspired teaching and learning student mobility.\n\nIt also connects students and staff for broader advocacy for internationalization.\n\nIn 2018, under this IMRC consortium, five research clusters were established.\n\nThey are i) Renewable Energy, ii) Humanities and Culture, iii) Biomedicine and Health, iv) STEM kits, v) Disaster risk reduction and disaster risk management.\n\nThese five research cluster establishments intended to increase the research network intensively to benefit communities in Malaysia and Indonesia.\n\nIn 2020, two of the research clusters under the IMRC consortium, STEM kits and the Humanities Culture led by researchers from both institutions, had embarked on ten research works.\n\nIt had vast opportunities to be patented and commercialized for the development of both countries in the field of science and social science.\n\nUnder UTM, the STEM kits research cluster is led by the Faculty of Science (FS), whereas the Humanities Culture cluster is led by the Faculty of Built Environment and Surveying (FBES).\n\n![](<Base64-Image-Removed>)\n\nThe agreement to collaborate was discussed virtually on the 29th November 2020, between the Director of Architecture Program, Head of Social Science IMRC research cluster, Assoc. Prof. Dr Alice Sabrina Ismail, Head of STEM kits Research Cluster representing UTM, Prof. Dr. Ahmad Syed Iskandar Syed Ariffin and Prof. Dr. Hadi Nur, and the representatives of UM, Head Institute for Research and Community Engagement, Prof. Dr. Markus Diantoro, and Head of Indonesian Language and Literature Education Program, Faculty of Literature, Dr. Endah Tri Priyatni.\n\nThis collaboration is an essential milestone in the relations between UTM and UM.\n\nBoth institutions had conducted many international joint colloquium, knowledge and cultural sharing sessions in cooperative research projects as a collaborative effort.\n\nThese programmes had significantly attained many excellent responses and learning goals that benefit the academic fraternity in both institutions.\n\nIt had successfully reached out to the broader global community too.\n\nNumerous future collaborations between UTM and UM will be conducted soon. It is hoped that both institutions will achieve high excellence in research and academic endeavours.\n\nIn short, UTM would like to express gratitude to UM, IMRC and all the parties involved in ensuring the success of this virtual MoA exchange ceremony."
}