{
  "markdown": "The 3rd IEEE Conference on Energy Conversion Successfully Held\n==============================================================\n\nby [powerpic](https://fke.utm.my/author/powerpic/ \"Posts by powerpic\")\n | Nov 9, 2017 | [POWER](https://fke.utm.my/category/power/)\n\n![](https://fke.utm.my/wp-content/uploads/2017/11/CENCON201712-980x391.jpg)\n\nThe 3rd IEEE Conference on Energy Conversion (CENCON 2017) was recently  held in Kuala Lumpur, Malaysia on 30–31 October 2017. The objective of the conference is to share the latest research in the areas of power electronics, electrical drives, renewable energy, modelling and control systems. At the same time, it allows international delegates to discover the “Beautiful and Peaceful Malaysia”.\n\nCENCON 2017 is sponsored by the the IEEE Power Electronics (PEL) Malaysia Chapter. The organising committee comprised of members from the Faculty of Electrical Engineering, Universiti Teknologi Malaysia. Meanwhile, the International Advisory Committee comprised of experts in renewable energy, power electronics and drive systems. The conference programme featured technical paper presentations and technical exhibitions. Papers that were accepted and presented  at the conference will be submitted to the IEEE Xplore for considering to be included in the IEEE Xplore digital library ISBN 978-1-5090-2948-8 (subject to the approval of the IEEE Technical Programme Committee) and hence indexed in SCOPUS.\n\nVarious scenes during the conference are shown below:\n\n![cencon20175](https://fke.utm.my/wp-content/uploads/2017/11/CENCON20175.jpg)\n\n![cencon20172](https://fke.utm.my/wp-content/uploads/2017/11/CENCON20172.jpg)\n\n![cencon20173](https://fke.utm.my/wp-content/uploads/2017/11/CENCON20173.jpg)\n\n![cencon201710](https://fke.utm.my/wp-content/uploads/2017/11/CENCON201710.jpg)\n\n![cencon20174](https://fke.utm.my/wp-content/uploads/2017/11/CENCON20174.jpg)\n\n![cencon20179](https://fke.utm.my/wp-content/uploads/2017/11/CENCON20179.jpg)\n\nBy Mr. Mohd Zaki Daud, Universiti Teknologi Malaysia\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/the-3rd-ieee-conference-on-energy-conversion-successfully-held#)"
}