{
  "markdown": "Open Distance Learning\n======================\n\nUnlock the possibilities. Join Malaysia’s Leading University in Online Learning now!\n\n[Study with us](https://admission.utm.my/odl/)\n\n[Online Learning](https://admission.utm.my/online-learning/)\n\n[eRegistration](https://admission.utm.my/odl-new-application-form/)\n\n[Current Students](https://odl.utm.my/)\n\n01\n\n#### Enriching and\n\n#### engaging learning\n\nWe are committed to ensuring that your online learning experience is enriching and engaging. All learning activities have clear objectives, are driven by inquiry and practical learning, and are supported through innovative technologies.\n\n02\n\n#### Flexibility and\n\n#### choice\n\nAll courses are 100% online with no weekend intensives or other on-campus teaching sessions. With our flexible course and subject options, you can identify your best path and decide on a study time that best fits your busy schedule and other commitments.\n\n03\n\n#### specialisation and career advancement\n\nOur online courses will provide you with opportunities to specialise in subject areas from both research and applied professional disciplines. They will equip you for leadership roles in your line of work or formalise what you have been learning on the job. You will gain the skills and confidence to take the next step in your career, move into a new field or pursue international opportunities.\n\nConnection with leading experts\n-------------------------------\n\nYou will connect with and learn from highly regarded academics who are not only at the forefront in their field, but have extensive backgrounds in research and professional networks across the globe. You’ll also learn from the same academics that teach our on-campus courses.\n\n![](https://admission.utm.my/wp-content/uploads/sites/461/2016/01/admission.png)\n\nLearning Outcomes\n-----------------\n\nThe quality of an ODL programme is ultimately assessed by the ability of the learners to carry out their expected roles and responsibilities in society. This requires the programme to have a clear statement of the learning outcomes to be achieved by the learners.\n\nThe quality of the High Education Provider and the programme that it offers is ultimately assessed by the ability of its graduates to carry out their expected roles and responsibilities in society. This requires a clear statement of the competencies, i.e., the practical, intellectual and soft skills that are expected to be achieved by the learner at the end of the programme. The main domains of learning outcomes cover knowledge, practical and social skills, critical and analytical thinking, values, ethics and professionalism. The levels of competency of these learning outcomes are defined in the Malaysian Qualifications Framework (MQF)."
}