{
  "markdown": "Capstone Project for Part Time Programme (SPACE) Successfully Inaugurated\n=========================================================================\n\nby [powerpic](https://fke.utm.my/author/powerpic/ \"Posts by powerpic\")\n | Sep 28, 2017 | [POWER](https://fke.utm.my/category/power/)\n\n![](https://fke.utm.my/wp-content/uploads/2017/09/Capstone-10-980x735.jpg)\n\nThe first Capstone Project – previously known as 4th Year Laboratory – for the Faculty of Electrical Engineering’s part time programme (SPACE) has been successfully implemented in the third semester of academic session 2016/2017. The Capstone Project was initiated for the programme as a part of the Malaysia Qualifications Agency (MQA)’s requirements, which suggested the implementation of a design project replacing the previously adopted 4th Year Laboratory based on the problem-based learning (PBL) approach. In contradiction to the PBL approach that provided the students with problems to be solved, thee students in the Capstone Project were required to obtain themselves any industry or community based problems related to the given theme. Within the 8 weeks’ duration, the laboratory works generally consisted of 4 main steps; 1) conceiving information to identify a problem, 2) designing possible solution to the problem, 3) implementing the design in terms of product or service and 4) operating and fine-tuning the product or service. The students were required to complete the project in a group of 4-5 members with a given budget. At the end of the projects, the final project prototypes were presented and demonstrated. Four industrial panels, i.e., Ir. Khairull Amrey Bin Abu Seman from the Public Works Department (JKR), Kuala Lumpur, Ir. Lailatul Akmal Binti Abdul Rauf from Jabatan Kesihatan Negeri Selangor, Mr. Mohd Dzulhafizi B Haji Mohd Usman from Aturan Majujaya Sdn. Bhd. and Mr. Mohd Zaid Bin Puteh from MIMOS Semiconductor (M) Sdn. Bhd. were involved in the evaluation together with academic panels. The faculty congratulates the panels and the students for successfully completing the Capstone Project.\n\n![capstone-2](https://fke.utm.my/wp-content/uploads/2017/09/Capstone-2.jpg)  ![capstone-3](https://fke.utm.my/wp-content/uploads/2017/09/Capstone-3.jpg)\n\n![capstone-4](https://fke.utm.my/wp-content/uploads/2017/09/Capstone-4.jpg)  ![capstone-5](https://fke.utm.my/wp-content/uploads/2017/09/Capstone-5.jpg)\n\nThe students carrying out data clustering and brainstorming processes at the beginning of the Capstone Project.\n\n![capstone-6](https://fke.utm.my/wp-content/uploads/2017/09/Capstone-6.jpg)  ![capstone-7](https://fke.utm.my/wp-content/uploads/2017/09/Capstone-7.jpg)\n\n![capstone-8](https://fke.utm.my/wp-content/uploads/2017/09/Capstone-8.jpg)  ![capstone-9](https://fke.utm.my/wp-content/uploads/2017/09/Capstone-9.jpg)\n\n![capstone-10](https://fke.utm.my/wp-content/uploads/2017/09/Capstone-10.jpg)  ![capstone-11](https://fke.utm.my/wp-content/uploads/2017/09/Capstone-11.jpg)\n\nPhotos taken during the evaluation of the final project prototypes\n\nBy Dr. Zulkarnain Ahmad Noorden, Universiti Teknologi Malaysia\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/capstone-project-for-part-time-programme-space-successfully-inaugurated#)"
}