{
  "markdown": "How Well Do You Know Your S-Parameters?\n=======================================\n\nby [commpic](https://fke.utm.my/author/commpic/ \"Posts by commpic\")\n | Dec 7, 2016 | [COMM](https://fke.utm.my/category/comm/)\n\n**Organizer: IEEE APMTTEMC joint Malaysia chapter and FKE UTM Seminar Series 2014/4**\n\n**Title: How Well Do You Know Your S-Parameters?**\n\n**Date:14 May 2014 (Wednesday)**\n\n**Time: 9.00 – 11.00 am**\n\n**Venue: BKT 3 P16**\n\n**Presenter: Prof Tapan K Sarkar (IEEE APS president/Syracuse University USA)**\n\n[![2014-05-14 10.55.52](https://fke.utm.my/departments/wp-content/uploads/sites/9/2014/06/2014-05-14-10.55.52-1024x768.jpg)](https://fke.utm.my/departments/wp-content/uploads/sites/9/2014/06/2014-05-14-10.55.52.jpg)\n\n**Abstract:**\n\nThe purpose of this talk is to demonstrate that a recently published paper dealing with little known facts and some new results on transmission lines is due to an incomplete interpretation of the nonphysical artifacts resulting from a particular mathematical model for the S-parameters. These artifacts are not real and do not exist when a different form of the S-parameters are used. Thus, the first objective of this paper is to introduce the two different types of S-parameters generally used to characterize microwave circuits with lossy characteristic impedance. The first one is called the pseudo-wave, an extension of the conventional traveling wave concepts, and is useful when it is necessary to discuss the properties of a microwave network junction irrespective of the impedances connected to the terminals. However, one has to be extremely careful in providing a physical interpretation of the mathematical expressions as in this case the reflection coefficient can be greater than one, even for a passive load impedance and the transmission line is conjugately matched. Also, the power balance cannot be obtained simply from the powers associated with the incident and reflected waves. The second type of S-parameters is called the power wave scattering parameters. They are useful when one is interested in the power relation between microwave circuits connected through a junction. In this case, the magnitude of the reflection coefficient cannot exceed unity and the power delivered to the load is directly given by the difference between the powers associated with the incident and the reflected waves. Since this methodology deals with the reciprocal relations between powers from various devices this may be quite suitable for dealing with a pair of transmitting and receiving antennas where power reciprocity holds. This methodology is also applicable in network theory where the scattering matrix of a two port (or a multiport) can be defined using complex reference impedances at each of the ports without any transmission line being present, so that the characteristic impedances become irrelevant. Such a situation is typical in small signal microwave transistor amplifiers, where the analysis necessitates the use of complex reference impedances in order to study simultaneous matching and stability. However, for both the definition for the S-parameters, when the characteristic impedance or the reference impedance is complex, the scattering matrix need not be symmetric even if the network in question is reciprocal. The second objective is to illustrate that when the characteristic impedance of the line or the reference impedances in question is real and positive, then both of them provide the same results. Finally, a general methodology with examples is presented to illustrate how the S-parameters can be computed for an arbitrary network without any a priori knowledge of its characteristic impedance.\n\n[![2014-05-14 10.57.33](https://fke.utm.my/departments/wp-content/uploads/sites/9/2014/06/2014-05-14-10.57.33-1024x768.jpg)](https://fke.utm.my/departments/wp-content/uploads/sites/9/2014/06/2014-05-14-10.57.33.jpg)\n [![2014-05-13 13.47.44](https://fke.utm.my/departments/wp-content/uploads/sites/9/2014/06/2014-05-13-13.47.44-1024x768.jpg)](https://fke.utm.my/departments/wp-content/uploads/sites/9/2014/06/2014-05-13-13.47.44.jpg)\n\n**Bibliography:**\n\n[Tapan K. Sarkar](http://www.lcs.syr.edu/faculty/sarkar)\n received the B.Tech. degree from the Indian Institute of Technology, Kharagpur, in 1969, the M.Sc.E. degree from the University of New Brunswick, Fredericton, NB, Canada, in 1971, and the M.S. and Ph.D. degrees from Syracuse University, Syracuse, NY, in 1975. From 1975 to 1976, he was with the TACO Division of the General Instruments Corporation. He was with the Rochester Institute of Technology, Rochester, NY, from 1976 to 1985. He was a Research Fellow at the Gordon McKay Laboratory, Harvard University, Cambridge, MA, from 1977 to 1978. He is now a Professor in the Department of Electrical and Computer Engineering, Syracuse University. His current research interests deal with numerical solutions of operator equations arising in electromagnetics and signal processing with application to system design. He obtained one of the “best solution” awards in May 1977 at the Rome Air Development Center (RADC) Spectral Estimation Workshop. He received the Best Paper Award of the IEEE Transactions on Electromagnetic Compatibility in 1979 and in the 1997 National Radar Conference. He has authored or coauthored more than 300 journal articles and numerous conference papers and 32 chapters in books and fifteen books, including his most recent ones, Iterative and Self Adaptive Finite-Elements in Electromagnetic Modeling (Boston, MA: Artech House, 1998), Wavelet Applications in Electromagnetics and Signal Processing (Boston, MA: Artech House, 2002), Smart Antennas (IEEE Press and John Wiley & Sons, 2003), History of Wireless (IEEE Press and John Wiley & Sons, 2005), Physics of Multiantenna Systems and Broadband Adaptive Processing (John Wiley & Sons, 2007), Parallel Solution of Integral Equation-Based EM Problems in the Frequency Domain (IEEE Press and John Wiley & Sons, 2009), Time and Frequency Domain Solutions of EM Problems Using Integral Equations and a Hybrid Methodology (IEEE Press and John Wiley & Sons, 2010), and Higher Order Basis Based Integral equation Solver (HOBBIES) (John Wiley & Sons 2012) . Dr. Sarkar is a Registered Professional Engineer in the State of New York. He received the College of Engineering Research Award in 1996 and the Chancellor’s Citation for Excellence in Research in 1998 at Syracuse University. He was an Associate Editor for feature articles of the IEEE Antennas and Propagation Society Newsletter (1986-1988), Associate Editor for the IEEE Transactions on Electromagnetic Compatibility (1986-1989), Chairman of the Inter-commission Working Group of International URSI on Time Domain Metrology (1990–1996), distinguished lecturer for the Antennas and Propagation Society from (2000-2003,2011-2013), Member of Antennas and Propagation Society ADCOM (2004-2007), on the editorial board of Digital Signal Processing – A Review Journal (2007-2012), on the board of directors of ACES (2000-2006), vice president of the Applied Computational Electromagnetics Society (ACES), a member of the IEEE Electromagnetics Award board (2004-2007) and an associate editor for the IEEE Transactions on Antennas and Propagation (2004-2010). He is on the editorial board of Journal of Electromagnetic Waves and Applications and Microwave and Optical Technology Letters. He was the chair of the International Conference Technical Committee of IEEE Microwave Theory and Techniques Society # 1 on Field Theory and Guided Waves. He is a member of Sigma Xi and International Union of Radio Science Commissions A and B. He is listed in ISI highly cited and is ranked number 1 in guide 2 research ([http://www.guide2research.com/scientists/antennas\\_and\\_propagation](http://www.guide2research.com/scientists/antennas_and_propagation)\n) with an h-index of 54 and with 12,548 citations. He is the 2014 President of the IEEE Antennas and Propagation Society. He is also the president of OHRN Enterprises, Inc., a small business incorporated in New York state (1985) performing various research work for various organizations in system analysis. He received Docteur Honoris Causa from Universite Blaise Pascal, Clermont Ferrand, France in 1998, from Politechnic University of Madrid, Madrid, Spain in 2004, and from Aalto University, Helsinki, Finland in 2012. He received the medal of the friend of the city of Clermont Ferrand, France, in 2000.\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/how-well-do-you-know-your-s-parameters#)"
}