{
  "markdown": "Photonics Experts Shared Current Research Works During Recent Photonics Lecture Series\n======================================================================================\n\nby [commpic](https://fke.utm.my/author/commpic/ \"Posts by commpic\")\n | May 27, 2017 | [COMM](https://fke.utm.my/category/comm/)\n\n![](https://fke.utm.my/wp-content/uploads/2017/05/art36-4.jpeg)\n\n25th May 2017 – Lightwave Communication Research Group (LCRG) with the collaboration of the IEEE Photonics Society Malaysia Section (MyIPS) had successfully organized the Photonics Lecture Series (PLS) on the May, 16th. PLS is a series of technical talks that focused on the field of photonics and optics, and are delivered by experts in the relevant fields from various research entities across Malaysia. This time around, the PLS was held in the Faculty of Electrical Engineering of Universiti Teknologi Malaysia (UTM), Johor Bahru. The experts who were invited to share their current research works were the esteem Dr. Raja Kamarulzaman Raja Ibrahim from the Physics Department, Faculty of Science UTM and Dr. Muhammad Al Farabi Muhammad Iqbal from the Communication Engineering Department, Faculty of Electrical Engineering UTM.\n\n![](https://fke.utm.my/wp-content/uploads/sites/9/2017/05/art36-1.jpeg)\n\n* * *\n\n**The esteem Dr. Raja Kamarulzaman commenced the lecture session with an interesting presentation on the Non-thermal Plasma.**\n\n* * *\n\nDr. Raja Kamarulzaman had commenced the lecture session with an interesting research topic, namely the “Fiber Bragg Gratings: The Perfect Tools to Understand and Monitor Non-thermal Plasma Properties and Application”. The session was then continued with lecture on another fascinating research topic delivered by Dr. Muhammad Al Farabi that was the “Disaster Survivability of Optical Network”. Both speakers had successfully attracted the attention of their audience with exciting research prospects in their field and motivating research experiences that they had encountered throughout their endeavor. Research colleagues, under graduate students and post graduate students were among the audience who took part in the lecture. The audience had the opportunity to interact with the speakers at the end of the lecture session, where numerous questions and opinions were exchanged.\n\n![](https://fke.utm.my/wp-content/uploads/sites/9/2017/05/art36-2.jpeg)\n\n![](https://fke.utm.my/wp-content/uploads/sites/9/2017/05/art36-3.jpeg)\n\n* * *\n\n**Prof. Dr. Sevia Mahdaliza Idrus Sutan Nameh presented some souvenirs to the invited speakers.**\n\n* * *\n\n![](https://fke.utm.my/wp-content/uploads/sites/9/2017/05/art36-4.jpeg)\n\n* * *\n\n**Invited speakers and audience took the opportunity to have photograph together.**\n\n* * *\n\n[HOME](https://fke.utm.my/comm/)\n\n* * *\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/photonics-experts-shared-current-research-works-during-recent-photonics-lecture-series#)"
}