{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/international-program-for-upskilling-professional-graduates-organized-by-utm-architecture-program#)\n    \n*   [Instagram](https://builtsurvey.utm.my/international-program-for-upskilling-professional-graduates-organized-by-utm-architecture-program#)\n    \n*   [RSS](https://builtsurvey.utm.my/international-program-for-upskilling-professional-graduates-organized-by-utm-architecture-program#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/international-program-for-upskilling-professional-graduates-organized-by-utm-architecture-program#)\n    \n*   [Instagram](https://builtsurvey.utm.my/international-program-for-upskilling-professional-graduates-organized-by-utm-architecture-program#)\n    \n*   [RSS](https://builtsurvey.utm.my/international-program-for-upskilling-professional-graduates-organized-by-utm-architecture-program#)\n    \n\nInternational Program for Upskilling Professional Graduates Organized by UTM Architecture Program\n=================================================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Mar 30, 2022 | [News](https://builtsurvey.utm.my/category/news/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2022/04/unnamed-718x675.png)\n\nPrepared by: The Director of Architecture program, Assoc. Prof. Dr. Alice Sabrina Ismail\n\nAs part of the Universiti Teknologi Malaysia (UTM) Architecture program initiatives to upskill the students with professional exposure towards excellent employability in the global market, an international event was conducted with UTM Career Centre and the Faculty of Built Environment and Surveying.\n\nThis occasion was held on the 21st February 2022 and officiated by the Head of Architecture Program, Assoc. Prof. Dr. Alice Sabrina Ismail, moderated by Dr. Iziq Eafifi Ismail.\n\nTwo main prominent speakers in the industry, represented by the principal architect from Farik Ghaffar Architect, Ar. Ahmad Farik Abd Ghaffar, and the principal architect of Rushdina Architect, Ar. Rushdina Ismail, were invited to share their professional experience on value-added skills and the importance of having soft skills.\n\nFuture graduates will need to regularly upskill during their careers as the challenge to match graduate skills with industry demands has never been more significant for employability.\n\nEmployability, therefore, is not just about getting a job; it is about a broader set of attributes that will enable a graduate to be successful throughout their working life.\n\nIt cannot be easily ignored, as thinking about employability from an early stage is likely to increase the chance of success in one’s chosen career.\n\nIn this regard, both speakers provided valuable inputs not only for students but also to graduates in order for them to enhance new abilities to become versatile, resilient and critical thinker individuals with game-changer attitudes.\n\n![](https://ci6.googleusercontent.com/proxy/acU-z94g8ykJZdz6S0d0EkyG3_kTGWug0iDZp0xdS0XfKz2Y6neYm456pf9bEtgDjB2w0RxIgmSyQFiLkbaasZls2PQWdgjmnNZY-O3Q=s0-d-e1-ft#https://news.utm.my/wp-content/uploads/2022/03/Picture2.png)\n\nIn addition, they also highlighted graduates to be technologically-savvy employees who have digital transformation skills to face the critical challenges in the 21st century workplace environment.\n\nThis event, which lasted for four hours, was well-received by students from different backgrounds representing local and abroad universities, polytechnic, and colleges.\n\nAlmost 200 attendees from various fields participated in this session.\n\nMany gave positive feedback and looked forward to having a similar program conducted in the near future.\n\nFrom a survey done, many agree that early exposure to the industry is vital to prepare graduates for real-world insights before entering the workplace.\n\nThis is essential to cope with rapid changes in the industry and take charge of their learning."
}