{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/utm-lcarc-jpbw-and-isi-exhibit-and-promote-malaysias-science-to-action-s2a-approach-to-low-carbon-sustainable-communities-at-wuf9#)\n    \n*   [Instagram](https://builtsurvey.utm.my/utm-lcarc-jpbw-and-isi-exhibit-and-promote-malaysias-science-to-action-s2a-approach-to-low-carbon-sustainable-communities-at-wuf9#)\n    \n*   [RSS](https://builtsurvey.utm.my/utm-lcarc-jpbw-and-isi-exhibit-and-promote-malaysias-science-to-action-s2a-approach-to-low-carbon-sustainable-communities-at-wuf9#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/utm-lcarc-jpbw-and-isi-exhibit-and-promote-malaysias-science-to-action-s2a-approach-to-low-carbon-sustainable-communities-at-wuf9#)\n    \n*   [Instagram](https://builtsurvey.utm.my/utm-lcarc-jpbw-and-isi-exhibit-and-promote-malaysias-science-to-action-s2a-approach-to-low-carbon-sustainable-communities-at-wuf9#)\n    \n*   [RSS](https://builtsurvey.utm.my/utm-lcarc-jpbw-and-isi-exhibit-and-promote-malaysias-science-to-action-s2a-approach-to-low-carbon-sustainable-communities-at-wuf9#)\n    \n\nUTM-LCARC, JPBW and ISI Exhibit and Promote Malaysia’s “Science to Action” (S2A) Approach to Low Carbon, Sustainable Communities at WUF9\n========================================================================================================================================\n\nby [webmaster FAB](https://builtsurvey.utm.my/author/norazreen/ \"Posts by webmaster FAB\")\n | Feb 12, 2018 | [Conference & Seminar](https://builtsurvey.utm.my/category/conference-seminar/)\n, [News](https://builtsurvey.utm.my/category/news/)\n, [photo](https://builtsurvey.utm.my/category/photo/)\n, [UTM News](https://builtsurvey.utm.my/category/utm-news/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2018/02/UTM-LCS-WUF9-14-1080x675.jpg)\n\n**Kuala Lumpur, 10th February –** Universiti Teknologi Malaysia (UTM), through the UTM-Low Carbon Asia Research Centre (UTM-LCARC) that is based in the Department of Urban and Regional Planning (JPBW), Faculty of Built Environment, and the Institut Sultan Iskandar (ISI) organise an exhibition and a side event at the 9th Session of the World Urban Forum (WUF9) at the Kuala Lumpur Convention Centre on 7-13 February 2018.\n\n![](https://news.utm.my/wp-content/uploads/2018/02/IMG_20180207_130804-1320x733.jpg)\n\nOrganised every two years by the United Nations Human Settlements Programme (UN-Habitat), the WUF is the largest United Nations conference on urban development and cities.  Held for the second time in an Asian city, the forum features over 500 events, including assemblies, high-level roundtable talks, dialogues, side events and exhibitions.  WUF9, themed “Cities 2030, Cities for All: Implementing the New Urban Agenda”, focuses among others on advancing sustainable urban development and low carbon communities and is expected to be attract over 25,000 people from 193 countries.\n\n![](<Base64-Image-Removed>)\n\nThrough WUF9, JPBW showcases UTM-LCARC’s latest work and achievements in advancing city-level sustainability and climate change action plan-making through the “Science to Action” (S2A) approach, which involves scientific evidence-based policy-making through multiple stakeholder engagements and real policy implementation in Iskandar Malaysia, Putrajaya, Kuala Lumpur and Pengerang.  Also featured are research and consultancy works by the Centre for Innovative Planning and Development (CIPD) that straddle multiple disciplines of transportation and logistics, tourism, urban design and rural development.\n\n![](<Base64-Image-Removed>)\n\nInstitut Sultan Iskandar (ISI), UTM’s gazetted, independent not-for-profit research and development company specialising in planning and development, showcases its high-profile flagship MIT-UTM Malaysia Sustainable Cities Program that started in 2014.  The MIT-UTM MSCP mission is to study and document sustainable city development efforts in Malaysia. Visiting scholars from around the world spend September-December each year conducting research in Malaysia. They then spend February-May at MIT developing research findings into instructional materials to enhance and extend the teaching of sustainable city development across universities in the global South. The MSCP is housed in the Science Impact Collaborative in the Department of Urban Studies and Planning at MIT, and ISI at UTM.\n\n_Reported by: Chau Loon Wai, Ahmad Faizal Salleh_\n\nSource: _[UTM-LCARC, JPBW and ISI Exhibit and Promote Malaysia’s “Science to Action” (S2A) Approach to Low Carbon, Sustainable Communities at WUF9](https://news.utm.my/2018/02/utm-lcarc-jpbw-and-isi-exhibit-and-promote-malaysias-science-to-action-s2a-approach-to-low-carbon-sustainable-communities-at-wuf9/)\n_"
}