{
  "markdown": "Academic Office : +607-5333716 | Email : academic-fcee@utm.my | Administration Office : +607-5533499 [fcee@utm.my](mailto:fcee@utm.my)\n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\n*   [Facebook](https://www.facebook.com/fktutm/)\n    \n*   [RSS](https://news.utm.my/)\n    \n\nABOUT FACULTY\n=============\n\nUTM FCEE features some world class chemical engineering and energy engineering teaching and learning, as well as Research & Development programmes. In 2017, UTM-Chemical Engineering was listed in the rank of 51-100 (or top 1%) Chemical Engineering programmes globally under the QS World University Subject Ranking. The Petroleum Engineering programme of FCEE has been prominently recognised world-wide through their global involvements in nurturing graduates of the 21st century via the Society of Petroleum Engineers. The UTM SPE student chapter has received the Global Outstanding SPE Student Chapter award for six times over the last ten years.\n\n**UTM-FCEE contributions in five UTM niche areas**\n\nThe aforementioned achievements have been made by the faculty together with its seven world-renowned institutes and centres of excellences (COEs) in research and education covering five UTM Niche areas, or Research Alliances (RAs) as it is known in UTM. The five niche RAs include Health and Wellness, Frontier Materials, Resource Sustainability, Smart Digital Community and Innovative Engineering.\n\n![](https://fkt.utm.my/wp-content/uploads/2024/09/Untitled-1080x675-1.png \"Untitled-1080x675\")\n\nThe UTM RA of Health and Wellness is led by the Institute of Bioproduct Development, or the IBD. In 2017, the IBD has been awarded the Higher Institution Centre of Excellence (HICOE) by Malaysia’s Ministry of Higher Education. This award recognizes the pivotal role of IBD as THE national centre to spearhead the nation’s mission to utilize tropical plants and microbes for the development of new products for human health and wellness. To date, IBD have commercialized more than 30 bioproducts through its spin-off company Phytobiznet Sdn Bhd; an anchor company selected by Malaysia’s Ministry of Agriculture for Entry Point Project 1 to champion the initiative of producing High Value Herbal Products. The IBD has made notable international contributions as an approved training provider for the Organization for the Prohibition of Chemical Weapons (OPCW) headquartered in The Hague, Netherlands since 2012 – 2016 for a course entitled “Natural Product Chemistry Training and Development Program”. Through this, the IBD have trained 70 scientists from OPCW member states\n\nThe second niche area is UTM RA on Frontier Materials led the Advanced Membrane Technology Research Centre (AMTEC). AMTEC is known as a regional and international referral centre for advanced membrane technology and applications. Through its outstanding work in developing innovative and cleaner separation processes using membrane technology, AMTEC received more than 130 national and international awards that include the prestigious Malaysian Merdeka Award (Malaysia Nobel Prize) in 2014, Malaysia Rising Star Award 2016, Most Cited Researchers for Shanghai Ranking’s Global Ranking of Academic in Chemical Engineering Shanghai Jiaotong University by Elsevier 2016, Malaysian Toray Science and Technology Foundation Award 2013, Winner of IChemE (Malaysia) Innovator of the Year Award 2014, Japan’s Sakura Exchange Program Award 2016, Asean University Network- Short Research in Japan Program Award 2016, Royal Society Exchange Program Award and ASEAN Young Scientist Award 2001. Recently in 2016, AMTEC has won Malaysia’s Best Academia-Industry Collaboration Award.\n\n![](https://fkt.utm.my/wp-content/uploads/2024/09/fpree-2014-2.jpg \"fpree-2014-2\")\n\nThe third UTM niche area of Resource Sustainability has been marked by the globally prominent UTM Process Systems Engineering Centre (or UTM PROSPECT) that has extensive involvement and track records in the planning, design, modeling and synthesis of innovative and sustainable systems and processes, products and enterprise supply chains as well as in the optimal and efficient operation of process systems. Over the last 20 years, the members of PROSPECT have been engaged in advancing the field of Process Systems Engineering (PSE) globally through research and development, commercialisation, consultancy, and technology transfer through professional training involving more than 500 organisations spanning various facilities, government organisations and multinational industries including palm oil and oleochemicals, bio-processes, herbal and pharmaceuticals, refinery and petrochemicals, fine chemicals, semi-conductor, pulp and paper, food and drinks as well as cement and steel. As a result, the 2014 Elsevier Scival Spotlight has ranked UTM globally as the top organisation (first) under the competency of heat exchangers, retrofitting and design (see- Elsevier Scival Spotlight 2014 report).\n\nThe fourth UTM Niche RA is Innovative Engineering. Under this RA, the Centre on Engineering Education (CEE) has played a pivotal role in the global development of Engineering Education discipline. The UTM CEE is a referral centre for the advancement of engineering education that has received international recognition for its work. The work at the CEE focuses of rigorous research to improve engineering education in schools to universities and into the training of graduate engineers. In 2007, the CEE assisted the university in establishing and managing one the first established PhD program in engineering education in the world. The CEE fellows have been extensively involved in providing training on engineering and STEM education programs and capacity building. Thus far, CEE has trained more than 1000 lecturers and teachers on Outcome-Based Education, Student-Centre Learning, Cooperative Learning, Problem-Based Learning and many other courses to academic staff and teachers from Malaysia and various parts of the world including Korea, Turkey, Afghanistan, Singapore, Philippines, India, Morocco and China. The programs organized or jointly organized by CEE are designed for capacity building and supporting a community of practice in engineering education, such as the Innovative Practices in Higher Education Exhibition (I-PHEX) since 2014, the Regional Conference in Engineering Education since 2005, the TRIZ Carnival, Sustainable & Low Carbon Schools Exhibition, Iskandar Malaysia Ecolife Challenge, Problem-Based Learning for Low Carbon Society and many more.\n\nEvidence of the aforementioned world class achievements of UTM FCEE in chemical engineering, energy engineering and engineering education are the testimonies that FCEE as the beacon of excellence in chemical and energy engineering technology and life-long learning in Asia and across the world."
}