{
  "markdown": "Invited Lecture for Fire Investigation Division, State of Johore Fire and Rescue Department\n===========================================================================================\n\nby [powerpic](https://fke.utm.my/author/powerpic/ \"Posts by powerpic\")\n | Dec 3, 2015 | [POWER](https://fke.utm.my/category/power/)\n\n![bomba](https://fke.utm.my/wp-content/uploads/2016/12/Bomba.jpg)\n\nStaff from the Faculty of Electrical Engineering, Universiti Teknologi Malaysia was invited to give a lecture on Electrical Safety by the Fire Investigation Division, State of Johore Fire and Rescue Department for their teams of investigators from the districts of Johor.  The course entitled “Kursus Asas Elektrikal dan Pengendalian Bahan Bukti Makmal Penyiasatan Kebakaran” (Electrical Basics and Handling of Fire Investigation Laboratory Evidence) was conducted on 18th to 20th October 2015 at the Johore Fire and Rescue Department headquarters in Tebrau, Johore.\n\nThe aim of the electrical basics part is to expose the technical concept of short circuit events and electrical shock. Dr Zuraimy was invited to give a 6-hour lecture inclusive of the technical aspects of the air conditioning systems. The lecture was conducted mainly based on the engineering/scientific reasons on each preventive measures of short circuit and electrical shock. The Question and Answer session was quite lengthy as participants needs a lot of explanation on their own experiences during investigations related to electrical fire. A question on how to classify the ratings of a Moulded Case Circuit Breaker (MCCB) remains from a fire incident is one of the interesting questions to be addressed.\n\nOn the last day of the course, the session was ended at the Institute of High Voltage and High Current, Faculty of Electrical Engineering, Universiti Teknologi Malaysia, Skudai, with a 4-hour visit. The visit was complemented by a few demonstrations of electrical arcing/sparks and an analytical walk through of an actual fire scene which occurred 6 months before.\n\nThe collaboration was so successful that it led to an idea of providing the same course content to investigators from other states in the Peninsular of Malaysia organised by the Fire Investigation Division, State of Johore Fire and Rescue Department. With careful planning and revisions, the same course content would be suitable to other Government Bodies. The Faculty and The Institute looks forward for the future courses tailored for other Government Forces. Please contact the Dean of the Faculty of Electrical Engineering for enquiries.\n\n# Dr. Zuraimy Adzis, Institute of High Voltage and High Current, Universiti Teknologi Malaysia.\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/invited-lecture-for-fire-investigation-division-state-of-johore-fire-and-rescue-department#)"
}