{
  "markdown": "Seminar for First Year Undergraduate Students\n=============================================\n\nby [powerpic](https://fke.utm.my/author/powerpic/ \"Posts by powerpic\")\n | Sep 29, 2016 | [POWER](https://fke.utm.my/category/power/)\n\nThe Faculty of Electrical Engineering (FKE), Universiti Teknologi Malaysia (UTM), organised a seminar for its first year undergraduate students on 27 September 2016 as part of its initiatives to expose its students to attributes of electrical engineers from both academic and practical points of view.\n\nThe seminar started with an opening speech by Dr. Lau Kwan Yiew, the course coordinator for the subject “Introduction to Electrical Engineering”. This was followed by a talk on “The Importance of Professional Engineering Bodies” by Assoc. Prof. Ir. Dr. Sharul Kamal Abdul Rahim from the Wireless Communication Centre, UTM. Assoc. Prof. Ir. Dr. Sharul Kamal shared his view on the importance of the Board of Engineers, Malaysia (BEM), Institution of Engineers, Malaysia (IEM) and Engineering Accreditation Council (EAC) of Malaysia. Assoc. Prof. Ir. Dr. Sharul Kamal also discussed on recent trends in engineering and the importance of engineers, especially Professional Engineers, on the sustainable development of the country.\n\nLater, Ir. Khairul Amrey Abu Seman from the Public Works Department (JKR) of Malaysia gave his talk entitled “Work Experience as Electrical Engineer”. Ir. Kahirull Amrey shared his experience as an electrical engineer and emphasised the importance of engineers to embark on continuous professional development. Ir. Khairull Amrey also shared his real-life working environment and provided his viewpoints on several aspects that an engineer should excel in – project management, design and maintenance, asset management and communication skill.\n\nBoth talks ended with a questioning and answering session by the students. As a token of appreciation to their talks, FKE awarded Assoc. Prof. Ir. Dr. Sharul Kamal and Ir. Khairull Amrey some souvenirs. On behalf of FKE, Dr. Lau wishes to thank them for their voluntary contribution to the seminar.\n\nPhotos during the seminar:\n\n![????????????????????????????????????](https://fke.utm.my/wp-content/uploads/2016/12/DSC_5925aa.jpg)\n\n![dsc_5943-1024x683](http://web.fke.utm.my/wp-content/uploads/sites/9/2016/12/DSC_5943-1024x683-1024x683.jpg)\n\n![dsc_5948-1024x683](http://web.fke.utm.my/wp-content/uploads/sites/9/2016/12/DSC_5948-1024x683-1024x683.jpg)\n\n![dsc_5910-1024x521](http://web.fke.utm.my/wp-content/uploads/sites/9/2016/12/DSC_5910-1024x521-1024x521.jpg)\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/seminar-for-first-year-undergraduate-students#)"
}