{
  "markdown": "Dr Yeong Che Fai wins first place in the Royal Academy of Engineering’s Leaders in Innovation Fellowships\n=========================================================================================================\n\nby [website](https://fke.utm.my/author/website/ \"Posts by website\")\n | Dec 18, 2017 | [Faculty](https://fke.utm.my/category/faculty/)\n, [Research](https://fke.utm.my/category/research/)\n\n![](https://fke.utm.my/wp-content/uploads/2017/12/YEONG-225x300-1.jpg)\n\nJOHOR BAHRU, 18 December 2017 – Ending a year end by winning a reputable award is a great moment. For Dr Yeong Che Fai, the year 2017 is full of sweet memories. He won several awards in national and international competition and exhibition.\n\n![yeong](https://fke.utm.my/wp-content/uploads/sites/9/2017/12/YEONG.jpg)  \nDr Yeong showing his certificate in London.\n\nAn academician from Faculty of Electrical Engineering (FKE), Universiti Teknologi Malaysia (UTM) stand tall after grabbing first place in the Royal Academy of Engineering’s Leaders in Innovation Fellowships final pitch session 2017/18 sponsored by Newton – Ungku Omar Fund.\n\nDr Yeong Che Fai won the first place presenting his research product Compact Rehabilitation Robot (CR2) to improve stroke rehabilitation.\n\nThe product has underwent clinical trial and currently sold to China.\n\nDr Yeong is a serial entrepreneur and has mentored and collaborated with several start-ups and companies in entrepreneurship world such as www.techcareinnovation.com, www.dfautomation.com, www.i-stone.com.my, www.cytron.io, www.charbycharge.com, www.deltaglobal.com.my and www.sandwichmultimedia.com.\n\nMost interestingly, his wife Dr Eileen Su Lee Ming from FKE, UTM has won this award in February early this year.(http://www.utm.my/2017/02/28/congratulations-to-dr-eileen-su-lee-ming/).\n\nThe Royal Academy of Engineering’s Leaders in Innovation Fellowships final pitch session 2017/18 is a tough competition as only 15 academic staffs being shortlisted in Malaysia for this prestigious two weeks programming running from 4th to 15th December 2017.\n\nThis program was jointly organised by The Malaysian Industry – Government Group for High Technology (MIGHT) and the Royal Academy of Engineering and co-sponsored by Newton Fund and Ungku Omar Fund.\n\nOne of the main criteria is the product must has high commercial potential. This program ran concurrently with participants from Mexico and Vietnam.\n\nBesides Dr Yeong, two others staffs from UTM were Associate Professor Dr Hazlina Selamat for her project Ekso-C: A Smart Exoskeleton System for Oil Palm Harvesting and Associate Professor Ir Dr Sharifah Hafizah Syed Ariffin for her research project Wireless Water Quality Clound Monitoring System.\n\nDr Yeong’s passion is to bring research to commercialisation which he thinks is very important to country economy.\n\nHe has won many innovation awards, more than 50 awards since 2002 such as British Invention Show, Korean Inventor Award, Philips Young Inventor Challenge, MaGIC e@Standord, Robofest, MOHE Best Mentorship Award and APICTA.\n\nIn 2010 when Dr Yeong came back from Imperial College after finishing his PhD, he thought he needs to do something more rather than just winning innovation competition. He wants to commercialise the research product.\n\nHe has since then established several award winning start up companies such as www.techcareinnovation.com and www.dfautomation.com. The journey was not easy and full with challenges. As an academic,\n\nDr Yeong needs to learn about business while serving responsibilities as academic. During these 5 years of journey, Dr Yeong has equipped with knowledge in both world, academic and entrepreneurship. He has since then mentoring some students for entrepreneurship as well as establish collaboration between UTM and Industries.\n\nThis notable achievement shows UTM in the right direction in commercialising research products.\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/dr-yeong-che-fai-wins-first-place-in-the-royal-academy-of-engineerings-leaders-in-innovation-fellowships#)"
}