{
  "markdown": "Academic Service Learning Programme Implemented through Undergraduate Course\n============================================================================\n\nby [powerpic](https://fke.utm.my/author/powerpic/ \"Posts by powerpic\")\n | Nov 21, 2017 | [POWER](https://fke.utm.my/category/power/)\n\n![](https://fke.utm.my/wp-content/uploads/2017/11/ASL3-1-980x391.jpg)\n\nThe Academic Service Learning (ASL) programme was introduced to the teaching and learning approach of the SKEE 4653 (Photovoltaic and Wind Energy System) course of the Faculty of Electrical Engineering, Universiti Teknologi Malaysia (UTM), in the first semester of the 2017/2018 academic session.\n\nThe ASL is one of the components of UTM’s New Academia Learning Innovation (NALI) initiative. The main objective of the ASL, implemented through the SKEE 4653 course, was to engage UTM’s students with the community. The engagement was deemed vital to enhance the students’ soft skills and, at the same time, promote the key contents of the course, i.e., photovoltaic technology and interest, to secondary school pupils.\n\nIn implementing the ASL programme, 54 students undertaking the SKEE 4653 course were divided into four groups consisting of 10 to 13 members. They were required to approach secondary schools and plan for a talk and activities for the secondary school pupils; the main audience was the Form Three pupils. Four schools were selected for the programme, and they were SMK Mutiara Rini, SMK Skudai, SMK Desa Skudai and SMK Taman Universiti. During the ASL, all relevant planning and execution of the activities were done by the students, but closely monitored by the lecturers, Dr. Shahrin Md Ayob and Ir. Dr. Tan Chee Wei. The students’ talk and activity proposals were discussed with and carefully evaluated by the lecturers.\n\nThe ASL programme was successfully carried out for all the schools. The schools gave positive feedback on the programme and insisted similar programmes to be carried out at their schools in the future.\n\n![asl1](https://fke.utm.my/wp-content/uploads/2017/11/ASL1.jpg)\n\nStudent facilitator share her ideas with secondary school pupils\n\n![asl2](https://fke.utm.my/wp-content/uploads/2017/11/ASL2.jpg)\n\nPrizes for secondary school pupils who won in the competitions during ASL\n\n![asl3](https://fke.utm.my/wp-content/uploads/2017/11/ASL3.jpg)\n\nInteractive activity during ASL\n\nBy Dr. Shahrin Md Ayob , Universiti Teknologi Malaysia.\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/academic-service-learning-programme-implemented-through-undergraduate-course#)"
}