{
  "markdown": "607-5537599/7595 ( Office ) [utmpesisir@utm.my](mailto:utmpesisir@utm.my)\n\n*   [Home](https://odl.utm.my/)\n    \n*   [About Us](https://odl.utm.my/about-us/)\n    \n*   [Programmes](https://odl.utm.my/program/)\n    \n*   [Learning Platform](https://odl.utm.my/learning-platform/)\n    \n*   [Learners Support](https://odl.utm.my/online-learning-support/)\n    \n*   [ODL Guideline](https://odl.utm.my/utm-odl-guideline/)\n    \n*   [FAQs](https://odl.utm.my/faqs/)\n    \n*   [News & Announcement](https://odl.utm.my/news-announcement/)\n    \n*   [Contact Us](https://odl.utm.my/contact-us/)\n    \n\nFrequently Asked Questions|\n===========================\n\n### **UTM ODL ACCREDITATION**\n\n#### What does Self-Accreditation mean?\n\n_Self-Accreditation is a status that entitles Higher Education Institutions (HEIs) to accredit their programmes through the Senate without involving MQA. However, the status granted by MQA to universities that are confirmed to have a robust internal quality assurance system. Nevertheless, the accreditation does not include a professional programme that still needs to be accredited and recognised by the relevant professional bodies. You can obtain more information on self-accreditation via [https://www2.mqa.gov.my/portal\\_swa/](https://www2.mqa.gov.my/portal_swa/)\n_\n\n#### Is the programme accredited by the Malaysian Qualifications Agency (MQA)?\n\n_The UTM ODL programme has obtained accreditation by Malaysian Qualifications Agency (MQA) and recognized by the Government of Malaysia. You can also find out information about accreditation through the MQA website at [www.mqa.gov.my](http://www.mqa.gov.my/)\n_\n\n### **FINANCIAL**\n\n#### What will my tuition fees be?\n\n_Fees can be vary for each programme, the total cost you pay is depending on the course you choose to study. Information on tuition fees of program offered can be found on our website at [odl.utm.my/program/](https://odl.utm.my/program/)\n_\n\n#### Is there any financial support available to Distance Learning students?\n\n_The local postgraduate students may be able to get a discount to assist with financial assistance. Unfortunately, for the international students, there is no financial support at the moment. But, the University allow most cases that tuition fees can be paid by instalments._\n\n### **UTM ODL PROGRAMMES**\n\n#### Is there an age limit for this programme?\n\n_There is no age limit for this programme as you fulfil all the admission requirements._\n\n#### Is the ‘Open and Distance Learning’ stated in my scroll?\n\n_No. The Open and Distance Learning status only appears on your transcript._\n\n#### How long should it take to complete the course?\n\n_The time taken to complete an online degree depends on the time you are able to commit your study. An online degree can take between two to maximum of four years._\n\n#### Would I be able to switch from a campus course to an online course half way through my degree?\n\n_No, it is not possible for a student to switch from a campus course to an online course half way through the study._\n\n#### How long will it take to consider my application?\n\n_To ensure that applicants are fairly and thoroughly considered, there are several stages all applications must pass through, before an offer can be made. As your application proceeds through the various stages, and once a final decision is done, status will be updated at [smart.utm.my](https://odl.utm.my/smart.utm.my)\n_\n\n#### Where will I graduate?\n\n_The convocation ceremony will be held at UTM Johor Bahru, Malaysia. Attendance is optional, the distance learning students are welcome to visit the university, meet fellow graduates and celebrate their success_\n\n#### Am I required to visit or be on campus?\n\n_Travelling to UTM campus is not necessarily an option. Our distance learning programme can be completed from wherever you are in the world without visiting the University._\n\n### **TEACHING & LEARNING OF ODL**\n\n#### What equipment is used for teaching and learning activities?\n\n_You need a computer or laptop with a camera, microphone, and speaker. You also need a strong internet connection and an up-to-date web browser._\n\n#### Do I need to attend any physical classes?\n\n_For ODL students, you only need to join classes virtually (synchronous). No physical classes are required. Attendance will be taken for synchronous class. However, if you are unable to attend the virtual class, you still have the opportunity to re-watch the recorded video version. For programmes requiring face-to-face / physical classes (for example, involving practical or hands-on activities), you will need to attend the said physical classes._\n\n#### What is LMS?\n\n_LMS is a learning management system. This is your central platform for learning activities as you go through your learning journey. [https://odlsystem.utm.my](https://odlsystem.utm.my/)\n is the official online learning platform for Open & Distance Learning (ODL) lecturers and students._\n\n#### How are online courses delivered?\n\n_Our courses structure is 6 times synchronous meetings through an online learning management system. Our lecturers also run regular live online lectures via our video conferencing system that students are encouraged to attend, enabling them to communicate in real time. Class sizes are kept small (not more than 20 students) to maximize interaction between students and instructors._\n\n#### How can I contact my lecturer for any academic questions?\n\n_Early every semester, you will be provided with your lecturer’s contact details. Other than that, you can find your lecturer details in the LMS._\n\n#### Where can I view my learning materials, access to study, lecture, profile, examination results, and the link to other resources?\n\n_Online students are required to log in to our Open Distance Learning Management system ([https://odlsystem.utm.my/](https://odlsystem.utm.my/22231/)\n). Student can view the syllabus and grades, contact lecturers, classmates and support services; access course materials and lesson progress._\n\n### **UTM ODL SUPPORT**\n\n#### What types of support will be expected as an ODL student?\n\n_You will receive the types of support: administrative, library, student learning portal, finance, IT support, counselling, and general ODL helpdesk._\n\n#### If I have any general questions, whom should I contact?\n\n_You may refer to [https://odl.utm.my/contact-us/](https://odl.utm.my/contact-us/)\n_\n\n[Ask A Question](https://odl.utm.my/contact-us/)"
}