{
  "markdown": "### HEALTH REQUIREMENTS\n\nYou are required to undergo a compulsory medical check up in Malaysia (managed by the University) and you must be certified as being in good health and free from contagious/ infectious diseases or illness that will adversely affect your study. International students from the yellow fever endemic areas without a valid immunisation certificate will be immediately quarantined on arrival for 6 days minus the period of travel. The university has the right to withdraw this offer or to terminate you from your study if you are found to suffer from or to be a carrier of contagious/ infectious diseases, or to suffer from a medical condition requiring continuous medical care that will adversely affect your study at UTM.\n\n*   [Communicable Diseases](https://admission.utm.my/health-requirements#)\n    \n*   [Chronic Non-Communicable Disease](https://admission.utm.my/health-requirements#)\n    \n\n|     |     |     |     |     |\n| --- | --- | --- | --- | --- |\n| **No** | **Type of Disease/Problem** | **Example** | **University’s Decision** |     |\n| **Detected Before Registration** | **Detected After Registration** |\n| 1   | Contagious Difficult and require prolonged treatment Expensive treatment | HIV / AIDS Hepatitis B Hepatitis C | Not fit for registration | Allowed to continue study with conditions :Student bears all medical expenses (will not be covered under the student health scheme / insurance). Pursue existing course only.Allowed to defer studies up to 2 semesters only (if necessary). |\n| 2   | Infectious Treatable within certain period of time. | Tuberculosis | Defer registration until treatment is completed (up to 2 semesters).Certified as “treatment completed” by attending doctor | Allowed to continue study.Allowed to defer study up to 2 semesters only (if necessary). |\n| 3   | Infectious Treatable within short period of time. | Malaria Typhoid Syphilis (VDRL) | Allowed to register To undergo treatment Cost of treatment is covered under student health scheme / insurance | Allowed to continue study.Allowed medical leave (if necessary) ≤ 2 weeks only Cost of treatment is covered under student health scheme / insurance |\n| 4   | Communicable Disease defined as epidemic by MOH. | Japanese encephalitis,SARS Avian flu | Not fit for registration. | Depending on the latest health circulars issues by the Ministry of Health and / or WHO. |\n\n|     |     |     |     |     |\n| --- | --- | --- | --- | --- |\n| **No** | **Type of Disease/Problem** | **Example** | **University’s Decision** |     |\n| **Detected Before Registration** | **Detected After Registration** |\n| 1   | Condition that can endanger to himself or others.Recurring repeatedly and affecting his study | Epilepsy Schizophrenia | A report is required from the specialist responsible for treatment. Student can be accepted for registration if: Asymptomatic for more than 12 months; and No longer on treatment; or Undergoing but student has agreed to self-finance the treatment costs. | Continue study if: Symptom does not affect study, and Student bears all medical expenses (will not be covered under the student health scheme / insurance).Allowed to continue current study only. |\n| 2   | Expected to be prolonged.Obvious and serious symptoms.Prolong treatment schedule. | Dialysis Cancer | Not fit for registration | Continue study if: Symptom does not affect study and Student bears all medical expenses (will not be covered under the student health scheme / insurance). |\n| 3   | Addiction or drug abuse as stated in AUKU or Malaysian Law. | Drugs | Not fit for registration | Terminate study and may be subject to disciplinary action by UTM. |\n| 4   | Continuous medication.No serious symptoms.Treatment does not affect study. | Hypertension Diabetes Mellitus | Student can be accepted for registration if: Treatment does not affect his study; and Student bears all medical expenses (will not be covered under the student health scheme / insurance). | Continue study if: Treatment does not affect his study ;and Student bears all medical expenses (will not be covered under the student health scheme / insurance). |"
}