{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/international-joint-phd-colloquium-between-architecture-schools-from-de-montfort-university-and-universiti-teknologi-malaysia#)\n    \n*   [Instagram](https://builtsurvey.utm.my/international-joint-phd-colloquium-between-architecture-schools-from-de-montfort-university-and-universiti-teknologi-malaysia#)\n    \n*   [RSS](https://builtsurvey.utm.my/international-joint-phd-colloquium-between-architecture-schools-from-de-montfort-university-and-universiti-teknologi-malaysia#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/international-joint-phd-colloquium-between-architecture-schools-from-de-montfort-university-and-universiti-teknologi-malaysia#)\n    \n*   [Instagram](https://builtsurvey.utm.my/international-joint-phd-colloquium-between-architecture-schools-from-de-montfort-university-and-universiti-teknologi-malaysia#)\n    \n*   [RSS](https://builtsurvey.utm.my/international-joint-phd-colloquium-between-architecture-schools-from-de-montfort-university-and-universiti-teknologi-malaysia#)\n    \n\nInternational Joint PhD Colloquium Between Architecture Schools from De Montfort University and Universiti Teknologi Malaysia\n=============================================================================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Jun 22, 2021 | [Conference & Seminar](https://builtsurvey.utm.my/category/conference-seminar/)\n, [News](https://builtsurvey.utm.my/category/news/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2021/06/unnamed-560x675.png)\n\nPrepared by: AP Dr. Alice Sabrina Ismail (Director Architecture program)\n\nThe International Joint PhD Colloquium was an online intellectual discourse forum where postgraduate students showcase their research in design-related discipline across national cultures and borders. This event was conducted on the 27th May 2021 and attended by more than 100 participants from the UK, Malaysia, India and Indonesia Architecture Schools.\n\nSix prominent panellists that had represented the Universiti Teknologi Malaysia (UTM) Architecture school were Prof. Dr. Ahmad Syed Ahmad Iskandar, Dr. Sharifah Salwa Syed Madzhar, Dr. Aiman Mohd Rashid, AP Dr. Alice Sabrina Ismail, Dr. Roshida Abdul Majid and AP Dr. Lim Yaik Wah. They are also the principal and co-supervisors to the five involved PhD UTM students, Mohd Hanif Masridin, Ezad Abu Bakar, Intan Liana Samsudin, Amirul Hakim Jamil and Moses Iorakaa Ayoosu.\n\nThere were also six panellists from De Montfort University (DMU) such as Prof. Ahmed Taki, Dr. Jamileh Manoochehri, Dr. Adriana Laura Massidda, Dr. Yuri Abdul Hadi, Dr. Luis Fernando Zapata Montalvo, and Dr. Beniamino Polimeni. Their five involved PhD DMU students were Zainab Mohammed, Tunmise Ayodele, Bilal Alsheglawi, Shafiaa Saad Alghamdi and Enoch Odesola.\n\nThis session was moderated by Dr. Iziq Eafifi Ismail and Dr. Muhammad Faizal Abdul Rani from UTM. This joint international PhD Colloquium had provided a platform for researchers from two different continents to share valuable findings on many aspects of the built environment ranging from the history theory and criticism, sustainable technologists, urban development, and housing as well as design education, allowing for a richer exchange of knowledge and expertise.\n\nIt was an opportunity for both supervisors and students to enrich their knowledge with the current built environment trends and strengthen bilateral ties between universities for more academic and non-academic collaborations. This kind of collaboration will contribute endlessly to academic and scientific progress for both universities.\n\n*   ![](https://ci3.googleusercontent.com/proxy/UV8stZM1tjDXZ-aIKYH3NnL_nzwGAHUwTD1mlIPJpt9q2IIDlhqR3Ns4AXHTBXQgAdCmmd_59g0CB5bhpAE0kq7_Qd4pdM5CxogSjeF-WCU=s0-d-e1-ft#https://news.utm.my/wp-content/uploads/2021/06/Picture2-3.png)    ![](<Base64-Image-Removed>)    ![](<Base64-Image-Removed>)\n\n*   ![](<Base64-Image-Removed>)\n\n*   ![](<Base64-Image-Removed>)    ![](<Base64-Image-Removed>)"
}