{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/utm-online-global-classroom-on-environmental-planning-and-conservation#)\n    \n*   [Instagram](https://builtsurvey.utm.my/utm-online-global-classroom-on-environmental-planning-and-conservation#)\n    \n*   [RSS](https://builtsurvey.utm.my/utm-online-global-classroom-on-environmental-planning-and-conservation#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/utm-online-global-classroom-on-environmental-planning-and-conservation#)\n    \n*   [Instagram](https://builtsurvey.utm.my/utm-online-global-classroom-on-environmental-planning-and-conservation#)\n    \n*   [RSS](https://builtsurvey.utm.my/utm-online-global-classroom-on-environmental-planning-and-conservation#)\n    \n\nUTM Online Global Classroom on Environmental Planning and Conservation\n======================================================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Feb 2, 2021 | [Conference & Seminar](https://builtsurvey.utm.my/category/conference-seminar/)\n, [News](https://builtsurvey.utm.my/category/news/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2020/12/131762592_3907876735924370_8212957242164140771_o-1080x675.jpg)\n\nOn 30th December 2020, the Program of Urban and Regional Planning from Faculty of Built Environment and Surveying, Universiti Teknologi Malaysia (UTM) had organized and hosted an Online Global Classroom (OGC) which was co-hosted by Universitas Riau Kepualauan (UNRIKA} Indonesia. The OGC had brought a theme of “Environmental Planning and Conservation: Experience of Malaysia and Indonesia” together with two honourable speakers who were delighted to share their inputs.\n\nThe first speaker was Dr. Alpano Priyandes from UNRIKA and Prof. Dr. M Rafee from UTM. This OGC was aired through the Webex Cisco platform and moderated by Dr. AK Mohd Rafiq AK Matusin of UTM. Within two hours, there were approximately 170 inbound and outbound participants from other local universities such as Universiti Kebangsaan Malaysia (UKM), Universiti Malaysia Sabah (UMS), and Universiti Malaysia Terengganu (UMT) and international universities such as Universitas Batam (Indonesia), Universitas Trisakti (Indonesia), and Rakuno Gakuen Universiti (Japan).\n\nThe OGC began with the sharing input from Dr. Alpano Priyandes of UNRIKA titled “Environmental Carrying Capacity and Industrial Development in the Island City of Batam”. Dr. Alpano had started his sharing by introducing Batam Island to the audience.  The main topic of his sharing was the discussion on the current development of Batam Island Indonesia particularly in the perspective of carrying capacity. Dr. Alpano also had described the challenges of Batam Island people in getting sufficient clean water due to water shortage issues and infrastructure limitations.\n\nMost importantly, the carrying capacity issue of Batam’s natural resources is exacerbated by the immigration of Indonesian people into the island year by year which has caused the increasing demand for clean water in Batam Island. This has made the local authority to control and limit the amount of water supply per day to the household and commercial users. Therefore, Dr. Alpano and his team have come out with some potential projects to increase the supply-demand of clean water in Batam Island sustainably.\n\n![](https://ci5.googleusercontent.com/proxy/ScZeIgGGM_hNkRxM8BpEqRgegJifRnB8me9WicFX92oaQaiinz99taVDvxVpF6kJew-lyDTcXT6U3SpMC5thuyRKx9o_eintbAl2agiF9z3DBQ=s0-d-e1-ft#https://news.utm.my/wp-content/uploads/2021/01/2-1-1024x524.png)\n\nThe OGC input sharing session was then continued with the presentation by Prof. Dr. M Rafee titled “Community Participation for Environmental Conservation: Citizen Science Spurred on by Mobile Apps”. He had focused more on the trending of scientific data collection medium especially through mobile apps which can be used by scientific communities around the world. The trending had shown how the changes of technology improved and created a new scientific culture that is able to improve upon triple interaction between science, society, and policy in the dual pursuit of more democratic research and decision-making.\n\nProf. Dr. Rafee also had shared one of his current projects, “My Citizen Science Project Using iNaturalist” where UTM was part of the project site. He explained that iNaturalist basically established an online database of the campus’ flora and fauna for research and Teaching and Learning (T&L) purposes. The app will be able to turn the photos that were taken (flora and fauna) from the user into data. Thus, the scientist citizens would be able to store their observation collection into iNaturalist. Importantly, the iNaturalist is useful for biodiversity conservation, educational, awareness, and edutourism activities. The OGC was concluded with an active question and answer among participants and speakers.\n\n![](<Base64-Image-Removed>)\n\nPrepared by: AK MOHD RAFIQ AK MATUSIN"
}