{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/majlis-pelancaran-program-bangsa-johor-bahagia#)\n    \n*   [Instagram](https://builtsurvey.utm.my/majlis-pelancaran-program-bangsa-johor-bahagia#)\n    \n*   [RSS](https://builtsurvey.utm.my/majlis-pelancaran-program-bangsa-johor-bahagia#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/majlis-pelancaran-program-bangsa-johor-bahagia#)\n    \n*   [Instagram](https://builtsurvey.utm.my/majlis-pelancaran-program-bangsa-johor-bahagia#)\n    \n*   [RSS](https://builtsurvey.utm.my/majlis-pelancaran-program-bangsa-johor-bahagia#)\n    \n\nMajlis Pelancaran Program Bangsa Johor Bahagia\n==============================================\n\nby [webmaster](https://builtsurvey.utm.my/author/sazizul/ \"Posts by webmaster\")\n | Mar 18, 2019 | [CSR](https://builtsurvey.utm.my/category/csr/)\n, [event](https://builtsurvey.utm.my/category/event/)\n, [News](https://builtsurvey.utm.my/category/news/)\n, [newspaper](https://builtsurvey.utm.my/category/newspaper/)\n, [photo](https://builtsurvey.utm.my/category/photo/)\n\n![](https://builtsurvey.utm.my/wp-content/uploads/2019/03/54278850_2253012731620441_4117621164270944256_o-1080x675.jpg)\n\nProgram Bangsa Johor Bahagia (BJB), yang diilhamkan DYMM Sultan Johor dan DYMM Permaisuri Johor menunjukkan keprihatinan Baginda berdua dalam membantu meningkatkan kualiti hidup golongan kurang kemampuan di bandar. Baginda Tuanku Sultan Ibrahim Ibni Almarhum Sultan Iskandar dan DYMM Permaisuri Johor Raja Zarith Sofiah Binti Almarhum Sultan Idris Shah mula membincangkan inisiatif murni ini sejak tahun lalu.\n\nPada hari ini (17 Mac), majlis pelancaran Program Bangsa Johor Bahagia telah disempurnakan oleh DYMM Permaisuri Johor Raja Zarith Sofiah di Dewan Sultan Iskandar, Universiti Teknologi Malaysia (UTM), Skudai. Raja Zarith Sofiah bertitah, Program Bangsa Johor Bahagia bukan sahaja dapat mewujudkan sebuah kawasan kediaman yang lestari, malah diyakini mampu membendung masalah sosial dalam kalangan generasi muda, di samping membentuk masyarakat yang pro-aktif. Projek perintis itu dilaksanakan dengan kerjasama Yayasan Sultan Ibrahim Johor, Yayasan Raja Zarith Sofiah Negeri Johor yang berganding bahu bersama Majlis Bandaraya Iskandar Puteri serta UTM.\n\nProjek itu dilaksanakan dan disusun mengikut dua fasa bersama penduduk Flat Kangkar Pulai, di mana aktviti bagi fasa pertama telah dilaksanakan pada September dan Oktober 2018, manakala aktiviti fasa kedua sedang dilaksanakan bermula Mac 2019 dan dijangka selesai Mei 2019. Dalam menyokong matlamat dan aspirasi projek perintis Bangsa Johor Bahagia, UTM juga membangunkan empat program iaitu program komuniti berjaya, program fasiliti komuniti sejahtera, program persekitaraan kejiranan lestari dan program komuniti digital beretika."
}