{
  "markdown": "Laboratory Induction Session by Institute of High Voltage and High Current\n==========================================================================\n\nby [powerpic](https://fke.utm.my/author/powerpic/ \"Posts by powerpic\")\n | Oct 25, 2017 | [POWER](https://fke.utm.my/category/power/)\n\n![](https://fke.utm.my/wp-content/uploads/2017/10/IVAT-Induction-5.jpg)\n\nOn 24 October 2017, the Institute of High Voltage and High Current (IVAT) of the Faculty of Electrical Engineering (FKE), Universiti Teknologi Malaysia (UTM), organised a laboratory induction session for its undergraduate and postgraduate students needing access to the high voltage laboratory.\n\nIn line with UTM’s aspiration to have a safe and healthy workspace for its students, the 2-hour induction session intended to raise the awareness of the students on safety, health and environmental issues when carrying out their works in the high voltage laboratory. These include the need to obtain the necessary permission prior to accessing the laboratory, take appropriate measures to prevent hazards in the laboratory, use appropriate personal protective equipment for different tasks, and understand emergency response procedures.\n\nFKE wishes to thank the Director of IVAT, Professor Dr. Zulkurnain Abdul Malek, the Laboratory Head of IVAT, Ir. Dr. Lau Kwan Yiew, and the Assistant Engineer of IVAT, Mr. Zamri Kassim, for delivering the speech on safety and health related practices during the induction session.\n\n![ivat-induction-1](https://fke.utm.my/wp-content/uploads/2017/10/IVAT-Induction-1.jpg)\n\nProfessor Dr. Zulkurnain delivering his speech.\n\n![ivat-induction-2](https://fke.utm.my/wp-content/uploads/2017/10/IVAT-Induction-2.jpg)\n\nIr. Dr. Lau briefing on the importance of safety and health.\n\n![ivat-induction-3](https://fke.utm.my/wp-content/uploads/2017/10/IVAT-Induction-3.jpg)\n\nMr. Zamri explaining on the health and safety procedures.\n\nBy Ir. Dr. Lau Kwan Yiew, Universiti Teknologi Malaysia.\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/laboratory-induction-session-by-institute-of-high-voltage-and-high-current#)"
}