{
  "markdown": "Micron Global Female Mentorship Program for Undergraduates and Graduates\n========================================================================\n\nby [ecepic](https://fke.utm.my/author/ecepic/ \"Posts by ecepic\")\n | Jan 13, 2022 | [Anouncement](https://fke.utm.my/category/anouncement/)\n, [ECE](https://fke.utm.my/category/ece/)\n, [Faculty](https://fke.utm.my/category/faculty/)\n\n![](https://fke.utm.my/wp-content/uploads/2022/01/image004.jpg)\n\n**Micron Global Female Mentorship Program** is around the corner.\n\n**Benefit of the program to students****:**\n\nTo **be mentored** by Micron global female leaders and **be hired** by Micron at the end of this 8-week program. **Kindly encourage them to apply effective today.**\n\n**Program details and the instructions on how to apply can be found below:**\n\n**Micron Global Female Mentorship Program**\n\n_As a world leader in memory and storage solutions, Micron Technology lives its vision of transforming how the world uses information to enrich life for all__._\n\nWith our unwavering commitment to people, communities, and society, we are offering female students all over the world an **opportunity to be mentored by Micron global female Leaders**. \n\n **Please note**: To be considered for the program, you need to apply by **January 23, 2022.** \n\n**What is the Micron Global Female Mentorship Program?**\n\nThe program will run in **February – April 2022**. Through a series of weekly mentorship sessions, participants in the Program will learn about the professional world, acquire new skills, find their voice, and get help in launching successful careers. \n\n**Who can participate?**\n\nThe program is open to all female students pursuing an undergraduate or graduate degree in Electrical/Electronic Engineering, Computer Engineering, Data Science, Artificial Intelligence / Machine Learning, Mathematics/Statistics, or Materials Science and graduating in 2023 or 2024. Because of the global nature of this program, all participants **are expected to be proficient in the English language.**\n\n#### **How to apply for Micron Global Female Mentorship Program?**\n\n**Write a one-page essay and answer the following questions:**\n\n*   Why are you interested in joining Micron Global Female Mentorship Program?\n*   Why you think you should be selected to participate in this program?\n*   What do you expect from this program?\n\nFor more information about the program and instructions on how to apply, **scan the QR code** below with your mobile device or manually type the URL, then follow the instructions to upload your resume and essay.\n\n![](https://fke.utm.my/wp-content/uploads/2022/01/image004.jpg)\n\nClose this module\n\n![](https://fke.utm.my/wp-content/uploads/2025/03/CSI-FKE-2025-1.jpeg)\n\n[ENTER](https://forms.gle/cY3JjRxyTnPs4CnXA)\n\n[Never see this message again.](https://fke.utm.my/micron-global-female-mentorship-program-for-undergraduates-and-graduates#)"
}