{
  "markdown": "+6 07 5557351 [fabu@utm.my](mailto:fabu@utm.my)\n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/rural-rejuvenation-plan-to-balance-development#)\n    \n*   [Instagram](https://builtsurvey.utm.my/rural-rejuvenation-plan-to-balance-development#)\n    \n*   [RSS](https://builtsurvey.utm.my/rural-rejuvenation-plan-to-balance-development#)\n    \n\n*   [Facebook](https://www.facebook.com/built.surveyUTM/)\n    \n*   [X](https://builtsurvey.utm.my/rural-rejuvenation-plan-to-balance-development#)\n    \n*   [Instagram](https://builtsurvey.utm.my/rural-rejuvenation-plan-to-balance-development#)\n    \n*   [RSS](https://builtsurvey.utm.my/rural-rejuvenation-plan-to-balance-development#)\n    \n\nRural Rejuvenation Plan to Balance Development\n==============================================\n\nby [webmaster FAB](https://builtsurvey.utm.my/author/norazreen/ \"Posts by webmaster FAB\")\n | Aug 17, 2016 | [In The Press](https://builtsurvey.utm.my/category/in-the-press/)\n, [News](https://builtsurvey.utm.my/category/news/)\n, [newspaper](https://builtsurvey.utm.my/category/newspaper/)\n\n![](http://www.thestar.com.my/~/media/online/2016/08/16/20/47/mets_sg_1708_jbzrural150816_pg3_sheila_1.ashx/?w=620&h=413&crop=1&hash=49061AA808B4523EA83E7EB88DA807B102213310)\n\nProf Wahid (left) exchanging documents with Sukamerta as Mohamed Khaled (centre) looks on during a ceremony at UTM. Photo: The Star\n\n**JOHOR BARU:** The state government will be launching the rural area rejuvenation plan before the end of the year to balance the rural-urban growth and development in Johor.\n\nMentri Besar Datuk Mohamed Khaled Nordin said among the approach included WiFi connection, good schools and quality healthcare services for rural people.\n\nHe said the “soul and essence of the villages” in Johor must be preserved and maintained while at the same time rural areas needed to be rejuvenated to benefit the people.\n\n“We are not talking about constructing high-rise buildings in the (rural) areas or turning them into urban dwellings,” Mohamed Khaled said on Monday.\n\nHe said this after delivering a keynote address at the Seventh International Conference and Field Study Rural Research and Planning Group 2016 at Universiti Teknologi Malaysia (UTM) here.\n\nThe event was jointly organised by UTM and Bait Al-Amanah, a think-tank of Johor Umno and attended by 140 participants from Cambodia, Indonesia, India, Japan, South Korea, Singapore, the United Kingdom and Malaysia.\n\nMohamed Khaled said the government acknowledged the importance of rural areas and the state authorities would continue to look at ways to rejuvenate the areas.\n\n“We need to inject new ideas into the areas from time to time, such as how to uplift the living standard of rural people and assist them to get out of the poverty level,’’ he said.\n\nMohamed Khaled said that there was an “objectively correct” approach to rural development as the process was influenced by time, space and culture.\n\nHe added that the term rural development signified overall development of rural areas to improve the quality of life of rural people.\n\nEarlier, Mohamed Khaled witnessed the signing of research documents between UTM and Universitas Mahasaraswati, Denpasar, Bali, Indonesia.\n\nUTM was represented by its vice-chancellor Prof Datuk Wahid Omar while Universitas Mahasaraswati rector Dr I Made Sukamerta signed on behalf of the university.\n\nSource: [The Star](http://www.thestar.com.my/metro/community/2016/08/17/rural-rejuvenation-plan-to-balance-development/)\n (Wednesday, 17th August 2016)"
}